{
  "metadata": {
    "consultant_name": "Shelton Frimpong",
    "week_number": 10,
    "date_range": "12-30_01-03",
    "report_type": "Collaborative Planning"
  },
  "total_number_of_calls": 209,
  "team_average_total_number_of_calls_per_sales_consultant": 93.375,
  "number_of_calls_over_2_minutes": {
    "absolute_number": 58,
    "team_average_absolute_number": 26.6875
  },
  "percent_of_calls_over_2_minutes": {
    "percentage": 27.751196172248804,
    "team_average_percentage": 14.38995377453293
  },
  "number_of_calls_under_2_minutes": {
    "absolute_number": 151,
    "team_average_absolute_number": 66.6875
  },
  "percent_of_calls_under_2_minutes": {
    "percentage": 72.24880382775119,
    "team_average_percentage": 35.61004622546707
  },
  "average_talking_percentage": {
    "individual_average": 48.61950935153717,
    "team_average": 51.280019574376695
  },
  "excluded_transcripts": {
    "individual_excluded_transcripts": 151,
    "team_total_excluded_transcripts": 1067
  },
  "behavioral_scores": [
    {
      "label": "week-6_12-02_12-06",
      "average_final_ranking_score_eligible_transcripts": 131.37,
      "average_final_ranking_score_all_transcripts_over_2_mins": 75.44,
      "team_average_final_ranking_score_eligible_transcripts": 181.48,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 131.4
    },
    {
      "label": "week-9_12-23_12-27",
      "average_final_ranking_score_eligible_transcripts": 145.5,
      "average_final_ranking_score_all_transcripts_over_2_mins": 91.58,
      "team_average_final_ranking_score_eligible_transcripts": 160.73,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 129.43
    },
    {
      "label": "week-10_12-30_01-03",
      "average_final_ranking_score_eligible_transcripts": 157.14,
      "average_final_ranking_score_all_transcripts_over_2_mins": 120.5,
      "team_average_final_ranking_score_eligible_transcripts": 178.81,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 131.7
    }
  ],
  "themes": {
    "positive": [
      {
        "headline": "Career-Aligned Educational Planning",
        "explanation": "Effectively connecting course options with students' professional goals while outlining clear progression pathways"
      },
      {
        "headline": "Flexible Study Solutions",
        "explanation": "Successfully demonstrating program adaptability to accommodate diverse student work and life commitments"
      },
      {
        "headline": "Proactive Support Integration",
        "explanation": "Taking initiative to outline comprehensive support systems and resources available throughout student journey"
      }
    ],
    "improvement": [
      {
        "headline": "Enhanced Goal Exploration",
        "explanation": "Need for deeper discussion of student career aspirations and long-term educational objectives"
      },
      {
        "headline": "Comprehensive Financial Planning",
        "explanation": "More thorough exploration needed of financial support options and payment strategies"
      },
      {
        "headline": "Emotional Support Enhancement",
        "explanation": "Greater emphasis needed on validating and addressing student concerns while providing practical guidance"
      }
    ]
  },
  "conversation_analysis": {
    "condensed": {
      "conversations": [
        {
          "id": 1,
          "title": "Effective Flexible Study Options Discussion",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "591330759172_1981",
              "segment_id": "88",
              "timestamp": null
            },
            "supporting_calls": []
          },
          "student_trigger": "Student indicated challenges with shift work scheduling.",
          "consultant_response": "Consultant proactively discussed: 'I understand managing shift work can be challenging. Let's look at how our flexible study options could work around your roster.'",
          "context_impact": "Addressing work-study balance concerns is crucial for student confidence in program completion.",
          "recommended_approach": "None needed - excellent example of collaborative planning addressing student needs."
        },
        {
          "id": 2,
          "title": "Effective Course Structure Communication",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "591330759172_1982",
              "segment_id": "45",
              "timestamp": null
            },
            "supporting_calls": []
          },
          "student_trigger": "The student expressed understanding of basic fundamentals while seeking clarity about course depth.",
          "consultant_response": "The consultant effectively explained: 'So look, with this course, it's only four subjects. It's a grad cert level, so you won't go too in-depth with those things in particular.'",
          "context_impact": "This represents a key moment where aligning course structure with student expectations could influence enrollment decision.",
          "recommended_approach": "None needed - consultant successfully balanced course explanation with student's expressed knowledge level."
        },
        {
          "id": 3,
          "title": "Career-Aligned Course Planning",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "591330759172_1961",
              "segment_id": "19",
              "timestamp": null
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed clear career goal of joining police force next year.",
          "consultant_response": "Consultant suggested relevant pathway: 'Yes, we have a course that came about earlier this year - the Undergraduate Certificate of Criminal Justice and Criminology.'",
          "context_impact": "Critical opportunity to demonstrate course alignment with career aspirations.",
          "recommended_approach": "Could explore specific police force requirements and timeline alignment."
        },
        {
          "id": 4,
          "title": "Limited Career Goal Exploration",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "3",
              "segment_id": "17",
              "timestamp": "3:00"
            },
            "supporting_calls": [
              {
                "call_id": "591330759172_1985",
                "segment_id": "22",
                "timestamp": null
              }
            ]
          },
          "student_trigger": "Students expressed desire for career change or advancement through education.",
          "consultant_response": "Basic course information provided without exploring career aspirations or creating detailed study plans.",
          "context_impact": "Missed opportunity to align educational planning with career objectives.",
          "recommended_approach": "Should engage in deeper discussion of career goals and develop aligned study pathways."
        },
        {
          "id": 5,
          "title": "Financial Planning Support Enhancement",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "591330759172_1986",
              "segment_id": "49",
              "timestamp": "1:06"
            },
            "supporting_calls": [
              {
                "call_id": "591330759172_1987",
                "segment_id": "55",
                "timestamp": null
              }
            ]
          },
          "student_trigger": "Students inquiring about course costs, available subsidies, and financial support mechanisms.",
          "consultant_response": "Basic responses about Commonwealth support without exploring full range of options.",
          "context_impact": "Financial considerations representing critical decision factors requiring comprehensive guidance.",
          "recommended_approach": "Should provide detailed financial planning including all support options and payment plans."
        }
      ]
    },
    "verbose": {
      "conversations": [
        {
          "id": 1,
          "title": "Effective Flexible Study Options Discussion",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "591330759172_1981",
              "segment_id": "88",
              "timestamp": null
            },
            "supporting_calls": []
          },
          "student_trigger": "At segment 88, the student expressed concerns about managing their shift work schedule alongside their studies, indicating a need for flexible learning options that could accommodate their variable work hours. This represented a crucial moment for addressing work-life-study balance concerns that could significantly impact their confidence in program completion.",
          "consultant_response": "The consultant demonstrated excellent collaborative planning skills by acknowledging the challenge and immediately engaging in solution-focused discussion: 'I understand managing shift work can be challenging. Let's look at how our flexible study options could work around your roster.' This response showed empathy while proactively addressing the practical aspects of balancing work and study commitments. The approach effectively demonstrated the institution's ability to accommodate diverse student needs.",
          "priority": "high",
          "recommended_approach": "The consultant's approach was ideal and could serve as a model for similar situations. They validated the student's concerns while offering practical solutions, creating a collaborative atmosphere for planning. This example effectively demonstrates how to balance empathy with practical guidance in addressing student needs."
        },
        {
          "id": 2,
          "title": "Effective Course Structure Communication",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "591330759172_1982",
              "segment_id": "45",
              "timestamp": null
            },
            "supporting_calls": []
          },
          "student_trigger": "During the conversation, the student demonstrated basic understanding of fundamentals while seeking specific clarity about the depth and structure of the course. This moment represented a critical opportunity to align course expectations with the student's current knowledge level and learning goals.",
          "consultant_response": "The consultant provided a clear, concise explanation that effectively addressed the student's needs: 'So look, with this course, it's only four subjects. It's a grad cert level, so you won't go too in-depth with those things in particular.' This response successfully balanced providing structural information while acknowledging the student's existing understanding, demonstrating strong collaborative planning by tailoring the explanation to the student's level.",
          "priority": "medium",
          "recommended_approach": "The consultant's approach was optimal, providing clear, targeted information while maintaining awareness of the student's knowledge level. No improvements needed as the response effectively addressed the student's needs while maintaining appropriate depth of explanation."
        },
        {
          "id": 3,
          "title": "Career-Aligned Course Planning",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "591330759172_1961",
              "segment_id": "19",
              "timestamp": null
            },
            "supporting_calls": []
          },
          "student_trigger": "At segment 19, the student expressed: 'I'm looking for an online course, I'm not sure if I want to do the whole course or just some selected subjects because I'm to join the police force next year.' This statement revealed both immediate educational interests and future career aspirations, presenting a crucial opportunity for collaborative planning that could significantly impact enrollment decisions.",
          "consultant_response": "The consultant responded with a targeted solution: 'Yes, I guess we do have a course that kind of came about a bit earlier this year. It's called the Undergraduate Certificate of Criminal Justice and Criminology... this will go towards that as well.' This approach demonstrated understanding of both immediate needs and long-term career goals.",
          "priority": "high",
          "recommended_approach": "To enhance this interaction, the consultant could first acknowledge the career goal: 'Your interest in joining the police force is an excellent starting point.' Then explore specific requirements: 'Let's look at how our Criminal Justice certificate aligns with police force requirements and your timeline.' Finally, outline flexibility options: 'We can structure your study to complement your police force application process. How does that sound?'"
        },
        {
          "id": 4,
          "title": "Limited Career Goal Exploration",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "3",
              "segment_id": "17",
              "timestamp": "3:00"
            },
            "supporting_calls": [
              {
                "call_id": "591330759172_1985",
                "segment_id": "22",
                "timestamp": null
              }
            ]
          },
          "student_trigger": "Multiple students expressed desires for career advancement or transition through education, including statements about wanting to change careers or enhance professional opportunities. These moments presented crucial opportunities for meaningful collaborative planning around career objectives.",
          "consultant_response": "Consultants typically provided basic course information and entry requirements without exploring career aspirations or developing comprehensive study plans aligned with professional goals. This represented a missed opportunity for deeper engagement with students' career objectives and creation of tailored educational pathways.",
          "priority": "high",
          "recommended_approach": "Should begin with deeper exploration of career objectives: 'Tell me more about your career goals and how you see education supporting them.' Then create detailed study plans aligned with these goals, including: 1) Discussion of potential career pathways, 2) Timeline options that match career objectives, 3) Specific course selections that support intended career outcomes, 4) Industry requirements and qualifications, and 5) Relevant success stories from similar career transitions."
        },
        {
          "id": 5,
          "title": "Financial Planning Support Enhancement",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "591330759172_1986",
              "segment_id": "49",
              "timestamp": "1:06"
            },
            "supporting_calls": [
              {
                "call_id": "591330759172_1987",
                "segment_id": "55",
                "timestamp": null
              }
            ]
          },
          "student_trigger": "Multiple students raised financial concerns through direct questions about costs, subsidies, and support options: 'What I want to know is how much is the cost for the whole course and can I apply subsidy?' These inquiries revealed financial considerations as crucial factors in enrollment decisions.",
          "consultant_response": "Consultants typically provided limited responses focused on basic Commonwealth support information or deflected to other team members: 'If you're a permanent resident, you can get commonwealth support' without exploring comprehensive financial planning options or addressing underlying affordability concerns.",
          "priority": "high",
          "recommended_approach": "Consultants should implement a comprehensive financial planning approach: 1) Acknowledge the importance of financial planning in educational decisions, 2) Provide detailed breakdowns of course costs and payment structures, 3) Explore all available financial support options including scholarships and grants, 4) Discuss budgeting strategies and financial management resources, 5) Offer to connect students with financial advisors for detailed planning."
        }
      ]
    }
  }
}