{
  "metadata": {
    "consultant_name": "Alexandra Kepas",
    "week_number": 16,
    "date_range": "02-10_02-14",
    "report_type": "Collaborative Planning"
  },
  "total_number_of_calls": 185,
  "team_average_total_number_of_calls_per_sales_consultant": 242.8125,
  "number_of_calls_over_2_minutes": {
    "absolute_number": 52,
    "team_average_absolute_number": 62.3125
  },
  "percent_of_calls_over_2_minutes": {
    "percentage": 28.10810810810811,
    "team_average_percentage": 25.75705321113411
  },
  "number_of_calls_under_2_minutes": {
    "absolute_number": 133,
    "team_average_absolute_number": 180.5
  },
  "percent_of_calls_under_2_minutes": {
    "percentage": 71.89189189189189,
    "team_average_percentage": 74.2429467888659
  },
  "average_talking_percentage": {
    "individual_average": 49.37189555322032,
    "team_average": 53.5140458127338
  },
  "excluded_transcripts": {
    "individual_excluded_transcripts": 133,
    "team_total_excluded_transcripts": 2888
  },
  "behavioral_scores": [
    {
      "label": "week-11_01-06_01-10",
      "average_final_ranking_score_eligible_transcripts": 158.71,
      "average_final_ranking_score_all_transcripts_over_2_mins": 115.39,
      "team_average_final_ranking_score_eligible_transcripts": 174.2,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 118.12
    },
    {
      "label": "week-12_01-13_01-17",
      "average_final_ranking_score_eligible_transcripts": 154.77,
      "average_final_ranking_score_all_transcripts_over_2_mins": 124.51,
      "team_average_final_ranking_score_eligible_transcripts": 157.75,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 113.37
    },
    {
      "label": "week-13_01-20_01-24",
      "average_final_ranking_score_eligible_transcripts": 154.06,
      "average_final_ranking_score_all_transcripts_over_2_mins": 122.25,
      "team_average_final_ranking_score_eligible_transcripts": 162.74,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 120.37
    },
    {
      "label": "week-14_01-27_01-31",
      "average_final_ranking_score_eligible_transcripts": 130.97,
      "average_final_ranking_score_all_transcripts_over_2_mins": 125.62,
      "team_average_final_ranking_score_eligible_transcripts": 155.43,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 112.46
    },
    {
      "label": "week-15_02-03_02-07",
      "average_final_ranking_score_eligible_transcripts": 175.45,
      "average_final_ranking_score_all_transcripts_over_2_mins": 115.8,
      "team_average_final_ranking_score_eligible_transcripts": 157.11,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 113.21
    },
    {
      "label": "week-16_02-10_02-14",
      "average_final_ranking_score_eligible_transcripts": 97.56,
      "average_final_ranking_score_all_transcripts_over_2_mins": 115.05,
      "team_average_final_ranking_score_eligible_transcripts": 163.3,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 109.25
    }
  ],
  "themes": {
    "positive": [
      {
        "headline": "Strategic Pathway Planning",
        "explanation": "Consultants effectively create personalized educational pathways that balance immediate constraints with long-term aspirations while maintaining enrollment momentum through comprehensive exploration of options"
      },
      {
        "headline": "Flexible Study Integration",
        "explanation": "Strong demonstration of how program flexibility accommodates diverse student circumstances and commitments through detailed examples and personalized planning approaches"
      },
      {
        "headline": "Proactive Support Navigation",
        "explanation": "Effective guidance through program requirements and support services while maintaining appropriate boundaries between sales and post-enrollment roles"
      }
    ],
    "improvement": [
      {
        "headline": "Career Development Integration",
        "explanation": "Enhanced exploration needed of how program elements align with specific workplace challenges and career goals through more comprehensive collaborative planning"
      },
      {
        "headline": "Return to Study Confidence",
        "explanation": "More comprehensive support needed for students returning to education after extended breaks through detailed exploration of support services and specific success strategies"
      },
      {
        "headline": "Study Schedule Optimization",
        "explanation": "Stronger collaborative planning needed around specific study scheduling strategies and personal circumstance integration with concrete success examples"
      }
    ]
  },
  "conversation_analysis": {
    "condensed": {
      "conversations": [
        {
          "id": 1,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "Student expressed: 'I work rotating shifts at the hospital, not sure how I'll manage study' (call_595732493616, seg_23), revealing a critical need to demonstrate practical study flexibility.",
          "consultant_response": "Consultant provided practical solution: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24), effectively showing real-world flexibility.",
          "context_impact": "This moment required clear demonstration of how our program design specifically accommodates healthcare shift workers to maintain enrollment momentum.",
          "recommended_approach": "Include more specific examples of successful study patterns from current healthcare students and detailed strategies for different shift patterns."
        },
        {
          "id": 2,
          "title": "Career Path Decision Support",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595908510694",
              "segment_id": "135",
              "timestamp": "5:45"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'I've been tossing back and forth to do teaching for about five years, but I couldn't decide on high school or primary school, so.' (call_595908510694, seg_135), revealing significant career pathway indecision.",
          "consultant_response": "Consultant provided balanced guidance: 'I personally would always have a preference to high school... But obviously the incentives and the drive for secondary school teachers means that upon completion of the course, at least there's a bit more job security' (call_595908510694, seg_138).",
          "context_impact": "Critical moment for collaborative planning to help transform prolonged career indecision into actionable enrollment plans.",
          "recommended_approach": "Include more specific examples from successful graduates in both primary and secondary teaching roles with detailed career progression stories."
        },
        {
          "id": 3,
          "title": "Documentation Challenge Resolution",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596019635356",
              "segment_id": "23",
              "timestamp": "2:09"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed: 'Because I contacted one university and they wanted to show my percentage what I got in the course, and because it was such a long time ago, they don't have record of that' (call_596019635356, seg_18).",
          "consultant_response": "Consultant outlined multiple options: 'We have a few different options... if you have five years of full-time relevant work experience, we can send that off for approval' (call_596019635356, seg_23).",
          "context_impact": "Key moment to demonstrate flexible pathways and maintain enrollment momentum despite documentation barriers from previous institution experience.",
          "recommended_approach": "Proactively outline all alternative documentation pathways and include specific success stories of students who entered through similar routes."
        },
        {
          "id": 4,
          "title": "Return to Study Confidence",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596178594323",
              "segment_id": "23",
              "timestamp": "2:09"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student revealed: 'I've never actually written an essay before' (call_596178594323, seg_23), indicating significant anxiety about academic readiness.",
          "consultant_response": "Consultant provided basic reassurance about introductory units but missed opportunity to detail specific academic support services and success pathways.",
          "context_impact": "Critical opportunity to build confidence through comprehensive support services and success strategies for returning students.",
          "recommended_approach": "Create detailed discussion of specific academic support services, including writing workshops, one-on-one tutoring, and concrete examples of successful returning students."
        },
        {
          "id": 5,
          "title": "Study Schedule Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596020087492",
              "segment_id": "127",
              "timestamp": "18:35"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed: 'Well, if it's going to take the same time anyways, I'd probably just do the two to start off with then' (call_596020087492, seg_127).",
          "consultant_response": "Consultant agreed with choice but missed opportunity to explore specific time management strategies and support services for success.",
          "context_impact": "Key moment to ensure appropriate study load through detailed planning and support resource discussion.",
          "recommended_approach": "Develop comprehensive discussion of time management strategies, study planning techniques, and available support services with specific examples of successful students."
        },
        {
          "id": 6,
          "title": "Entry Requirements Guidance",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596019635356",
              "segment_id": "12",
              "timestamp": "1:07"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student asked: 'I just want to see what requirements are needed to get into the course' (call_596019635356, seg_12), seeking clarity on entry pathways.",
          "consultant_response": "Consultant effectively outlined multiple pathways: 'Yeah, so we have a few different options that we can look at for you...' (call_596019635356, seg_23), showing various entry routes while maintaining standards.",
          "context_impact": "Critical moment to demonstrate pathway flexibility and maintain enrollment momentum through clear requirement explanation.",
          "recommended_approach": "Include more specific examples of successful alternative entry pathways and detailed student success stories to demonstrate viability of each option."
        }
      ]
    },
    "verbose": {
      "conversations": [
        {
          "id": 1,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "In call 595732493616 (segment 23), the student expressed significant concern about balancing study with shift work: 'I work rotating shifts at the hospital, not sure how I'll manage study.' Similar concerns emerged in call 595732548084 (segment 163) where another healthcare worker noted: 'My roster changes every week, and I often work nights.' These moments represented critical opportunities to demonstrate how our program specifically accommodates healthcare professionals' unique scheduling challenges.",
          "consultant_response": "The primary consultant demonstrated strong understanding of healthcare workflows, responding with: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24). This practical example resonated strongly, with the student responding: 'That actually sounds manageable' (seg_25). In the supporting call, the consultant built on the flexible access theme: 'The beauty of our platform is you can switch between online and offline study. Some students download their materials before night shifts' (call_595732548084, seg_164). Both consultants effectively moved the conversation from 'if' to 'how', directly addressing the practical concerns while maintaining momentum.",
          "priority": "high",
          "recommended_approach": "When addressing shift workers' scheduling concerns, start by acknowledging their specific work pattern before showing how our program design aligns with healthcare workflows. Share concrete examples of how current students manage study around shifts - whether it's downloading materials for night shifts, studying during quiet periods, or breaking study into small blocks between shifts. The key is making flexibility tangible rather than theoretical. For instance, explain how asynchronous learning means no mandatory live sessions, and offline access means study can happen even in areas with poor connectivity. For those with rotating rosters, emphasize how weekly study patterns can adapt to changing schedules. Pay particular attention to students working night shifts or long rotations, showing how our platform's flexibility specifically addresses these challenges. The goal is to transform perceived scheduling barriers into manageable planning opportunities, always grounding explanations in healthcare-specific scenarios that resonate with their experience. Share specific success stories: 'One of our current nursing students downloads her weekly materials every Sunday, completes readings during night shift breaks, and participates in online discussions during her recovery days.'"
        },
        {
          "id": 2,
          "title": "Career Path Decision Support",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595908510694",
              "segment_id": "135",
              "timestamp": "5:45"
            },
            "supporting_calls": []
          },
          "student_trigger": "During a critical moment in call 595908510694 (segment 135), the student revealed significant career indecision: 'I've been tossing back and forth to do teaching for about five years, but I couldn't decide on high school or primary school.' This disclosure represented a pivotal opportunity for collaborative planning, as the student's extended period of uncertainty suggested a need for guided exploration of teaching pathways.",
          "consultant_response": "The consultant demonstrated strong collaborative planning by sharing both personal insights and market realities: 'I mean, I personally would always have a preference to high school. I just think the content that you can teach is, I don't know, personally, just a lot better. But obviously the incentives and the drive for secondary school teachers means that upon completion of the course, at least there's a bit more job security than what there might be in a primary school setting' (segment 138). This response effectively balanced personal perspective with practical considerations, helping the student understand both the subjective and objective factors in their decision.",
          "priority": "high",
          "recommended_approach": "When students express uncertainty about career pathways, engage in structured yet flexible exploration that balances personal interests with practical considerations. Begin by acknowledging the complexity of the decision: 'It's completely natural to carefully consider these options, especially with teaching roles that can shape your entire career.' Then guide the conversation through key decision factors: 'Let's explore both paths together - have you had the chance to observe or work in either environment?' When sharing market information, always connect it directly to the student's expressed interests: 'Given your interest in subject depth, let me share how that typically plays out in secondary versus primary settings.' Include specific examples from successful graduates: 'One of our recent graduates found that her passion for detailed subject matter made secondary teaching particularly rewarding.' Pay special attention to students who show extended periods of indecision, as they often need more structured guidance. Share concrete success stories: 'A recent graduate who also struggled with this choice ultimately chose secondary teaching because she loved diving deep into specific subjects. She now teaches senior biology and finds it incredibly fulfilling.' The goal is to transform uncertainty into informed decision-making through real examples and practical insights, while maintaining appropriate boundaries between sales and career counseling roles."
        },
        {
          "id": 3,
          "title": "Documentation Challenge Resolution",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596019635356",
              "segment_id": "23",
              "timestamp": "2:09"
            },
            "supporting_calls": []
          },
          "student_trigger": "In call 596019635356 (segment 18), the student expressed frustration with documentation requirements: 'Because I contacted one university and they wanted to show my percentage what I got in the course, and because it was such a long time ago, they don't have record of that. I've only got my actual certificate.' This situation presented a critical moment where flexible solutions and clear guidance were essential to maintain enrollment momentum. The student's previous negative experience with another institution made this an especially sensitive opportunity to demonstrate our more accommodating approach.",
          "consultant_response": "The consultant effectively showcased our flexible approach to documentation requirements: 'Yeah, so we have a few different options that we can look at for you. Usually, we can accept an advanced diploma if it's over 20 years old, up to 20 years old. Outside of that, we need to seek academic approval, but you don't have the transcript... So what we have in place of that as well, what we can use is if you have five years of full-time relevant work experience, we can send that off for approval' (segment 23). This response demonstrated strong collaborative planning by immediately presenting multiple pathways and alternatives, showing how we can work with the student's existing documentation while maintaining academic standards.",
          "priority": "high",
          "recommended_approach": "When addressing documentation challenges, especially with mature students, begin by acknowledging their situation and immediately presenting flexible solutions. Start with validation: 'I understand how frustrating it can be when historical records aren't available. Let me show you how we can work with your situation.' Then outline multiple pathways, always emphasizing what's possible rather than what's missing: 'While traditional transcripts are one way to meet requirements, we've developed several alternative pathways that recognize your experience and existing qualifications.' Share specific success stories: 'Last month, we helped a student in a similar situation qualify through their industry experience when their 25-year-old academic records weren't available. They're now successfully completing their first unit.' When presenting options, maintain a collaborative tone: 'Let's explore which pathway best matches your situation. What kind of professional experience do you have in this field?' Include concrete examples: 'For instance, one of our current students qualified using a combination of their certificate and ten years of workplace experience.' The goal is to transform what seems like a barrier into a manageable process, always keeping the focus on finding solutions rather than dwelling on challenges."
        }
      ]
    }
  }
}