{
  "metadata": {
    "consultant_name": "Alyssa Pennacchia",
    "week_number": 18,
    "date_range": "02-24_02-28",
    "report_type": "Collaborative Planning"
  },
  "total_number_of_calls": 239,
  "team_average_total_number_of_calls_per_sales_consultant": 158.1818181818182,
  "number_of_calls_over_2_minutes": {
    "absolute_number": 50,
    "team_average_absolute_number": 29.09090909090909
  },
  "percent_of_calls_over_2_minutes": {
    "percentage": 20.920502092050206,
    "team_average_percentage": 12.06543043438548
  },
  "number_of_calls_under_2_minutes": {
    "absolute_number": 189,
    "team_average_absolute_number": 129.0909090909091
  },
  "percent_of_calls_under_2_minutes": {
    "percentage": 79.07949790794979,
    "team_average_percentage": 51.57093320197816
  },
  "average_talking_percentage": {
    "individual_average": 57.63096084930622,
    "team_average": 52.8184611261591
  },
  "excluded_transcripts": {
    "individual_excluded_transcripts": 189,
    "team_total_excluded_transcripts": 1420
  },
  "behavioral_scores": [
    {
      "label": "week-17_02-17_02-21",
      "average_final_ranking_score_eligible_transcripts": 112.68,
      "average_final_ranking_score_all_transcripts_over_2_mins": 100.33,
      "team_average_final_ranking_score_eligible_transcripts": 124.49,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 93.92
    },
    {
      "label": "week-18_02-24_02-28",
      "average_final_ranking_score_eligible_transcripts": 141.44,
      "average_final_ranking_score_all_transcripts_over_2_mins": 94.03,
      "team_average_final_ranking_score_eligible_transcripts": 138.95,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 104.67
    }
  ],
  "themes": {
    "positive": [
      {
        "headline": "Strategic Pathway Planning",
        "explanation": "Consultants effectively create personalized educational pathways that balance immediate constraints with long-term aspirations while maintaining enrollment momentum through clear progression steps"
      },
      {
        "headline": "Flexible Study Integration",
        "explanation": "Strong demonstration of how program flexibility accommodates diverse student circumstances including work commitments, travel requirements and collaborative learning needs through practical solutions"
      },
      {
        "headline": "Proactive Documentation Support",
        "explanation": "Effective guidance through documentation requirements with clear alternatives and support mechanisms while transforming administrative requirements into collaborative planning opportunities"
      }
    ],
    "improvement": [
      {
        "headline": "Career Value Integration",
        "explanation": "Enhanced exploration needed of how program elements and pathways align with specific career aspirations and emerging industry opportunities while maintaining appropriate role boundaries"
      },
      {
        "headline": "Return to Study Support",
        "explanation": "More comprehensive support needed for students returning to education after extended breaks through clear guidance, confidence building and practical transition strategies"
      },
      {
        "headline": "Cultural Resource Planning",
        "explanation": "Deeper exploration required of specific cultural support mechanisms and how they enhance the educational experience while creating an inclusive learning environment"
      }
    ]
  },
  "conversation_analysis": {
    "condensed": {
      "conversations": [
        {
          "id": 1,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596761550385",
              "segment_id": "71",
              "timestamp": "06:47"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'I would like to have a presence, but the online is much easier because for my job, I'm traveling overseas sometimes' (call_596761550385, seg_71), revealing critical need for program flexibility with international travel.",
          "consultant_response": "Consultant confirmed: 'It's 100% online, yeah, so you can do this course anywhere in the world. You can download materials before trips and maintain consistent progress' (call_596761550385, seg_74).",
          "context_impact": "This moment required clear demonstration of how program accommodates international travel requirements while maintaining academic engagement and progress.",
          "recommended_approach": "Include more specific examples of how current students successfully manage studies while traveling internationally, including offline access strategies and timezone management"
        },
        {
          "id": 2,
          "title": "Career Change Navigation",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596761468082",
              "segment_id": "12",
              "timestamp": "02:20"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'Complete career change...dealing with the emotional complexity and like working in the grey isn't for me' (call_596761468082, seg_12), revealing readiness for structured career transition guidance.",
          "consultant_response": "Consultant outlined clear pathway: 'A lot of people will come into Computer Science from unrelated backgrounds...we'd start you in the Graduate Certificate and then move you into the master's' (call_596761468082, seg_30), effectively normalizing the transition.",
          "context_impact": "Critical moment requiring clear demonstration of educational pathways to support career transition while maintaining student confidence through practical progression steps.",
          "recommended_approach": "Include more specific examples of successful career transitions and integrate available post-enrollment support mechanisms throughout the pathway discussion"
        },
        {
          "id": 3,
          "title": "Cultural Considerations Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "597148367687",
              "segment_id": "69",
              "timestamp": "06:37"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'Because there were special considerations because I'm Indigenous' (call_597148367687, seg_69), revealing importance of cultural identity in academic planning process.",
          "consultant_response": "Consultant acknowledged: 'That means that you can go directly to the Graduate School of Psychotherapy. I can see now actually, when I turn the page, you do have special considerations' (call_597148367687, seg_73).",
          "context_impact": "This moment required sensitive acknowledgment of cultural considerations while maintaining clear guidance on pathways and support services.",
          "recommended_approach": "Enhance discussion by proactively exploring available cultural support mechanisms and resources while demonstrating institutional commitment to inclusive learning"
        },
        {
          "id": 4,
          "title": "Return to Study Confidence",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596915529899",
              "segment_id": "112",
              "timestamp": "08:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed: 'I feel like I went to uni a long time ago. Yeah. I don't know where mine is' (call_596915529899, seg_112), revealing significant anxiety about returning to academic study.",
          "consultant_response": "Consultant missed opportunity to explore concerns and provide information about comprehensive support resources available to returning students.",
          "context_impact": "Critical moment to address concerns about returning to study while highlighting available support services and building confidence in academic capabilities.",
          "recommended_approach": "Develop comprehensive approach to building confidence for students returning after extended breaks through clear explanation of support services and transition strategies"
        },
        {
          "id": 5,
          "title": "Career Value Exploration",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596761117983",
              "segment_id": "114",
              "timestamp": "15:20"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student inquired: 'Okay, with the AI sort of stuff, what sort of roles are people generally graduating into with this' (call_596761117983, seg_114), seeking concrete career outcome examples.",
          "consultant_response": "Consultant stated: 'I'm not too sure what they're going into. We don't actually have that data' (call_596761117983, seg_115), missing chance to discuss industry trends.",
          "context_impact": "This opportunity required connecting program outcomes with emerging career opportunities while maintaining appropriate role boundaries.",
          "recommended_approach": "Develop stronger connections between program elements and potential career pathways while maintaining appropriate role boundaries and leveraging industry trend knowledge"
        },
        {
          "id": 6,
          "title": "Cultural Resource Integration",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "597148367687",
              "segment_id": "80",
              "timestamp": "08:45"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student inquired about cultural resources: 'Are there specific resources for Indigenous students?' (call_597148367687, seg_80), seeking understanding of available cultural support.",
          "consultant_response": "Consultant acknowledged availability without specifics: 'Yes, we do have resources available' (call_597148367687, seg_81), missing opportunity for detailed support discussion.",
          "context_impact": "Key moment to demonstrate institutional commitment to cultural support and inclusive learning environment through comprehensive resource discussion.",
          "recommended_approach": "Provide detailed overview of specific cultural support mechanisms and how they enhance the educational experience while creating an inclusive learning environment"
        }
      ]
    },
    "verbose": {
      "conversations": [
        {
          "id": 1,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596761550385",
              "segment_id": "71",
              "timestamp": "06:47"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student expressed critical need for program flexibility by stating: 'I would like to have a presence, but the online is much easier because for my job, I'm traveling overseas sometimes' (call_596761550385, seg_71). This revealed both their desire for engagement and practical constraints due to international travel requirements, presenting a key opportunity to demonstrate program adaptability while maintaining academic quality.",
          "consultant_response": "The consultant demonstrated strong collaborative planning by providing immediate reassurance and practical solutions: 'It's 100% online, yeah, so you can do this course anywhere in the world' (call_596761550385, seg_74). This response effectively addressed the core concern about program accessibility while traveling, confirming that geographical location would not impede their ability to participate fully in the program while maintaining academic progress.",
          "priority": "high",
          "recommended_approach": "When addressing flexibility needs for internationally mobile students, begin by validating their unique circumstances while highlighting specific program features that support global access. Start with acknowledgment: 'International travel requires special consideration, and our program is designed with global mobility in mind.' Share concrete examples: 'Our students successfully manage their studies while traveling through features like offline content access, flexible assessment deadlines, and 24/7 platform availability.' Explore their typical travel patterns: 'Understanding your travel frequency and destinations helps us show you exactly how our platform adapts to different time zones and work patterns.' Emphasize practical solutions: 'You can download materials before trips, complete assessments from any location, and maintain consistent progress regardless of your location.' Remember to highlight both technical capabilities and support mechanisms that ensure seamless study continuation during travel. The key is demonstrating how flexibility enhances rather than compromises academic quality."
        },
        {
          "id": 2,
          "title": "Career Change Navigation",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596761468082",
              "segment_id": "12",
              "timestamp": "02:20"
            },
            "supporting_calls": []
          },
          "student_trigger": "During the call, the student expressed readiness for career transition: 'Complete career change...dealing with the emotional complexity and like working in the grey isn't for me' (call_596761468082, seg_12). This statement revealed both dissatisfaction with their current field and openness to structured guidance for transition, presenting an opportunity to demonstrate clear pathways while maintaining appropriate support boundaries.",
          "consultant_response": "The consultant demonstrated strong collaborative planning by normalizing career transitions while providing clear pathways: 'A lot of people will come into Computer Science from unrelated backgrounds...we'd start you in the Graduate Certificate and then move you into the master's' (call_596761468082, seg_30). This response effectively validated the student's decision while outlining concrete steps for progression, maintaining appropriate role boundaries while showing clear support pathways.",
          "priority": "high",
          "recommended_approach": "When supporting career changers, begin by acknowledging the significance of their decision and validating any concerns they express. Start with empathetic listening to understand both the practical and emotional aspects of their desired change. When a student expresses dissatisfaction with their current field, respond with: 'Your desire for a more structured, technical role is completely understandable. Many of our successful students have made similar transitions.' Outline specific pathways while providing context about how each step contributes to their goal: 'The graduate certificate provides a strong foundation in core concepts before advancing to master's level study.' Share real examples of how previous career changers navigated the transition: 'One of our recent graduates came from a similar background and found the graduate certificate provided the perfect foundation before advancing to the master's.' Throughout the conversation, maintain focus on transforming their concerns into actionable steps while reinforcing how the program's structure supports successful career transitions. Always maintain appropriate boundaries regarding career-specific guidance, focusing on educational pathways while referring to relevant post-enrollment support services."
        },
        {
          "id": 3,
          "title": "Cultural Considerations Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "597148367687",
              "segment_id": "69",
              "timestamp": "06:37"
            },
            "supporting_calls": []
          },
          "student_trigger": "During a critical moment in the enrollment discussion, the student disclosed their Indigenous status, stating 'Because there were special considerations because I'm Indigenous' (call_597148367687, seg_69). This revelation presented a crucial opportunity to demonstrate cultural sensitivity while maintaining clear guidance about eligibility and academic pathways, requiring thoughtful integration of cultural support mechanisms.",
          "consultant_response": "The consultant demonstrated cultural awareness by immediately acknowledging and validating these considerations, responding: 'That means that you can go directly to the Graduate School of Psychotherapy. I can see now actually, when I turn the page, you do have special considerations' (call_597148367687, seg_73). This response effectively balanced validation of cultural identity with clear pathway guidance, showing respect while maintaining enrollment momentum.",
          "priority": "high",
          "recommended_approach": "When students disclose cultural considerations, particularly Indigenous status, begin by acknowledging the significance of their identity within their educational journey. Frame the conversation with statements like, 'Thank you for sharing that. Let's ensure your academic experience honors and supports your cultural background.' This creates space for deeper discussion while maintaining focus on practical planning. Consultants should then outline specific support mechanisms available, such as Indigenous student support officers, cultural mentoring programs, dedicated study spaces, and community connection opportunities. When discussing special considerations, focus on how these enhance rather than complicate the enrollment process: 'Our Indigenous student support team can help you access cultural mentoring, connect with other Indigenous students, and participate in cultural events while studying.' The key is maintaining a balance between cultural sensitivity and practical guidance, ensuring students feel both respected and supported in their academic journey while demonstrating institutional commitment to inclusive learning environments."
        },
        {
          "id": 4,
          "title": "Return to Study Confidence",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596915529899",
              "segment_id": "112",
              "timestamp": "08:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student expressed significant anxiety about returning to study: 'I feel like I went to uni a long time ago. Yeah. I don't know where mine is' (call_596915529899, seg_112). This revealed deep concerns about academic readiness after an extended break from education, presenting an opportunity to build confidence while highlighting support resources.",
          "consultant_response": "The consultant missed this critical opportunity by not addressing the underlying concerns about returning to study or providing information about available support resources. This lack of response may have left the student feeling unsupported and uncertain about their ability to succeed in the academic environment.",
          "priority": "high",
          "recommended_approach": "When students express concerns about returning to study after an extended break, begin by validating their feelings while highlighting how their life experience enhances their learning potential. Start with acknowledgment: 'Many successful students return to study after long breaks, bringing valuable professional and life experience with them.' Then outline specific support mechanisms: 'Our program includes comprehensive orientation and study skills workshops designed specifically for returning students.' Share examples of how other returning students have succeeded: 'Many students find their work experience actually gives them an advantage in applying concepts to real-world scenarios.' Address practical concerns while maintaining appropriate boundaries: 'While I focus on program information, our learning advisers can provide detailed academic support planning once you're enrolled.' Emphasize how their life experience contributes to academic success: 'Your professional experience often provides valuable context for applying theoretical concepts.' The key is building confidence while ensuring students understand the robust support system available throughout their journey, transforming perceived barriers into opportunities for success."
        },
        {
          "id": 5,
          "title": "Career Value Exploration",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596761117983",
              "segment_id": "114",
              "timestamp": "15:20"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student sought specific career outcome information, asking 'Okay, with the AI sort of stuff, what sort of roles are people generally graduating into with this' (call_596761117983, seg_114). This inquiry represented a crucial opportunity to connect program benefits with emerging career opportunities while maintaining appropriate role boundaries.",
          "consultant_response": "The consultant's response was limited: 'I'm not too sure what they're going into. We don't actually have that data' (call_596761117983, seg_115). This missed the opportunity to explore broader career possibilities or discuss how program elements align with industry trends and emerging opportunities.",
          "priority": "high",
          "recommended_approach": "When addressing career outcome questions, especially in evolving fields like AI, begin by acknowledging the dynamic nature of the industry while highlighting how program elements align with current trends. Start with statements like, 'While specific roles can vary widely in the rapidly evolving AI field, our program focuses on developing core competencies that align with industry demands.' Then explore the student's specific interests: 'What aspects of AI most interest you? This helps me highlight relevant program elements.' Even without specific graduate data, discuss how course content connects to industry needs, emerging roles, and skill requirements: 'Our AI modules focus on developing adaptable skills that prepare you for various roles in this growing field.' Connect program features to industry trends: 'The practical projects in our program often align with current industry challenges, helping you build relevant experience.' When specific outcome data isn't available, leverage program features and industry trends to illustrate career potential while maintaining appropriate role boundaries and referring to career services for detailed guidance."
        },
        {
          "id": 6,
          "title": "Cultural Resource Integration",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "597148367687",
              "segment_id": "80",
              "timestamp": "08:45"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student specifically inquired about cultural support by asking 'Are there specific resources for Indigenous students?' (call_597148367687, seg_80). This question presented a crucial opportunity to demonstrate comprehensive cultural support mechanisms and their integration throughout the student journey, highlighting institutional commitment to inclusive learning.",
          "consultant_response": "The consultant provided only a basic acknowledgment: 'Yes, we do have resources available' (call_597148367687, seg_81), missing an opportunity to detail specific cultural support mechanisms and their potential impact on the student's experience and academic success.",
          "priority": "high",
          "recommended_approach": "When addressing inquiries about cultural resources, particularly for Indigenous students, begin by affirming the institution's commitment to cultural support and inclusion. Start with: 'Yes, we have comprehensive support services specifically designed for Indigenous students that integrate throughout your entire academic journey.' Then outline specific resources: 'Our Indigenous student support team includes dedicated support officers, cultural mentors, and community liaison staff.' Provide concrete examples of available support: 'You'll have access to cultural mentoring, dedicated study spaces, community events, and opportunities to connect with other Indigenous students.' Emphasize how these resources enhance the educational experience: 'These supports create an inclusive learning environment that values and celebrates Indigenous perspectives while helping you maintain strong connections to community and culture.' Remember to highlight both academic and cultural support aspects: 'Our support services help you excel academically while maintaining and strengthening your cultural connections.' The key is demonstrating how cultural support enriches their academic journey while creating an inclusive and supportive learning environment that celebrates their identity."
        }
      ]
    }
  }
}