{
  "metadata": {
    "consultant_name": "Bridgett Young",
    "week_number": 18,
    "date_range": "02-24_02-28",
    "report_type": "Collaborative Planning"
  },
  "total_number_of_calls": 259,
  "team_average_total_number_of_calls_per_sales_consultant": 219.625,
  "number_of_calls_over_2_minutes": {
    "absolute_number": 77,
    "team_average_absolute_number": 66.0
  },
  "percent_of_calls_over_2_minutes": {
    "percentage": 29.72972972972973,
    "team_average_percentage": 30.513109725212754
  },
  "number_of_calls_under_2_minutes": {
    "absolute_number": 182,
    "team_average_absolute_number": 153.625
  },
  "percent_of_calls_under_2_minutes": {
    "percentage": 70.27027027027027,
    "team_average_percentage": 69.48689027478724
  },
  "average_talking_percentage": {
    "individual_average": 51.17447927090244,
    "team_average": 53.33855674000464
  },
  "excluded_transcripts": {
    "individual_excluded_transcripts": 182,
    "team_total_excluded_transcripts": 2458
  },
  "behavioral_scores": [
    {
      "label": "week-17_02-17_02-21",
      "average_final_ranking_score_eligible_transcripts": 151.86,
      "average_final_ranking_score_all_transcripts_over_2_mins": 106.32,
      "team_average_final_ranking_score_eligible_transcripts": 148.21,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 109.77
    },
    {
      "label": "week-18_02-24_02-28",
      "average_final_ranking_score_eligible_transcripts": 144.79,
      "average_final_ranking_score_all_transcripts_over_2_mins": 117.86,
      "team_average_final_ranking_score_eligible_transcripts": 157.4,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 113.71
    }
  ],
  "themes": {
    "positive": [
      {
        "headline": "Strategic Pathway Planning",
        "explanation": "Consultants effectively create personalized educational pathways that balance immediate constraints with long-term aspirations while maintaining enrollment momentum and demonstrating practical flexibility"
      },
      {
        "headline": "Flexible Study Integration",
        "explanation": "Strong demonstration of program adaptability in accommodating diverse student circumstances including work schedules, health conditions, and family commitments through practical solutions"
      },
      {
        "headline": "Proactive Support Integration",
        "explanation": "Effective guidance through documentation requirements and support mechanisms with clear alternatives provided while maintaining appropriate pre-enrollment boundaries"
      }
    ],
    "improvement": [
      {
        "headline": "Career Development Integration",
        "explanation": "Enhanced exploration needed of how program elements align with specific workplace challenges and career goals while maintaining appropriate guidance boundaries"
      },
      {
        "headline": "Return to Study Confidence",
        "explanation": "More comprehensive support needed for students returning to education after extended breaks, focusing on confidence building and practical success strategies"
      },
      {
        "headline": "Documentation Process Planning",
        "explanation": "Clearer collaborative planning needed around coordinating application requirements and alternative pathways when standard documentation options aren't available"
      }
    ]
  },
  "conversation_analysis": {
    "condensed": {
      "conversations": [
        {
          "id": 1,
          "title": "Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "Student expressed: 'I work rotating shifts at the hospital, not sure how I'll manage study' (call_595732493616, seg_23), revealing critical need to demonstrate practical study flexibility for healthcare workers.",
          "consultant_response": "Consultant provided practical solution: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24), effectively showing real-world flexibility.",
          "context_impact": "Clear demonstration of schedule accommodation essential for maintaining enrollment momentum with healthcare professionals.",
          "recommended_approach": "Include more specific examples of successful study patterns from current healthcare students and detailed offline study strategies."
        },
        {
          "id": 2,
          "title": "Health-Conscious Planning",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596845852606",
              "segment_id": "26",
              "timestamp": "02:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'I have ADHD and potentially some other things that are still being assessed. I guess I really like the idea of the online learning just so that I can kind of do it when I have like the strength' (call_596845852606, seg_26), seeking understanding of available support.",
          "consultant_response": "Consultant affirmed: 'Very important to us, yeah, so that the students feel that they can, you know, this should work around them' (call_596845852606, seg_32), validating student's needs while emphasizing program flexibility.",
          "context_impact": "Critical opportunity to demonstrate comprehensive support while maintaining appropriate pre-enrollment boundaries.",
          "recommended_approach": "Provide more specific examples of flexibility options and available support services within pre-enrollment scope."
        },
        {
          "id": 3,
          "title": "Career Transition Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "597069664047",
              "segment_id": "23",
              "timestamp": "5:45"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'I want to get into the education space and ideally I'd like to get in there faster than having to do a full four years first' (call_597069664047, seg_23), seeking efficient pathway into education.",
          "consultant_response": "Consultant engaged collaboratively: 'Let's explore different pathways to reach your goal - there might be multiple routes available' (call_597069664047, seg_23), effectively opening pathway discussion.",
          "context_impact": "Key moment to demonstrate program alignment with career transition goals while maintaining appropriate guidance boundaries.",
          "recommended_approach": "Develop more detailed exploration of pathway options while maintaining appropriate career guidance boundaries."
        },
        {
          "id": 4,
          "title": "Return to Study Support",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596846267949",
              "segment_id": "29",
              "timestamp": "1:37"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed: 'I had a surgery so it just wasn't the right time to be studying so it wasn't anything that you guys could have done really' (call_596846267949, seg_29), revealing past barriers to study completion.",
          "consultant_response": "Consultant replied generically: 'Well, look, you mentioned that you were browsing. If we can assist at all, do just let us know' (call_596846267949, seg_35), missing opportunity for specific support discussion.",
          "context_impact": "Past interruptions needed addressing to rebuild confidence in successful study completion.",
          "recommended_approach": "Proactively discuss specific support mechanisms for managing unexpected life events during study and rebuilding study confidence."
        },
        {
          "id": 5,
          "title": "Documentation Process Planning",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596908292707",
              "segment_id": "86",
              "timestamp": "09:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student asked: 'So if I don't have any of that, how do I get around it?' (call_596908292707, seg_86), seeking alternative documentation pathways.",
          "consultant_response": "Basic mention of STAT test without exploring full range of alternatives or creating comprehensive documentation plan.",
          "context_impact": "Clear explanation needed of documentation alternatives to prevent enrollment delays.",
          "recommended_approach": "Present comprehensive overview of documentation alternatives with clear guidance and timeline for each pathway option."
        },
        {
          "id": 6,
          "title": "Initial Engagement Structure",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596907924895",
              "segment_id": "2",
              "timestamp": "00:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student asked: 'Am I speaking with Tani?' (call_596907924895, seg_2), seeking clarity about call purpose and expectations.",
          "consultant_response": "Consultant provided basic introduction: 'This is Bridget from Swinburne Online University. How are you?' (call_596907924895, seg_6), missing opportunity for comprehensive engagement.",
          "context_impact": "Critical first impression moment requiring clear purpose establishment and collaborative planning framework.",
          "recommended_approach": "Include specific program reference and clear purpose statement while establishing appropriate collaborative planning expectations."
        }
      ]
    },
    "verbose": {
      "conversations": [
        {
          "id": 1,
          "title": "Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "During crucial discussions about program feasibility, multiple students expressed concerns about managing shift work alongside studies. In the primary example, a student stated: 'I work rotating shifts at the hospital, not sure how I'll manage study' (call_595732493616, seg_23). Similar concerns emerged across calls, with another student noting: 'My roster changes every week, and I often work nights' (call_595732548084, seg_163). These moments represented critical opportunities to demonstrate how our program specifically accommodates healthcare professionals' unique scheduling challenges.",
          "consultant_response": "The consultants demonstrated strong understanding of healthcare workflows, providing practical solutions grounded in real examples. In the primary call, the consultant responded: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24). This practical example resonated strongly, with the student responding: 'That actually sounds manageable.' The approach was reinforced in other calls, with consultants emphasizing flexible access: 'The beauty of our platform is you can switch between online and offline study. Some students download their materials before night shifts' (call_595732548084, seg_164). These responses effectively moved conversations from 'if' to 'how', maintaining enrollment momentum.",
          "priority": "high",
          "recommended_approach": "When addressing shift workers' scheduling concerns, start by acknowledging their specific work pattern before showing how our program design aligns with healthcare workflows. Begin with validation: 'I understand rotating shifts create unique challenges for studying.' Then share concrete examples: 'Many of our nursing students download materials before night shifts, using quiet periods for focused study.' For instance, explain: 'If you're working three night shifts, you might download everything on Monday, use those quiet periods around 2-3am for focused reading, then complete your discussion posts during recovery days.' The key is making flexibility tangible through real-world scenarios. Show how asynchronous learning means no mandatory live sessions, and offline access enables study even in areas with poor connectivity. For those with rotating rosters, emphasize how weekly study patterns can adapt to changing schedules. Pay particular attention to proactively addressing night shifts and long rotations, always keeping examples grounded in healthcare-specific scenarios that resonate with their experience. While maintaining appropriate pre-enrollment boundaries, demonstrate how our platform's flexibility transforms perceived scheduling barriers into manageable planning opportunities."
        },
        {
          "id": 2,
          "title": "Health-Conscious Planning",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596845852606",
              "segment_id": "26",
              "timestamp": "02:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student revealed significant personal context by stating: 'I have ADHD and potentially some other things that are still being assessed. I guess I really like the idea of the online learning just so that I can kind of do it when I have like the strength' (call_596845852606, seg_26). This disclosure represented a critical moment requiring demonstration of how the program could accommodate specific health-related study needs through flexible learning options.",
          "consultant_response": "The consultant responded with validation and reassurance: 'Very important to us, yeah, so that the students feel that they can, you know, this should work around them, not the other way around' (call_596845852606, seg_32). This response effectively acknowledged the legitimacy of the student's needs while emphasizing the program's commitment to flexibility. The approach helped alleviate potential concerns about managing studies with health considerations.",
          "priority": "high",
          "recommended_approach": "When students disclose health considerations, begin by validating their situation while maintaining appropriate pre-enrollment boundaries. Start with empathetic acknowledgment: 'Thank you for sharing that with me. It's important we understand how to best support your learning journey.' Then outline specific program features that enable success: 'Our online platform includes several tools that students find helpful for managing their studies effectively. For instance, you can access materials 24/7, set custom study schedules, and use built-in planning tools to organize your work.' When discussing support services, emphasize the framework while being careful not to promise specific accommodations: 'Once enrolled, you'll have access to our student success team, including learning advisors who can help develop personalized study strategies.' The goal is demonstrating comprehensive support availability while ensuring specific accommodation discussions happen with appropriate post-enrollment teams."
        },
        {
          "id": 3,
          "title": "Career Transition Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "597069664047",
              "segment_id": "23",
              "timestamp": "5:45"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student expressed clear career transition goals and timeline concerns: 'I want to get into the education space and ideally I'd like to get in there faster than having to do a full four years first' (call_597069664047, seg_23). This revealed both specific career aspirations and desire for an accelerated pathway, requiring careful balance of encouragement and realistic expectations.",
          "consultant_response": "The consultant engaged collaboratively while maintaining appropriate boundaries: 'Let's explore different pathways to reach your goal - there might be multiple routes available' (call_597069664047, seg_23). This response effectively opened exploration of options while keeping focus on program capabilities rather than specific career advice. The approach successfully balanced the student's desire for acceleration with realistic program parameters.",
          "priority": "high",
          "recommended_approach": "When discussing career transitions, start by acknowledging aspirations while maintaining clear role boundaries: 'I understand your goal of transitioning into education efficiently. Let's explore how our program can support that transition.' Focus on program features that align with their goals: 'Our program offers several pathways that could help accelerate your transition, including recognition of prior learning and flexible study loads.' Share high-level examples while avoiding specific career guidance: 'Many of our students successfully transition into education roles through various pathways - some focus on intensive full-time study, while others balance part-time study with current work.' For example, explain: 'One recent student completed their transition by taking three units per semester while working part-time, utilizing our online resources during evening hours.' The key is demonstrating program value while maintaining appropriate advisory boundaries and setting realistic expectations about career support services."
        },
        {
          "id": 4,
          "title": "Return to Study Support",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596846267949",
              "segment_id": "29",
              "timestamp": "1:37"
            },
            "supporting_calls": []
          },
          "student_trigger": "During call 596846267949 (segment 29), the student revealed a previous study interruption: 'I had a surgery so it just wasn't the right time to be studying so it wasn't anything that you guys could have done really.' This disclosure indicated both past challenges and potential concerns about future study success, requiring careful attention to rebuilding confidence.",
          "consultant_response": "The consultant's response was notably insufficient: 'Well, look, you mentioned that you were browsing. If we can assist at all, do just let us know' (segment 35). This generic response missed the opportunity to address specific concerns about managing unexpected events during study or demonstrating improved support mechanisms.",
          "priority": "high",
          "recommended_approach": "When students disclose past study interruptions, begin by validating their experience while highlighting enhanced support options. Start with empathetic acknowledgment: 'Life events like surgery can certainly impact study plans - thank you for sharing that experience. Let me show you how our support systems help students manage unexpected situations.' Then outline specific support mechanisms: 'We have flexible study loads that can be adjusted if health issues arise, and our success coaches work with you to create modified study plans during challenging periods.' Provide concrete examples: 'If something unexpected occurs, you can access extension options, temporary study load reductions, or even short-term leaves while maintaining your enrollment.' Always emphasize that support is readily available and normalized: 'Our student success team regularly helps students navigate these situations - it's an important part of our support system.' The goal is transforming past challenges into confidence about future study success through clear, practical support planning."
        },
        {
          "id": 5,
          "title": "Documentation Process Planning",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596908292707",
              "segment_id": "86",
              "timestamp": "09:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "During the call, the student sought guidance on alternative documentation options: 'So if I don't have any of that, how do I get around it?' (call_596908292707, seg_86). This question indicated both motivation to enroll and uncertainty about meeting requirements through alternative pathways.",
          "consultant_response": "The consultant's response was limited to mentioning the STAT test without fully exploring available options or providing comprehensive guidance about documentation requirements and support mechanisms.",
          "priority": "high",
          "recommended_approach": "When guiding students through documentation processes, begin with a clear overview while maintaining supportive engagement. Start with process clarity: 'Let me walk you through exactly how the documentation process works, step by step.' Then outline specific requirements: 'You'll need X, Y, and Z documents. I'll send you a checklist, and we can review each item together.' For example, explain: 'For your transcript, we need an official copy that shows completed subjects and grades. I can show you exactly how to request this from your previous institution.' Show available support: 'I'll guide you through each step of the submission process, and we have resources to help if you encounter any challenges.' Address common concerns proactively: 'Many students worry about official transcripts - let me explain our verification process and alternative options if you face delays.' Make the process manageable: 'We can break this into smaller steps, and I'll check in at each stage to ensure everything's on track.' The goal is transforming documentation requirements from potential barriers into clear, supported processes while maintaining appropriate guidance boundaries."
        },
        {
          "id": 6,
          "title": "Initial Engagement Structure",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596907924895",
              "segment_id": "2",
              "timestamp": "00:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "Early in the conversation, the student sought to confirm identity: 'Am I speaking with Tani?' (call_596907924895, seg_2). This moment represented a crucial opportunity to establish clear purpose and set appropriate expectations for the interaction. The student's question indicated a need for both identity confirmation and conversation context.",
          "consultant_response": "The consultant provided only basic introduction: 'This is Bridget from Swinburne Online University. How are you?' (call_596907924895, seg_6). This response, while professionally polite, missed the opportunity to establish clear context and expectations for the conversation. The lack of specific purpose or program reference may have left the student unclear about the call's direction and scope.",
          "priority": "high",
          "recommended_approach": "Initial engagement should establish clear identity, purpose, and expectations while opening the door for collaborative planning. Begin with a structured introduction: 'Hello, this is [Name] from Swinburne Online University calling about your interest in [specific program]. I understand you're exploring study options in [field].' Then set clear expectations: 'I'm here to discuss how our program could support your goals and guide you through any questions about enrollment.' For example: 'Many prospective students at this stage want to understand how our flexible study options work with their commitments. Would you like to start with that?' Follow with purposeful engagement: 'Could you share what attracted you to this program?' This opens the door for meaningful discussion while establishing appropriate boundaries. Pay particular attention to signs of uncertainty: 'I notice you might have some questions about the program. Let's start with what's most important to you.' The goal is creating a foundation for productive discussion while setting clear expectations about the conversation's purpose and scope."
        }
      ]
    }
  }
}