{
  "metadata": {
    "consultant_name": "Bridgett Young",
    "week_number": 17,
    "date_range": "02-17_02-21",
    "report_type": "Collaborative Planning"
  },
  "total_number_of_calls": 282,
  "team_average_total_number_of_calls_per_sales_consultant": 239.125,
  "number_of_calls_over_2_minutes": {
    "absolute_number": 77,
    "team_average_absolute_number": 68.875
  },
  "percent_of_calls_over_2_minutes": {
    "percentage": 27.30496453900709,
    "team_average_percentage": 29.051225325524136
  },
  "number_of_calls_under_2_minutes": {
    "absolute_number": 205,
    "team_average_absolute_number": 170.25
  },
  "percent_of_calls_under_2_minutes": {
    "percentage": 72.69503546099291,
    "team_average_percentage": 70.94877467447586
  },
  "average_talking_percentage": {
    "individual_average": 51.37046810160984,
    "team_average": 53.02123725908919
  },
  "excluded_transcripts": {
    "individual_excluded_transcripts": 205,
    "team_total_excluded_transcripts": 2724
  },
  "behavioral_scores": [
    {
      "label": "week-17_02-17_02-21",
      "average_final_ranking_score_eligible_transcripts": 151.86,
      "average_final_ranking_score_all_transcripts_over_2_mins": 106.32,
      "team_average_final_ranking_score_eligible_transcripts": 148.21,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 109.77
    }
  ],
  "themes": {
    "positive": [
      {
        "headline": "Strategic Pathway Planning",
        "explanation": "Consultants effectively create personalized educational pathways that balance immediate constraints with long-term aspirations while maintaining enrollment momentum through specific examples and clear progression steps"
      },
      {
        "headline": "Flexible Study Integration",
        "explanation": "Strong demonstration of how program flexibility accommodates diverse student circumstances and commitments through tailored study options and practical implementation strategies"
      },
      {
        "headline": "Emotional Support Management",
        "explanation": "Excellent validation of student emotions while providing clear next steps and maintaining momentum through relatable examples and structured guidance"
      }
    ],
    "improvement": [
      {
        "headline": "Career Development Integration",
        "explanation": "Enhanced exploration needed of how program elements align with specific workplace challenges and career goals through detailed pathway discussions"
      },
      {
        "headline": "Documentation Process Planning",
        "explanation": "Clearer guidance required for complex documentation scenarios with specific alternative pathways and proactive support mechanisms"
      },
      {
        "headline": "Family-Study Integration",
        "explanation": "More comprehensive exploration needed of specific strategies and support systems for balancing family commitments with study requirements"
      }
    ]
  },
  "conversation_analysis": {
    "condensed": {
      "conversations": [
        {
          "id": 1,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "Student expressed: 'I work rotating shifts at the hospital, not sure how I'll manage study' (call_595732493616, seg_23), followed by similar concerns from other healthcare workers: 'My roster changes every week' (call_595732548084, seg_163), revealing critical scheduling flexibility needs.",
          "consultant_response": "Consultant provided practical solution: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24), effectively demonstrating healthcare-specific flexibility.",
          "context_impact": "This moment required clear demonstration of how program design specifically accommodates healthcare shift workers while maintaining enrollment momentum.",
          "recommended_approach": "Include more specific examples of successful study patterns from current healthcare students with varied shift patterns."
        },
        {
          "id": 2,
          "title": "Emotional Support Planning",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596697995299",
              "segment_id": "12",
              "timestamp": "00:20"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed: 'I'm so excited. Nervous but excited.' (call_596697995299, seg_12), revealing mixed emotions requiring balanced support approach.",
          "consultant_response": "Consultant validated feelings: 'That's only fair...it would almost be odd if you weren't nervous you know what I mean?' (call_596697995299, seg_14), effectively normalizing concerns while maintaining positive momentum.",
          "context_impact": "Critical moment requiring balance of emotional validation with practical planning to maintain enthusiasm while addressing concerns.",
          "recommended_approach": "Include specific examples of how other students successfully managed similar transitions with emphasis on initial support utilization."
        },
        {
          "id": 3,
          "title": "Alternative Pathway Planning",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596616690213",
              "segment_id": "55",
              "timestamp": "02:50"
            },
            "supporting_calls": []
          },
          "student_trigger": "During ATAR review: 'Let's have a look and see the score, looks like you received an ATAR of 18.' (call_596616690213, seg_55), requiring sensitive redirection.",
          "consultant_response": "Consultant offered proactive support: 'I can send you through some other options on what I would recommend' (call_596616690213, seg_59), maintaining future focus and positive momentum.",
          "context_impact": "Crucial moment requiring clear guidance on alternative pathways while maintaining student engagement and confidence.",
          "recommended_approach": "Provide immediate examples of successful alternative pathway transitions with specific timelines and outcomes."
        },
        {
          "id": 4,
          "title": "Family Study Balance",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596413058074",
              "segment_id": "16",
              "timestamp": "01:15"
            },
            "supporting_calls": [
              {
                "call_id": "596616854150",
                "segment_id": "13",
                "timestamp": "03:00"
              }
            ]
          },
          "student_trigger": "Student shared: 'I've been speaking with my partner and kids to see if we can make the time for me to study, because I've got little kids' (call_596413058074, seg_16), revealing anxiety about managing multiple commitments.",
          "consultant_response": "Consultant focused on rigid requirements: 'Well, look, we do, for this program, you would be looking at around 20 hours a week worth of study standards' (call_596413058074, seg_19), missing opportunity for flexible solutions.",
          "context_impact": "Critical opportunity to demonstrate how program flexibility accommodates family responsibilities while maintaining enrollment momentum.",
          "recommended_approach": "Provide comprehensive examples of how current parent students successfully manage their study commitments with specific scheduling strategies."
        },
        {
          "id": 5,
          "title": "Career Transition Support",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596343381165",
              "segment_id": "23",
              "timestamp": "01:15"
            },
            "supporting_calls": [
              {
                "call_id": "596689521164",
                "segment_id": "53",
                "timestamp": "8:01"
              }
            ]
          },
          "student_trigger": "Student stated: 'I'm currently working in a different field, not in the teaching side. I am a little bit interested, like learning this Master of Teaching and then move my career' (call_596343381165, seg_23)",
          "consultant_response": "Consultant provided basic program information without exploring career transition support mechanisms or sharing relevant success stories.",
          "context_impact": "Critical moment to demonstrate program's ability to support career transition goals while maintaining appropriate boundaries.",
          "recommended_approach": "Enhance response with specific examples of successful career transitions and available support resources while maintaining appropriate sales role boundaries."
        },
        {
          "id": 6,
          "title": "Documentation Process Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596413058074",
              "segment_id": "35",
              "timestamp": "02:30"
            },
            "supporting_calls": [
              {
                "call_id": "596462149004",
                "segment_id": "17",
                "timestamp": "02:15"
              }
            ]
          },
          "student_trigger": "Student expressed readiness: 'I'll be able to help you get enrolled for April' (call_596413058074, seg_47), requiring clear guidance through final steps.",
          "consultant_response": "Consultant provided limited guidance: 'So for us to be able to apply for a place for you in the court, we would just need to send through some documents reflecting that.' (call_596413058074, seg_35)",
          "context_impact": "Critical transition from interest to action requiring clear direction while maintaining momentum.",
          "recommended_approach": "Provide comprehensive documentation checklist with clear timelines and proactive support options for potential challenges."
        }
      ]
    },
    "verbose": {
      "conversations": [
        {
          "id": 1,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "In call 595732493616 (segment 23), the student expressed significant concern about balancing study with shift work: 'I work rotating shifts at the hospital, not sure how I'll manage study.' This revealed both interest in the program and anxiety about practical implementation. Similar concerns emerged in call 595732548084 (segment 163) where another healthcare worker noted: 'My roster changes every week, and I often work nights.' These moments represented critical opportunities to demonstrate how our program specifically accommodates healthcare professionals' unique scheduling challenges.",
          "consultant_response": "The primary consultant demonstrated strong understanding of healthcare workflows, responding: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24). This practical example resonated strongly, with the student responding: 'That actually sounds manageable' (seg_25). In the supporting call, the consultant built on the flexible access theme: 'The beauty of our platform is you can switch between online and offline study. Some students download their materials before night shifts' (call_595732548084, seg_164). Both consultants effectively moved the conversation from 'if' to 'how', directly addressing practical concerns while maintaining momentum.",
          "priority": "high",
          "recommended_approach": "When addressing shift workers' scheduling concerns, always start by acknowledging their specific work pattern before showing how our program design aligns with healthcare workflows. Share concrete examples of how current students manage study around shifts - whether it's downloading materials for night shifts, studying during quiet periods, or breaking study into small blocks between shifts. The key is making flexibility tangible rather than theoretical. For instance, explain how asynchronous learning means no mandatory live sessions, and offline access means study can happen even in areas with poor connectivity. For those with rotating rosters, emphasize how weekly study patterns can adapt to changing schedules. Pay particular attention to students working night shifts or long rotations, showing how our platform's flexibility specifically addresses these challenges. The goal is to transform perceived scheduling barriers into manageable planning opportunities, always grounding explanations in healthcare-specific scenarios that resonate with their experience."
        },
        {
          "id": 2,
          "title": "Emotional Support Planning",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596697995299",
              "segment_id": "12",
              "timestamp": "00:20"
            },
            "supporting_calls": []
          },
          "student_trigger": "Early in the conversation, the student revealed their emotional state by saying 'I'm so excited. Nervous but excited.' (call_596697995299, seg_12). This admission of mixed emotions presented a crucial opportunity to address both the enthusiasm and apprehension about returning to study. The timing of this disclosure, coming at the start of the conversation, made it particularly significant for setting the tone of the entire interaction and building rapport.",
          "consultant_response": "The consultant demonstrated strong emotional intelligence by responding: 'I think yes I think that's only fair you know if you've not studied in a while especially. Mm-hmm no no that's completely normal it's almost it would almost be odd if you weren't like nervous you know what I mean?' (call_596697995299, seg_14). This response effectively validated the student's feelings while normalizing their concerns, creating a supportive environment for further discussion. The consultant's approach maintained positive momentum while acknowledging the reality of returning to study.",
          "priority": "high",
          "recommended_approach": "When students express mixed emotions about starting their educational journey, begin by validating both their excitement and concerns. Demonstrate understanding through phrases like 'It's great that you're feeling excited despite being nervous—that's a natural part of the process.' Then, use this emotional openness to explore specific aspects causing nervousness and excitement, which creates opportunities to discuss relevant support services and study strategies. For example, if a student mentions being nervous about academic writing, highlight how our learning advisers can provide guidance: 'Many students share that concern, which is why we have dedicated writing support available throughout your studies.' Share stories of similar students who successfully managed their transition: 'One of our recent students felt the same way, but found that breaking down the first assignment with their learning adviser really built their confidence.' The key is maintaining this balance between emotional support and practical guidance throughout the conversation, always connecting support services to the specific concerns raised."
        },
        {
          "id": 3,
          "title": "Alternative Pathway Planning",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596616690213",
              "segment_id": "55",
              "timestamp": "02:50"
            },
            "supporting_calls": []
          },
          "student_trigger": "The critical moment occurred when reviewing academic standing: 'Let's have a look and see the score, looks like you received an ATAR of 18.' (call_596616690213, seg_55). This revelation created a sensitive situation requiring careful handling to maintain the student's engagement while redirecting their educational pathway.",
          "consultant_response": "The consultant demonstrated effective alternative pathway guidance: 'So, what I can do is send you through some other options on what I would recommend you have a look at doing so that you can apply in future with us.' (call_596616690213, seg_59). This response maintained positive momentum by immediately offering alternative routes forward, keeping the focus on future possibilities rather than current limitations.",
          "priority": "high",
          "recommended_approach": "When discussing alternative pathways due to academic standings, start by acknowledging the student's educational goals while pivoting to explore viable alternatives. Begin with an empathetic but solution-focused approach: 'While your current ATAR doesn't meet the direct entry requirements, there are several pathways we can explore to help you reach your goals.' Guide the conversation through available options, using success stories to illustrate each path: 'Many of our current students started with a diploma program, which not only provided entry but gave them valuable preparation for university study.' Ask questions about their career aspirations and use these to frame different pathway options: 'Understanding your interest in [field], let's look at how each pathway could support your career goals.' Remember to emphasize that alternative pathways often provide additional benefits like enhanced study skills and greater confidence."
        },
        {
          "id": 4,
          "title": "Family Study Balance",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596413058074",
              "segment_id": "16",
              "timestamp": "01:15"
            },
            "supporting_calls": [
              {
                "call_id": "596616854150",
                "segment_id": "13",
                "timestamp": "03:00"
              }
            ]
          },
          "student_trigger": "Multiple students expressed concerns about balancing family commitments, exemplified by the statement 'I've been speaking with my partner and kids to see if we can make the time for me to study, because I've got little kids' (call_596413058074, seg_16). These disclosures represented critical opportunities to demonstrate how program flexibility accommodates family responsibilities.",
          "consultant_response": "Consultants often focused on rigid program requirements rather than exploring flexible solutions, as shown in the response: 'Well, look, we do, for this program, you would be looking at around 20 hours a week worth of study standards' (call_596413058074, seg_19). This approach missed opportunities to demonstrate how the program could adapt to family circumstances.",
          "priority": "high",
          "recommended_approach": "When students express concerns about balancing family commitments with study, begin by validating their proactive approach to family planning. Start with acknowledgment: 'It's excellent that you're having these important conversations with your family - this kind of planning is crucial for success.' Explore their specific situation: 'Could you tell me about your typical family routine? Understanding your schedule will help us identify potential study windows that work for you.' Share practical strategies: 'Many of our students with young families find success by breaking their study into smaller sessions that fit around family commitments. For instance, one parent studies early mornings before the children wake, while another uses their children's activity times for focused study.' Pay particular attention to specific family circumstances, using these details to demonstrate program flexibility: 'Our online platform allows you to download materials for offline study, so you can make the most of available time pockets throughout your day.' The goal is to transform perceived barriers into manageable aspects of their educational journey through practical, family-friendly solutions."
        },
        {
          "id": 5,
          "title": "Career Transition Support",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596343381165",
              "segment_id": "23",
              "timestamp": "01:15"
            },
            "supporting_calls": [
              {
                "call_id": "596689521164",
                "segment_id": "53",
                "timestamp": "8:01"
              }
            ]
          },
          "student_trigger": "Multiple students expressed career transition aspirations, exemplified by the statement 'I'm currently working in a different field, not in the teaching side. I am a little bit interested, like learning this Master of Teaching and then move my career' (call_596343381165, seg_23). These moments presented crucial opportunities to demonstrate how the program supports career change journeys.",
          "consultant_response": "Consultants typically provided basic program information without exploring the deeper aspects of career transition support. This pattern of responses missed opportunities to demonstrate how program elements specifically support career changers and build confidence in the transition journey.",
          "priority": "high",
          "recommended_approach": "When addressing career transition inquiries, begin by validating the student's career change aspirations while maintaining appropriate boundaries between sales and career counseling roles. Start with acknowledgment: 'Making a career transition is an exciting step, and many of our students have successfully made similar changes.' Explore their current situation: 'Could you tell me more about your current role and what aspects of teaching particularly interest you?' Use their response to highlight relevant program features: 'Our program includes specific support for career changers, such as introductory teaching units that help you build foundational skills.' Share success stories while maintaining appropriate scope: 'Many of our students come from diverse professional backgrounds - for instance, we recently had a business professional successfully transition into teaching through our program.' Pay particular attention to signs of uncertainty about the career change, using these as opportunities to demonstrate program support mechanisms: 'Throughout your transition, you'll have access to academic advisors and networking opportunities with other career changers.' The goal is to show how the program provides structured support for career transitions while maintaining focus on enrollment decisions."
        },
        {
          "id": 6,
          "title": "Documentation Process Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596413058074",
              "segment_id": "35",
              "timestamp": "02:30"
            },
            "supporting_calls": [
              {
                "call_id": "596462149004",
                "segment_id": "17",
                "timestamp": "02:15"
              }
            ]
          },
          "student_trigger": "Multiple students expressed readiness to proceed with enrollment, exemplified by the statement 'I'll be able to help you get enrolled for April' (call_596413058074, seg_47). These moments represented critical transitions from interest to action, requiring clear guidance through documentation requirements while maintaining enrollment momentum.",
          "consultant_response": "Consultants often provided limited guidance on documentation requirements, as shown in the response: 'So for us to be able to apply for a place for you in the court, we would just need to send through some documents reflecting that.' (call_596413058074, seg_35). This approach missed opportunities to provide comprehensive support through the documentation process.",
          "priority": "high",
          "recommended_approach": "When guiding students through documentation requirements, begin by acknowledging their readiness to proceed while ensuring they understand the process ahead. Start with validation: 'It's great that you're ready to move forward! Let me outline exactly what we need to make this happen smoothly.' Break down requirements into clear steps: 'First, we'll need your academic transcripts, which demonstrate your eligibility. Then, we'll gather your identification documents.' Share practical tips: 'Many students find it helpful to create a digital folder for their documents, making it easier to track and submit everything needed.' Pay particular attention to potential documentation challenges, providing specific solutions: 'If you're having trouble locating your transcript, we can help you understand alternative ways to verify your academic history.' The goal is to transform what could be an overwhelming administrative process into a series of achievable steps, always maintaining enthusiasm while ensuring clear progress toward enrollment completion."
        }
      ]
    }
  }
}