{
  "metadata": {
    "consultant_name": "David Mccarthie",
    "week_number": 17,
    "date_range": "02-17_02-21",
    "report_type": "Collaborative Planning"
  },
  "total_number_of_calls": 230,
  "team_average_total_number_of_calls_per_sales_consultant": 239.125,
  "number_of_calls_over_2_minutes": {
    "absolute_number": 58,
    "team_average_absolute_number": 68.875
  },
  "percent_of_calls_over_2_minutes": {
    "percentage": 25.217391304347824,
    "team_average_percentage": 29.051225325524136
  },
  "number_of_calls_under_2_minutes": {
    "absolute_number": 172,
    "team_average_absolute_number": 170.25
  },
  "percent_of_calls_under_2_minutes": {
    "percentage": 74.78260869565217,
    "team_average_percentage": 70.94877467447586
  },
  "average_talking_percentage": {
    "individual_average": 55.948048533179794,
    "team_average": 53.02123725908919
  },
  "excluded_transcripts": {
    "individual_excluded_transcripts": 172,
    "team_total_excluded_transcripts": 2724
  },
  "behavioral_scores": [
    {
      "label": "week-17_02-17_02-21",
      "average_final_ranking_score_eligible_transcripts": 182.3,
      "average_final_ranking_score_all_transcripts_over_2_mins": 135.52,
      "team_average_final_ranking_score_eligible_transcripts": 148.21,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 109.77
    }
  ],
  "themes": {
    "positive": [
      {
        "headline": "Strategic Pathway Planning",
        "explanation": "Consultants effectively create personalized educational pathways that balance immediate constraints with long-term aspirations while maintaining enrollment momentum through concrete examples and clear timelines"
      },
      {
        "headline": "Flexible Study Integration",
        "explanation": "Strong demonstration of how program flexibility accommodates diverse student circumstances through detailed explanation of features, support mechanisms, and specific success examples"
      },
      {
        "headline": "Financial Planning Support",
        "explanation": "Effective guidance through funding options and government support mechanisms with clear explanations of processes and requirements that maintain momentum"
      }
    ],
    "improvement": [
      {
        "headline": "Career Development Integration",
        "explanation": "Enhanced exploration needed of how program elements align with specific workplace challenges and career goals while maintaining appropriate pre-enrollment boundaries"
      },
      {
        "headline": "Work-Life Balance Planning",
        "explanation": "More comprehensive collaborative planning needed around integrating study requirements with professional commitments through detailed examples and personalized strategies"
      },
      {
        "headline": "Documentation Process Planning",
        "explanation": "Clearer guidance required for complex documentation scenarios including specific alternative pathways, timelines, and step-by-step support mechanisms"
      }
    ]
  },
  "conversation_analysis": {
    "condensed": {
      "conversations": [
        {
          "id": 1,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "Student stated: 'I work rotating shifts at the hospital, not sure how I'll manage study' (call_595732493616, seg_23), revealing critical need to demonstrate practical study flexibility.",
          "consultant_response": "Consultant provided practical solution: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24), effectively showing real-world flexibility.",
          "context_impact": "This moment required clear demonstration of how our program design specifically accommodates healthcare shift workers to maintain enrollment momentum.",
          "recommended_approach": "Include more specific examples of successful study patterns from current healthcare students with varying shift patterns."
        },
        {
          "id": 2,
          "title": "Strategic Pathway Visualization",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596549059561",
              "segment_id": "14",
              "timestamp": "1:35"
            },
            "supporting_calls": [
              {
                "call_id": "596697563003",
                "segment_id": "130",
                "timestamp": "5:24"
              }
            ]
          },
          "student_trigger": "Student stated: 'That's great news about the approval' (call_596549059561, seg_12), seeking clear understanding of their academic journey ahead.",
          "consultant_response": "Consultant provided clear visualization: 'We've been able to match all your units...you've got eight units left so just one year left of your studies' (call_596549059561, seg_14), effectively mapping the journey.",
          "context_impact": "Critical moment to translate abstract requirements into tangible goals while maintaining student motivation and commitment.",
          "recommended_approach": "Integrate discussion of specific milestones, support resources, and success markers throughout the remaining study period."
        },
        {
          "id": 3,
          "title": "Financial Planning Support",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596616600008",
              "segment_id": "173",
              "timestamp": "30:50"
            },
            "supporting_calls": [
              {
                "call_id": "596616600008",
                "segment_id": "177",
                "timestamp": "31:15"
              }
            ]
          },
          "student_trigger": "Student stated: 'Potentially they could but I don't think I will apply, no.' (call_596616600008, seg_173), revealing hesitation about exploring financial resources.",
          "consultant_response": "Consultant provided solution: 'So as an Australian citizen Amber, you're eligible for HECS, which is the loan that you can take out with the Australian government which means you don't pay anything up front.' (call_596616600008, seg_177)",
          "context_impact": "This moment required clear guidance on financial options to maintain enrollment momentum while alleviating funding concerns.",
          "recommended_approach": "Include specific details about HECS-HELP thresholds, repayment terms, and application process to boost confidence further."
        },
        {
          "id": 4,
          "title": "Career Development Integration",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596555388152",
              "segment_id": "194",
              "timestamp": "26:14"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed: 'Start a new career and definitely personal development as well' (call_596555388152, seg_194), indicating clear goals requiring guidance.",
          "consultant_response": "Consultant merely noted: 'Fantastic. I'll pop that down there for you' (call_596555388152, seg_195), missing chance to explore goals.",
          "context_impact": "Critical opportunity to align program features with student's career transition and development aspirations.",
          "recommended_approach": "Explore specific career transition pathways while maintaining appropriate pre-enrollment boundaries and highlighting relevant program features."
        },
        {
          "id": 5,
          "title": "Work-Study Balance Strategy",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596689225243",
              "segment_id": "58",
              "timestamp": "05:15"
            },
            "supporting_calls": [
              {
                "call_id": "596689225243",
                "segment_id": "59",
                "timestamp": "05:30"
              }
            ]
          },
          "student_trigger": "Student shared: 'I'm really interested in the MBA, but with my current role in management, I'm not sure I can commit to the study hours.' (call_596689225243, seg_58)",
          "consultant_response": "Consultant simply stated: 'That's absolutely understandable, we hear that from many working professionals.' (call_596689225243, seg_59)",
          "context_impact": "Critical opportunity to demonstrate program flexibility and support for working professionals through specific examples.",
          "recommended_approach": "Explore specific work patterns and co-create detailed study plans aligned with professional commitments, including concrete examples of successful integration."
        },
        {
          "id": 6,
          "title": "Documentation Process Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596413242818",
              "segment_id": "14",
              "timestamp": "3:50"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student inquired: 'And do you guys accept credit transfers?' (call_596413242818, seg_14), seeking clarity on requirements.",
          "consultant_response": "Consultant gave generic response: 'We do. It just depends on how many units you've studied' (seg_15), missing exploration opportunity.",
          "context_impact": "Key moment to demonstrate process understanding and support availability while maintaining enrollment momentum.",
          "recommended_approach": "Provide detailed credit transfer pathways and documentation guidance with specific timelines, requirements, and alternative options."
        }
      ]
    },
    "verbose": {
      "conversations": [
        {
          "id": 1,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "In call 595732493616 (segment 23), the student expressed significant concern about balancing study with shift work: 'I work rotating shifts at the hospital, not sure how I'll manage study.' This revealed both interest in the program and anxiety about practical implementation. Similar concerns emerged in call 595732548084 (segment 163) where another healthcare worker noted: 'My roster changes every week, and I often work nights.' These moments represented critical opportunities to demonstrate how our program specifically accommodates healthcare professionals' unique scheduling challenges.",
          "consultant_response": "The primary consultant demonstrated strong understanding of healthcare workflows, responding with: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24). This practical example resonated strongly, with the student responding: 'That actually sounds manageable' (seg_25). In the supporting call, the consultant built on the flexible access theme: 'The beauty of our platform is you can switch between online and offline study. Some students download their materials before night shifts' (call_595732548084, seg_164). Both consultants effectively moved the conversation from 'if' to 'how', directly addressing the practical concerns while maintaining momentum.",
          "priority": "high",
          "recommended_approach": "When addressing shift workers' scheduling concerns, start by acknowledging their specific work pattern before showing how our program design aligns with healthcare workflows. Share concrete examples of how current students manage study around shifts - whether it's downloading materials for night shifts, studying during quiet periods, or breaking study into small blocks between shifts. The key is making flexibility tangible rather than theoretical. For instance, explain how asynchronous learning means no mandatory live sessions, and offline access means study can happen even in areas with poor connectivity. For those with rotating rosters, emphasize how weekly study patterns can adapt to changing schedules. Pay particular attention to students working night shifts or long rotations, showing how our platform's flexibility specifically addresses these challenges. The goal is to transform perceived scheduling barriers into manageable planning opportunities, always grounding explanations in healthcare-specific scenarios that resonate with their experience."
        },
        {
          "id": 2,
          "title": "Strategic Pathway Visualization",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596549059561",
              "segment_id": "14",
              "timestamp": "1:35"
            },
            "supporting_calls": [
              {
                "call_id": "596697563003",
                "segment_id": "130",
                "timestamp": "5:24"
              }
            ]
          },
          "student_trigger": "Following the positive news of study approval, where the consultant announced: 'So great news, you have been approved to study' (call_596549059561, seg_12), students consistently showed a need for clear visualization of their academic journey. This pattern emerged across multiple interactions, with students seeking to understand how their previous studies would integrate with their remaining requirements and timeline to completion.",
          "consultant_response": "Consultants effectively built on these moments by providing clear visualization of the pathway ahead: 'We've been able to match all your units as well. So, you've essentially just got, let me count those up, two, four, six, you've got eight units left so just one year left of your studies and then you'll be all done' (call_596549059561, seg_14). This approach successfully translated abstract academic requirements into concrete timelines, helping students envision their path to completion.",
          "priority": "high",
          "recommended_approach": "When communicating program pathways and academic progress, start by celebrating key milestones to build positive momentum. Begin with clear affirmation: 'This is an exciting step in your academic journey!' Then, quickly transition into concrete planning while maintaining enthusiasm: 'Let's map out exactly what this means for your progress.' Use specific numbers and timeframes to make the path tangible: 'With eight units remaining, you're looking at about a year to completion.' Always connect these timelines to student goals: 'How does this timeline align with your career plans?' Break down requirements into manageable segments, helping students visualize their progression through specific milestones. Remember to check understanding throughout and adjust explanations based on student responses, ensuring they feel confident about their pathway to completion."
        },
        {
          "id": 3,
          "title": "Financial Planning Support",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596616600008",
              "segment_id": "173",
              "timestamp": "30:50"
            },
            "supporting_calls": [
              {
                "call_id": "596616600008",
                "segment_id": "177",
                "timestamp": "31:15"
              }
            ]
          },
          "student_trigger": "During the conversation, the student expressed uncertainty about financial options, stating 'Potentially they could but I don't think I will apply, no.' (call_596616600008, seg_173). This hesitation about exploring financial resources represented a critical moment where clear guidance on funding pathways could significantly impact enrollment confidence.",
          "consultant_response": "The consultant demonstrated strong financial guidance by explaining, 'So as an Australian citizen Amber, you're eligible for HECS, which is the loan that you can take out with the Australian government which means you don't pay anything up front.' (call_596616600008, seg_177). This response effectively addressed immediate financial concerns by introducing HECS-HELP as a viable solution, emphasizing the zero upfront payment feature which often alleviates immediate financial stress.",
          "priority": "high",
          "recommended_approach": "When addressing financial concerns, begin by normalizing the discussion of funding options while maintaining a solution-focused approach. Start with a clear explanation of HECS-HELP eligibility: 'As an Australian citizen, you have access to government support that makes study financially manageable.' Follow this with specific details about how the system works, using clear examples like: 'Many of our students use HECS-HELP, which means no upfront payments and repayments only start once you're earning above the threshold.' When students express uncertainty about applying for support, provide reassurance through concrete next steps: 'I can guide you through the HECS-HELP application process, which is straightforward and integrated with your enrollment.' Remember to address common concerns proactively, such as repayment thresholds and application deadlines. The goal is to transform financial uncertainty into a clear, manageable pathway while maintaining momentum toward enrollment."
        },
        {
          "id": 4,
          "title": "Career Development Integration",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596555388152",
              "segment_id": "194",
              "timestamp": "26:14"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student clearly articulated career goals: 'Start a new career and definitely personal development as well' (call_596555388152, seg_194). This direct expression of career transition and personal development goals presented a prime opportunity to demonstrate program alignment with professional aspirations.",
          "consultant_response": "The consultant provided minimal engagement: 'Fantastic. I'll pop that down there for you' (call_596555388152, seg_195). This surface-level acknowledgment failed to explore how the program could support the student's career transition goals or personal development aspirations.",
          "priority": "high",
          "recommended_approach": "When students express career transition goals, engage in high-level exploration while maintaining appropriate pre-enrollment boundaries. Begin with acknowledgment: 'Your focus on career transition and personal development aligns perfectly with our program's design. While I can't provide specific career guidance, I can show you how our program supports professional growth.' Then highlight relevant program features: 'Our units include practical scenarios from various industries, helping you build transferable skills. Many students use these projects to explore new career directions while developing their professional toolkit.' Share appropriate examples: 'For instance, our business strategy unit helps students analyze different industries, which many find valuable when planning career transitions.' Maintain focus on program benefits while avoiding detailed career planning: 'While specific career guidance comes from our career services team post-enrollment, I can show you how our program structure supports career development through practical learning experiences.'"
        },
        {
          "id": 5,
          "title": "Work-Study Balance Strategy",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596689225243",
              "segment_id": "58",
              "timestamp": "05:15"
            },
            "supporting_calls": [
              {
                "call_id": "596689225243",
                "segment_id": "59",
                "timestamp": "05:30"
              }
            ]
          },
          "student_trigger": "The student expressed significant concern about managing professional commitments alongside study: 'I'm really interested in the MBA, but with my current role in management, I'm not sure I can commit to the study hours.' (call_596689225243, seg_58). This comment revealed anxiety about work-study balance, a critical concern that required detailed exploration and planning to support the enrollment decision.",
          "consultant_response": "The consultant's response was limited to acknowledgment without strategic planning: 'That's absolutely understandable, we hear that from many working professionals.' (call_596689225243, seg_59). This missed the opportunity to explore specific work patterns and co-create practical study solutions.",
          "priority": "high",
          "recommended_approach": "When students express concerns about balancing professional commitments with study, engage in detailed exploration of their specific circumstances. Begin with empathetic acknowledgment: 'I understand managing an MBA alongside management responsibilities requires careful planning. Could you tell me more about your typical work week?' Use this information to co-create a personalized study approach: 'Many of our successful MBA students in management roles find that breaking study into smaller blocks works well between meetings. For example, some review materials during their morning commute or dedicate specific evening time slots.' Share relevant examples: 'We recently had a student in a similar role who completed two subjects while managing a team of fifteen by utilizing our flexible assessment deadlines and offline study options.' When discussing study load, present options that align with their schedule: 'Given your current workload, starting with one unit allows you to establish effective study routines while maintaining professional excellence.' The key is demonstrating how the program's flexibility specifically addresses their unique work patterns while maintaining academic quality."
        },
        {
          "id": 6,
          "title": "Documentation Process Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596413242818",
              "segment_id": "14",
              "timestamp": "3:50"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student initiated a critical inquiry about credit transfers: 'And do you guys accept credit transfers?' (call_596413242818, seg_14). This question represented a key moment in their decision-making process, indicating both previous study experience and a desire to efficiently progress in their educational journey.",
          "consultant_response": "The consultant provided only a basic response: 'We do. It just depends on how many units you've studied' (seg_15). This generic answer failed to engage the student in a meaningful discussion about their specific situation or explore potential pathways available through credit transfer.",
          "priority": "high",
          "recommended_approach": "When students inquire about credit transfers, initiate a comprehensive exploration of their academic history and goals while maintaining clear process guidance. Begin with genuine interest: 'I appreciate you asking about credit transfers - they can significantly optimize your study pathway. Could you tell me more about your previous studies?' Guide the conversation to understand specific completed units and their potential alignment with current programs: 'Different types of prior study can provide different credit opportunities. For example, a diploma typically provides about a year of credit.' When discussing transfer limits, frame them positively while maintaining transparency: 'While final credit assessments happen post-enrollment, we can explore likely scenarios based on your previous study.' Always connect credit discussions to broader educational goals: 'Understanding your credit potential helps us create the most efficient pathway to your qualification.' Provide clear next steps: 'I can guide you through gathering the required documentation, starting with your academic transcripts.' The goal is transforming credit transfer discussions from administrative queries into strategic planning conversations that demonstrate our commitment to optimizing their educational journey."
        }
      ]
    }
  }
}