{
  "metadata": {
    "consultant_name": "Elisha Odhiambo",
    "week_number": 10,
    "date_range": "12-30_01-03",
    "report_type": "Collaborative Planning"
  },
  "total_number_of_calls": 156,
  "team_average_total_number_of_calls_per_sales_consultant": 78.72727272727273,
  "number_of_calls_over_2_minutes": {
    "absolute_number": 40,
    "team_average_absolute_number": 20.636363636363637
  },
  "percent_of_calls_over_2_minutes": {
    "percentage": 25.64102564102564,
    "team_average_percentage": 22.487986165053538
  },
  "number_of_calls_under_2_minutes": {
    "absolute_number": 116,
    "team_average_absolute_number": 58.09090909090909
  },
  "percent_of_calls_under_2_minutes": {
    "percentage": 74.35897435897436,
    "team_average_percentage": 50.23928656221919
  },
  "average_talking_percentage": {
    "individual_average": 51.024566138494535,
    "team_average": 51.07068109184601
  },
  "excluded_transcripts": {
    "individual_excluded_transcripts": 116,
    "team_total_excluded_transcripts": 639
  },
  "behavioral_scores": [
    {
      "label": "week-6_12-02_12-06",
      "average_final_ranking_score_eligible_transcripts": 269.55,
      "average_final_ranking_score_all_transcripts_over_2_mins": 182.46,
      "team_average_final_ranking_score_eligible_transcripts": 159.84,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 110.46
    },
    {
      "label": "week-9_12-23_12-27",
      "average_final_ranking_score_eligible_transcripts": 178.3,
      "average_final_ranking_score_all_transcripts_over_2_mins": 116.64,
      "team_average_final_ranking_score_eligible_transcripts": 152.6,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 110.17
    },
    {
      "label": "week-10_12-30_01-03",
      "average_final_ranking_score_eligible_transcripts": 157.5,
      "average_final_ranking_score_all_transcripts_over_2_mins": 120.48,
      "team_average_final_ranking_score_eligible_transcripts": 149.83,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 96.3
    }
  ],
  "themes": {
    "positive": [
      {
        "headline": "Proactive Educational Planning",
        "explanation": "Effectively engaging students in exploring and mapping educational journeys while validating prior learning"
      },
      {
        "headline": "Flexible Study Solutions",
        "explanation": "Successfully developing personalized study arrangements that accommodate work and life commitments"
      },
      {
        "headline": "Clear Program Communication",
        "explanation": "Providing comprehensive explanations of course structures and requirements while maintaining student engagement"
      }
    ],
    "improvement": [
      {
        "headline": "Enhanced Career Integration",
        "explanation": "Need deeper exploration of career goals and transition pathways when planning educational journeys"
      },
      {
        "headline": "Comprehensive Support Planning",
        "explanation": "More thorough discussion needed of available support mechanisms including financial and academic resources"
      },
      {
        "headline": "Personal Context Integration",
        "explanation": "Should better incorporate individual circumstances and emotional aspects when developing solutions"
      }
    ]
  },
  "conversation_analysis": {
    "condensed": {
      "conversations": [
        {
          "id": 4,
          "title": "Career Transition Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "3",
              "segment_id": "52",
              "timestamp": "9:58"
            },
            "supporting_calls": [
              {
                "call_id": "1",
                "segment_id": "24",
                "timestamp": "4:24"
              }
            ]
          },
          "student_trigger": "Multiple students expressed interest in career transitions and professional development",
          "consultant_response": "Basic acknowledgment without exploring specific career transition needs or creating detailed plans",
          "context_impact": "Opportunity to align educational planning with career goals",
          "recommended_approach": "Should engage in detailed career goal exploration and create specific educational transition plans"
        },
        {
          "id": 5,
          "title": "Support Resource Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "1",
              "segment_id": "280",
              "timestamp": "46:40"
            },
            "supporting_calls": [
              {
                "call_id": "591330759172_1983",
                "segment_id": "22",
                "timestamp": null
              }
            ]
          },
          "student_trigger": "Students expressing various support needs including academic and financial concerns",
          "consultant_response": "Limited exploration of available support mechanisms and resources",
          "context_impact": "Critical opportunity to build confidence through comprehensive support planning",
          "recommended_approach": "Need to engage in detailed support planning and resource connection"
        },
        {
          "id": 6,
          "title": "Personal Context Integration",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "call_4",
              "segment_id": "15",
              "timestamp": "03:00"
            },
            "supporting_calls": [
              {
                "call_id": "call_2",
                "segment_id": "3",
                "timestamp": "00:15"
              }
            ]
          },
          "student_trigger": "Parents shared concerns about non-traditional educational backgrounds including mental health challenges",
          "consultant_response": "Focus on procedural aspects without addressing emotional context or specific support needs",
          "context_impact": "Required sensitive handling to build confidence in university as viable option",
          "recommended_approach": "Should acknowledge personal circumstances and explore specific support needs before discussing pathways"
        }
      ]
    },
    "verbose": {
      "conversations": [
        {
          "id": 1,
          "title": "Effective Study Flexibility Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "591330759172_1981",
              "segment_id": "88",
              "timestamp": null
            },
            "supporting_calls": [
              {
                "call_id": "591330759172_1982",
                "segment_id": "45",
                "timestamp": null
              }
            ]
          },
          "student_trigger": "Multiple students expressed specific needs for flexible study arrangements, particularly around work schedules and family commitments. These moments represented critical opportunities for collaborative planning to demonstrate program feasibility and build confidence in successful study management.",
          "consultant_response": "Consultants demonstrated excellent collaborative planning by engaging students in detailed discussions about flexible study options. They effectively communicated how the program model could accommodate various commitments: 'Our model is actually designed for people like yourself who have full-time roles and other commitments.' This approach helped students understand practical study management while building confidence in their ability to succeed.",
          "priority": "high",
          "recommended_approach": "Continue this effective approach while enhancing with specific examples of successful study arrangements. Consider: 1) Exploring specific scheduling challenges, 2) Developing detailed study plans incorporating student-specific needs, 3) Sharing examples of successful flexible study arrangements, and 4) Creating contingency plans for managing peak workload periods."
        },
        {
          "id": 2,
          "title": "Proactive Credit Recognition Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "call_1",
              "segment_id": "49",
              "timestamp": "03:30"
            },
            "supporting_calls": [
              {
                "call_id": "call_3",
                "segment_id": "26",
                "timestamp": "04:10"
              }
            ]
          },
          "student_trigger": "Multiple students sought guidance about continuing their education after interruptions, expressing concerns about credit recognition and transfer processes. These moments presented opportunities for collaborative planning around academic progression while validating prior learning achievements.",
          "consultant_response": "Consultants demonstrated strong collaborative planning skills by providing clear validation of prior learning while proactively offering to verify specific details: 'Yes, typically it's around seven years... I'll definitely double check with admissions and faculty.' This approach effectively addressed concerns while maintaining supportive partnerships and demonstrating commitment to student success.",
          "priority": "high",
          "recommended_approach": "Maintain this proactive approach while enhancing with: 1) Specific timeline planning for credit verification, 2) Detailed progression maps showing prior learning integration, 3) Clear next steps for documentation submission, and 4) Regular progress updates during the verification process."
        },
        {
          "id": 3,
          "title": "Clear Financial Aid Planning",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "Call1",
              "segment_id": "64",
              "timestamp": "11:39"
            },
            "supporting_calls": []
          },
          "student_trigger": "At 11:39, the student expressed specific concerns about HECS availability for their graduate certificate program, stating: 'I think, actually, one of my concerns, just in terms of the graduate certificate, I think it just comes down to the HECS.' This represented a crucial moment where financial concerns could significantly impact enrollment decisions.",
          "consultant_response": "The consultant demonstrated effective collaborative planning by providing detailed information about C-HELP as an alternative to HECS: 'So with the C-HELP, it's available to you based on postgraduate courses, but it still works the same way, where the only thing that you'll need to provide is your tax file number.' This clear communication addressed the immediate concern while maintaining focus on practical solutions.",
          "priority": "high",
          "recommended_approach": "While the response was strong, consider enhancing by: 1) Exploring additional financial support options, 2) Creating detailed payment timelines, 3) Offering to email comprehensive financial information, and 4) Scheduling follow-up discussions to address any remaining financial concerns."
        },
        {
          "id": 4,
          "title": "Career Transition Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "3",
              "segment_id": "52",
              "timestamp": "9:58"
            },
            "supporting_calls": [
              {
                "call_id": "1",
                "segment_id": "24",
                "timestamp": "4:24"
              }
            ]
          },
          "student_trigger": "Multiple students expressed interest in career transitions, including shifts from current roles to new professional paths. These moments presented crucial opportunities for detailed career development planning and educational alignment.",
          "consultant_response": "While consultants acknowledged career interests, they often missed opportunities for deeper exploration and planning. Responses remained surface-level without engaging in detailed discussions about career goals or creating specific transition plans that aligned educational pathways with professional objectives.",
          "priority": "high",
          "recommended_approach": "Begin with thorough career exploration: 'What aspects of this new field interest you most?' Then create detailed plans: 1) Map specific courses to career objectives, 2) Discuss industry trends and requirements, 3) Create concrete transition timelines, and 4) Identify key milestones in the career change journey."
        },
        {
          "id": 5,
          "title": "Support Resource Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "1",
              "segment_id": "280",
              "timestamp": "46:40"
            },
            "supporting_calls": [
              {
                "call_id": "591330759172_1983",
                "segment_id": "22",
                "timestamp": null
              }
            ]
          },
          "student_trigger": "Students expressed various support needs, including academic assistance, financial guidance, and study resources. These moments presented opportunities for comprehensive support planning and confidence building through clear resource access strategies.",
          "consultant_response": "Consultants provided basic information about support services without engaging in detailed planning or resource connection. Responses lacked collaborative exploration of specific support needs and development of comprehensive support strategies tailored to individual circumstances.",
          "priority": "high",
          "recommended_approach": "Start with thorough needs assessment: 'Let's explore what type of support would be most helpful.' Then: 1) Create detailed support plans incorporating multiple resources, 2) Explain specific access procedures, 3) Schedule support service introductions, and 4) Plan regular check-ins to monitor support effectiveness."
        },
        {
          "id": 6,
          "title": "Personal Context Integration",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "call_4",
              "segment_id": "15",
              "timestamp": "03:00"
            },
            "supporting_calls": [
              {
                "call_id": "call_2",
                "segment_id": "3",
                "timestamp": "00:15"
              }
            ]
          },
          "student_trigger": "Parents approached consultants with concerns about their children's non-traditional educational backgrounds, including mental health challenges. One mother shared: 'He didn't finish year 11 due to mental health issues but he's now 22 and he's just completed a Cert 3 in IT.' These situations required sensitive handling to build confidence in university as a viable option.",
          "consultant_response": "Consultants focused primarily on procedural aspects rather than engaging with the emotional context: 'Now, it's postgraduate, so if we're looking at either two documents...' This approach missed opportunities to acknowledge personal circumstances and explore specific support needs before discussing pathways.",
          "priority": "high",
          "recommended_approach": "Begin with empathetic acknowledgment: 'Thank you for sharing your son's journey. His completion of the Cert 3 shows great determination.' Then: 1) Explore specific interests and goals, 2) Discuss available support services, 3) Create personalized study plans incorporating support mechanisms, and 4) Offer regular check-ins to monitor progress and adjustments."
        }
      ]
    }
  }
}