{
  "metadata": {
    "consultant_name": "Jack Colleran",
    "week_number": 18,
    "date_range": "02-24_02-28",
    "report_type": "Collaborative Planning"
  },
  "total_number_of_calls": 192,
  "team_average_total_number_of_calls_per_sales_consultant": 219.625,
  "number_of_calls_over_2_minutes": {
    "absolute_number": 51,
    "team_average_absolute_number": 66.0
  },
  "percent_of_calls_over_2_minutes": {
    "percentage": 26.5625,
    "team_average_percentage": 30.513109725212754
  },
  "number_of_calls_under_2_minutes": {
    "absolute_number": 141,
    "team_average_absolute_number": 153.625
  },
  "percent_of_calls_under_2_minutes": {
    "percentage": 73.4375,
    "team_average_percentage": 69.48689027478724
  },
  "average_talking_percentage": {
    "individual_average": 60.8803810500835,
    "team_average": 53.33855674000464
  },
  "excluded_transcripts": {
    "individual_excluded_transcripts": 141,
    "team_total_excluded_transcripts": 2458
  },
  "behavioral_scores": [
    {
      "label": "week-17_02-17_02-21",
      "average_final_ranking_score_eligible_transcripts": 109.38,
      "average_final_ranking_score_all_transcripts_over_2_mins": 131.58,
      "team_average_final_ranking_score_eligible_transcripts": 148.21,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 109.77
    },
    {
      "label": "week-18_02-24_02-28",
      "average_final_ranking_score_eligible_transcripts": 139.04,
      "average_final_ranking_score_all_transcripts_over_2_mins": 113.29,
      "team_average_final_ranking_score_eligible_transcripts": 157.4,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 113.71
    }
  ],
  "themes": {
    "positive": [
      {
        "headline": "Strategic Pathway Planning",
        "explanation": "Consultants effectively create personalized educational pathways that balance immediate constraints with long-term aspirations while maintaining enrollment momentum through practical solutions"
      },
      {
        "headline": "Support Systems Integration",
        "explanation": "Strong demonstration of leveraging available support mechanisms in planning discussions, enhancing student confidence through clear guidance on accessing comprehensive resources at each stage"
      },
      {
        "headline": "Flexible Study Integration",
        "explanation": "Effective demonstration of how program flexibility accommodates diverse student circumstances through specific examples and practical solutions that resonate with individual situations"
      }
    ],
    "improvement": [
      {
        "headline": "Career Development Integration",
        "explanation": "Enhanced exploration needed of how educational pathways align with specific career goals while maintaining appropriate guidance boundaries and demonstrating clear value proposition"
      },
      {
        "headline": "Study Load Management",
        "explanation": "More comprehensive discussion required around managing academic commitments alongside existing responsibilities with clearer strategies and specific support options"
      },
      {
        "headline": "Past Experience Utilization",
        "explanation": "Better integration needed of previous academic experiences and challenges to create more targeted support strategies and preparation plans that build enrollment confidence"
      }
    ]
  },
  "conversation_analysis": {
    "condensed": {
      "conversations": [
        {
          "id": 1,
          "title": "Travel-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596908058523",
              "segment_id": "19",
              "timestamp": "1:14"
            },
            "supporting_calls": [
              {
                "call_id": "595732493616",
                "segment_id": "23",
                "timestamp": "02:15"
              }
            ]
          },
          "student_trigger": "Student expressed: 'Yes, so I think I might do the second semester or next year if that's possible if I can't go away' (call_596908058523, seg_19), revealing uncertainty about managing study during travel.",
          "consultant_response": "Consultant provided clear solution: 'No you 100% can go away...there's no commitment to lectures...all your content is provided online' (call_596908058523, seg_21), effectively showing study flexibility.",
          "context_impact": "Critical moment where demonstrating program flexibility could prevent enrollment deferral and maintain momentum.",
          "recommended_approach": "Include more specific examples of how current students successfully manage coursework during travel periods and utilize offline access features."
        },
        {
          "id": 2,
          "title": "Support Systems Introduction",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596914918035",
              "segment_id": "132",
              "timestamp": "11:07"
            },
            "supporting_calls": [
              {
                "call_id": "596908273002",
                "segment_id": "131",
                "timestamp": "20:55"
              }
            ]
          },
          "student_trigger": "Student stated: 'But I'm sure I have support and that to text or call all the time anyway' (call_596914918035, seg_132), revealing interest in understanding available support mechanisms.",
          "consultant_response": "Consultant replied: 'Of course. Yeah, we have student mentors, student advisors and student coaches. Literally their job is to help you through the process' (call_596914918035, seg_137), effectively highlighting comprehensive support.",
          "context_impact": "Critical moment to validate support systems and reinforce program value through clear demonstration of comprehensive resources.",
          "recommended_approach": "Include specific examples of how different support roles assist students throughout their journey and provide clear transition points between services."
        },
        {
          "id": 3,
          "title": "Career Pathway Guidance",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "597158827755",
              "segment_id": "47",
              "timestamp": "03:05"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed: 'I'm sort of questioning whether I need to do some sort of a psychology degree or if this would suffice in the first instance' (call_597158827755, seg_47), seeking clear career pathway alignment.",
          "consultant_response": "Consultant responded: 'I'll ask them and just see what they think because we don't have career counselors' (call_597158827755, seg_52), missing opportunity for immediate high-level guidance.",
          "context_impact": "Key decision point requiring clear guidance on educational pathways aligned with career goals while maintaining appropriate boundaries.",
          "recommended_approach": "Provide immediate high-level guidance about program-career alignment while clearly explaining post-enrollment career support resources."
        },
        {
          "id": 4,
          "title": "Work-Study Balance",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596908058523",
              "segment_id": "41",
              "timestamp": "03:22"
            },
            "supporting_calls": [
              {
                "call_id": "595732493616",
                "segment_id": "23",
                "timestamp": "02:15"
              }
            ]
          },
          "student_trigger": "Student stated: 'I'm working full time, so I didn't get a chance to do that one' (call_596908058523, seg_41), indicating concerns about managing work and study commitments.",
          "consultant_response": "Consultant briefly mentioned online delivery but missed exploring specific work-study integration strategies and success stories.",
          "context_impact": "Key opportunity to demonstrate how program flexibility accommodates full-time workers through specific examples and strategies.",
          "recommended_approach": "Provide concrete examples of how current working students successfully manage their study schedules and utilize program flexibility features."
        },
        {
          "id": 5,
          "title": "Re-enrollment Support",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "597069838279",
              "segment_id": "17",
              "timestamp": "00:56"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed: 'I was doing a Bachelor's of Business in Accounting and Finance, but I got withdrawn from that degree' (call_597069838279, seg_17), indicating need for re-enrollment guidance.",
          "consultant_response": "Consultant stated: 'So what I'll do is I'll get our centre admin team to just get it do a check on your results for eligibility and see if there's any RPL you'll get' (call_597069838279, seg_36).",
          "context_impact": "Crucial opportunity to address past academic challenges and build confidence in successful re-entry through supportive planning.",
          "recommended_approach": "Explore specific challenges from previous enrollment to create targeted support strategies and demonstrate enhanced support mechanisms."
        },
        {
          "id": 6,
          "title": "Course Structure Planning",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "597158653800",
              "segment_id": "51",
              "timestamp": "3:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student asked: 'Do people generally do the core ones first and then the financial, like?' (call_597158653800, seg_51), seeking guidance on course structure.",
          "consultant_response": "Consultant explained options clearly: 'It's completely down to yourself...you can set off with a core unit or major unit, whichever one seems most appealing' (call_597158653800, seg_53).",
          "context_impact": "Important moment to demonstrate program flexibility while providing clear direction that builds enrollment confidence.",
          "recommended_approach": "Integrate more exploration of student's specific goals to provide more tailored course sequencing advice and success strategies."
        }
      ]
    },
    "verbose": {
      "conversations": [
        {
          "id": 1,
          "title": "Travel-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596908058523",
              "segment_id": "19",
              "timestamp": "1:14"
            },
            "supporting_calls": [
              {
                "call_id": "595732493616",
                "segment_id": "23",
                "timestamp": "02:15"
              }
            ]
          },
          "student_trigger": "During a critical enrollment discussion, the student expressed significant concern about managing study commitments during planned travel, stating 'Yes, so I think I might do the second semester or next year if that's possible if I can't go away' (call_596908058523, seg_19). This revealed both their interest in the program and their anxiety about maintaining academic progress during travel periods, creating a pivotal moment for addressing flexibility in program delivery.",
          "consultant_response": "The consultant demonstrated strong collaborative planning skills by immediately addressing the concern with practical solutions: 'No you 100% can go away...there's no commitment to lectures...all your content is provided online' (call_596908058523, seg_21). They further elaborated by explaining how the student could manage assignments around travel periods and access course materials flexibly. This comprehensive response effectively transformed what the student saw as a potential barrier into a manageable aspect of their studies.",
          "priority": "high",
          "recommended_approach": "When addressing travel-related study concerns, begin by validating the student's proactive thinking about potential challenges. Transform their concern into confidence by demonstrating both technical feasibility and practical strategies. Start with broad reassurance about online access, then provide specific examples of how current students successfully manage their studies while traveling. For instance, explain how they can download materials before departure, manage assignment deadlines around travel dates, and utilize offline access features. Additionally, emphasize the absence of mandatory live sessions and highlight how the teaching period provides buffer time for workload management. The key is showing how our program's flexibility specifically accommodates various travel scenarios while maintaining academic progress through concrete examples and clear support mechanisms."
        },
        {
          "id": 2,
          "title": "Support Systems Introduction",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596914918035",
              "segment_id": "132",
              "timestamp": "11:07"
            },
            "supporting_calls": [
              {
                "call_id": "596908273002",
                "segment_id": "131",
                "timestamp": "20:55"
              }
            ]
          },
          "student_trigger": "The student's statement 'But I'm sure I have support and that to text or call all the time anyway' (call_596914918035, seg_132) revealed both interest and uncertainty regarding available support systems. This was reinforced in another call when a student inquired 'In terms of learning groups, is it worth it?' (call_596908273002, seg_131), demonstrating active engagement in understanding support resources.",
          "consultant_response": "In the primary interaction, the consultant effectively responded with 'Of course. Yeah, we have student mentors, student advisors and student coaches. Literally their job is to help you through the process and make it as easy as possible and seamless for you' (call_596914918035, seg_137). This comprehensive overview of support roles effectively demonstrated the institution's commitment to student success. The response established clear expectations while maintaining appropriate boundaries between enrollment and post-enrollment support.",
          "priority": "high",
          "recommended_approach": "When students express interest in support systems, begin by validating their recognition of support's importance. Start with acknowledgment: 'It's great that you're thinking about utilizing support systems - they're definitely key to student success.' Then provide a clear overview of support roles while connecting each to specific student needs: 'Our student mentors help with day-to-day questions, advisors assist with program planning, and coaches focus on study strategies.' Share specific examples of how students utilize different support mechanisms: 'Many students work with mentors during their first term to establish effective study routines, then connect with advisors to plan their long-term progression.' Always maintain appropriate role boundaries by focusing on high-level guidance while clearly indicating which detailed support becomes available post-enrollment. The key is creating confidence in the support system while setting clear expectations for each stage of the student journey."
        },
        {
          "id": 3,
          "title": "Career Pathway Guidance",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "597158827755",
              "segment_id": "47",
              "timestamp": "03:05"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student expressed career pathway uncertainty: 'I'm sort of questioning whether I need to do some sort of a psychology degree or if this would suffice in the first instance' (call_597158827755, seg_47). This moment represented a critical decision point where the student needed clear guidance on how educational choices aligned with career aspirations, while maintaining appropriate boundaries between sales and career counseling roles.",
          "consultant_response": "The consultant's response was suboptimal: 'I'll ask them and just see what they think because we don't have career counselors' (call_597158827755, seg_52). While acknowledging role limitations was appropriate, the response missed an opportunity to provide immediate high-level guidance while explaining available post-enrollment career support resources.",
          "priority": "high",
          "recommended_approach": "When students express uncertainty about educational pathways and career alignment, start by acknowledging their strategic thinking: 'It's excellent that you're considering how your education aligns with your career goals.' Then provide appropriate high-level guidance while maintaining role boundaries: 'While I can't provide detailed career advice, I can share how our program supports different career pathways. Many of our students use this program as a foundation for psychology-related careers, while others leverage it for immediate professional growth.' Explain the support transition: 'Once enrolled, you'll have access to our career development team who can provide detailed guidance on psychology career pathways.' Focus on program features that support career development: 'Our curriculum includes practical components and industry engagement opportunities that help students explore different career directions while studying.' This approach provides immediate value while setting clear expectations about comprehensive career support post-enrollment."
        },
        {
          "id": 4,
          "title": "Work-Study Balance",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596908058523",
              "segment_id": "41",
              "timestamp": "03:22"
            },
            "supporting_calls": [
              {
                "call_id": "595732493616",
                "segment_id": "23",
                "timestamp": "02:15"
              }
            ]
          },
          "student_trigger": "A critical moment occurred when the student revealed their full-time work status, stating 'I'm working full time, so I didn't get a chance to do that one' (call_596908058523, seg_41). This comment indicated both their current time constraints and their concern about managing future study commitments alongside work responsibilities.",
          "consultant_response": "The consultant's response was limited, briefly mentioning the online nature of the course without exploring specific strategies for balancing work and study commitments. This missed opportunity to demonstrate how the program's flexibility could specifically accommodate full-time workers left the student without concrete solutions to their evident concerns about time management.",
          "priority": "high",
          "recommended_approach": "When addressing work-study balance concerns, begin by acknowledging their awareness of this important consideration. Engage in a focused discussion about their specific work patterns and potential study times by asking questions like 'What does your typical work week look like?' and 'When do you typically have the most energy for focused study?' Use this information to suggest tailored approaches, such as how other working professionals successfully utilize early mornings, lunch breaks, or evening hours for study. Share specific examples of how current working students manage their coursework, like downloading materials for offline study during commutes or breaking assignments into smaller, manageable segments. Include concrete success stories: 'One of our current students working full-time in finance downloads weekly materials every Sunday evening and completes readings during his lunch breaks.' The goal is to transform their perceived barrier into a manageable aspect of their educational journey through practical, proven strategies that resonate with their specific situation."
        },
        {
          "id": 5,
          "title": "Re-enrollment Support",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "597069838279",
              "segment_id": "17",
              "timestamp": "00:56"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student shared their previous academic experience: 'I was doing a Bachelor's of Business in Accounting and Finance, but I got withdrawn from that degree' (call_597069838279, seg_17). This disclosure presented a critical moment requiring sensitive handling of past academic challenges while building confidence for successful re-entry. The student's openness about their withdrawal created an opportunity to demonstrate how the program could support their return to studies.",
          "consultant_response": "The consultant demonstrated basic process knowledge by responding: 'So what I'll do is I'll get our centre admin team to just get it do a check on your results for eligibility and see if there's any RPL you'll get' (call_597069838279, seg_36). While this showed immediate action, it missed the opportunity to explore and address the underlying factors that could impact future academic success.",
          "priority": "high",
          "recommended_approach": "When addressing students with previous withdrawal experiences, begin by acknowledging their past experience while maintaining a forward-looking perspective. Start with validation: 'Thank you for sharing that experience with me - it's important we understand your academic journey so we can best support your return to studies.' Follow with exploration of specific factors: 'Could you share what challenges you encountered previously? This helps us ensure we can provide the right support this time.' Create space for students to discuss past difficulties while focusing on solutions: 'Many students find their second attempt at study more successful because they better understand what support they need.' When discussing eligibility and RPL, frame it positively: 'Let's look at how your previous studies can actually accelerate your progress - many students find their past experience, even if incomplete, can contribute to their new program.' Always emphasize the support mechanisms that differentiate the current opportunity: 'We've found that students returning to study often benefit from our structured support system, including dedicated advisors who can help navigate any challenges that arise.'"
        },
        {
          "id": 6,
          "title": "Course Structure Planning",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "597158653800",
              "segment_id": "51",
              "timestamp": "3:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student initiated a thoughtful discussion about course planning by asking 'Do people generally do the core ones first and then the financial, like?' (call_597158653800, seg_51). This question revealed their engagement with program structure and desire for guidance in creating an effective study pathway, presenting a key opportunity for collaborative planning that could influence their confidence in the program.",
          "consultant_response": "The consultant provided a balanced response that respected student autonomy while offering guidance: 'It's completely down to yourself...you can set off with a core unit or major unit, whichever one seems most appealing' (call_597158653800, seg_53). They effectively combined flexibility with structure by explaining unit availability across teaching periods and assuring additional support from student advisors for detailed planning.",
          "priority": "high",
          "recommended_approach": "When discussing course selection and sequencing, start by validating the student's thoughtful approach to planning their academic journey. Balance providing clear guidance while maintaining student autonomy in decision-making. Begin by asking about their specific goals and interests: 'What aspects of the program most interest you?' and 'Are there particular skills you're hoping to develop early in your studies?' Use their responses to guide discussion of how different course sequences might align with their objectives: 'Many students interested in financial roles start with our foundational accounting unit to build core skills.' Share examples of common pathways other students have found successful, while emphasizing the flexibility to adapt these to individual preferences. Provide specific success strategies: 'Some students find starting with a core unit helps them establish strong study habits before tackling specialized content.' The key is demonstrating how course selection can strategically support their professional goals while maintaining academic progress through personalized planning that respects their autonomy."
        }
      ]
    }
  }
}