{
  "metadata": {
    "consultant_name": "Jake Mckinnis",
    "week_number": 16,
    "date_range": "02-10_02-14",
    "report_type": "Collaborative Planning"
  },
  "total_number_of_calls": 280,
  "team_average_total_number_of_calls_per_sales_consultant": 242.8125,
  "number_of_calls_over_2_minutes": {
    "absolute_number": 64,
    "team_average_absolute_number": 62.3125
  },
  "percent_of_calls_over_2_minutes": {
    "percentage": 22.857142857142858,
    "team_average_percentage": 25.75705321113411
  },
  "number_of_calls_under_2_minutes": {
    "absolute_number": 216,
    "team_average_absolute_number": 180.5
  },
  "percent_of_calls_under_2_minutes": {
    "percentage": 77.14285714285715,
    "team_average_percentage": 74.2429467888659
  },
  "average_talking_percentage": {
    "individual_average": 51.63370767929173,
    "team_average": 53.5140458127338
  },
  "excluded_transcripts": {
    "individual_excluded_transcripts": 216,
    "team_total_excluded_transcripts": 2888
  },
  "behavioral_scores": [
    {
      "label": "week-10_12-30_01-03",
      "average_final_ranking_score_eligible_transcripts": 158.44,
      "average_final_ranking_score_all_transcripts_over_2_mins": 106.26,
      "team_average_final_ranking_score_eligible_transcripts": 178.81,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 131.7
    },
    {
      "label": "week-11_01-06_01-10",
      "average_final_ranking_score_eligible_transcripts": 111.13,
      "average_final_ranking_score_all_transcripts_over_2_mins": 94.09,
      "team_average_final_ranking_score_eligible_transcripts": 174.2,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 118.12
    },
    {
      "label": "week-12_01-13_01-17",
      "average_final_ranking_score_eligible_transcripts": 137.58,
      "average_final_ranking_score_all_transcripts_over_2_mins": 73.71,
      "team_average_final_ranking_score_eligible_transcripts": 157.75,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 113.37
    },
    {
      "label": "week-13_01-20_01-24",
      "average_final_ranking_score_eligible_transcripts": 140.67,
      "average_final_ranking_score_all_transcripts_over_2_mins": 107.53,
      "team_average_final_ranking_score_eligible_transcripts": 162.74,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 120.37
    },
    {
      "label": "week-14_01-27_01-31",
      "average_final_ranking_score_eligible_transcripts": 148.9,
      "average_final_ranking_score_all_transcripts_over_2_mins": 99.26,
      "team_average_final_ranking_score_eligible_transcripts": 155.43,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 112.46
    },
    {
      "label": "week-15_02-03_02-07",
      "average_final_ranking_score_eligible_transcripts": 171.09,
      "average_final_ranking_score_all_transcripts_over_2_mins": 94.89,
      "team_average_final_ranking_score_eligible_transcripts": 157.11,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 113.21
    },
    {
      "label": "week-16_02-10_02-14",
      "average_final_ranking_score_eligible_transcripts": 118.62,
      "average_final_ranking_score_all_transcripts_over_2_mins": 84.01,
      "team_average_final_ranking_score_eligible_transcripts": 163.3,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 109.25
    }
  ],
  "themes": {
    "positive": [
      {
        "headline": "Strategic Pathway Planning",
        "explanation": "Consultants effectively create personalized educational pathways that balance immediate constraints with long-term aspirations while maintaining enrollment momentum through clear action steps and timeline management"
      },
      {
        "headline": "Flexible Study Integration",
        "explanation": "Strong demonstration of how program flexibility accommodates diverse student circumstances including work patterns, family commitments, and scheduling needs through practical examples and personalized solutions"
      },
      {
        "headline": "Proactive Support Integration",
        "explanation": "Effective guidance through available support mechanisms with clear boundaries and expectations, ensuring students understand both immediate and long-term assistance options"
      }
    ],
    "improvement": [
      {
        "headline": "Career Development Integration",
        "explanation": "Enhanced exploration needed of how program elements align with specific workplace challenges and career transition goals while maintaining appropriate pre-enrollment boundaries"
      },
      {
        "headline": "Student Uncertainty Management",
        "explanation": "More comprehensive support needed for addressing student hesitation through collaborative exploration of concerns and development of personalized confidence-building solutions"
      },
      {
        "headline": "Experience Gap Navigation",
        "explanation": "Stronger strategies needed for helping students bridge gaps between current experience levels and program requirements through targeted pathway planning and clear progression opportunities"
      }
    ]
  },
  "conversation_analysis": {
    "condensed": {
      "conversations": [
        {
          "id": 1,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "Student stated: 'I work rotating shifts at the hospital, not sure how I'll manage study' (call_595732493616, seg_23), followed by similar concerns from another healthcare worker: 'My roster changes every week' (call_595732548084, seg_163), revealing critical scheduling flexibility needs.",
          "consultant_response": "Consultant provided practical solution: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24), effectively showing real-world flexibility.",
          "context_impact": "This moment required clear demonstration of how our program design specifically accommodates healthcare shift workers to maintain enrollment momentum.",
          "recommended_approach": "Include more specific examples of successful study patterns from current healthcare students and demonstrate varied approaches to different shift patterns."
        },
        {
          "id": 2,
          "title": "Return to Study Support",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596104786957",
              "segment_id": "31",
              "timestamp": "31:40"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed: 'I haven't studied for 15 years - I'm worried I won't be able to keep up' (call_596104786957, seg_31), revealing deep anxiety about academic readiness after extended break.",
          "consultant_response": "Consultant provided minimal reassurance without exploring transferable skills or detailing available support resources.",
          "context_impact": "Critical moment to build confidence and demonstrate comprehensive support systems while validating professional experience.",
          "recommended_approach": "Actively discuss how professional experience provides valuable transferable skills and outline specific support resources available."
        },
        {
          "id": 3,
          "title": "Career Transition Guidance",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596104817879",
              "segment_id": "121",
              "timestamp": "08:34"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'I want to get into the education space and ideally I'd like to get in there faster than having to do a full four years first' (call_596104817879, seg_121), revealing urgent career change goals.",
          "consultant_response": "Consultant expertly guided: 'Let's explore how you can make that transition possible by discussing the specific steps with our learning advisors' (call_596104817879, seg_122), ensuring appropriate specialized support.",
          "context_impact": "Required demonstrating accelerated pathway options while maintaining appropriate career guidance boundaries.",
          "recommended_approach": "Include immediate high-level pathway examples while maintaining clear role boundaries."
        },
        {
          "id": 4,
          "title": "Study Load Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595907829823",
              "segment_id": "161",
              "timestamp": "7:50"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'I think I might just start off with two. We'll go that way and then just see how we go' (call_595907829823, seg_161), showing thoughtful consideration of initial workload.",
          "consultant_response": "Consultant reinforced decision: 'Perfect. So, keep in mind if you're not liking the two units...you can drop down one unit before that census period' (call_595907829823, seg_163), highlighting risk-free flexibility.",
          "context_impact": "Essential opportunity to validate strategic approach while ensuring comprehensive awareness of flexibility options.",
          "recommended_approach": "Explore specific support resources and success strategies available for different study loads."
        },
        {
          "id": 5,
          "title": "Student Uncertainty Resolution",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596179434268",
              "segment_id": "12",
              "timestamp": "1:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed: 'I'm not 100% in' (call_596179434268, seg_12), revealing hesitation about program commitment.",
          "consultant_response": "Consultant closed conversation: 'Well, I'll close the request off then for now. If you've got any questions, reach out to me' (call_596179434268, seg_33).",
          "context_impact": "Unaddressed uncertainty could lead to missed enrollment opportunity and diminished student confidence.",
          "recommended_approach": "Engage in deeper exploration of concerns and discuss flexible study options to address specific hesitations."
        },
        {
          "id": 6,
          "title": "Enhanced Eligibility Discussion",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595908275333",
              "segment_id": "12",
              "timestamp": "01:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed: 'I was just applying for it because I was very interested in this course and I was inquiring if I was eligible to complete it and do it' (call_595908275333, seg_12), showing enthusiasm combined with eligibility uncertainty.",
          "consultant_response": "Consultant stated: 'Essentially I will send you an email, you forward me through your documents' (call_595908275333, seg_15), missing opportunity for deeper engagement.",
          "context_impact": "Critical opportunity to explore student's background, goals, and motivations while discussing eligibility pathways.",
          "recommended_approach": "Engage in comprehensive discussion about student's background, aspirations, and potential pathways before proceeding to administrative steps."
        }
      ]
    },
    "verbose": {
      "conversations": [
        {
          "id": 1,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "In call 595732493616 (segment 23), the student expressed significant concern about balancing study with shift work: 'I work rotating shifts at the hospital, not sure how I'll manage study.' This revealed both interest in the program and anxiety about practical implementation. Similar concerns emerged in call 595732548084 (segment 163) where another healthcare worker noted: 'My roster changes every week.' These moments represented critical opportunities to demonstrate how our program specifically accommodates healthcare professionals' unique scheduling challenges.",
          "consultant_response": "The primary consultant demonstrated strong understanding of healthcare workflows by responding: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24). This practical example resonated strongly, with the student responding: 'That actually sounds manageable.' In the supporting call, the consultant built on the flexible access theme: 'The beauty of our platform is you can switch between online and offline study. Some students download their materials before night shifts' (call_595732548084, seg_164). Both consultants effectively moved the conversation from 'if' to 'how', directly addressing practical concerns while maintaining momentum.",
          "priority": "high",
          "recommended_approach": "When addressing shift workers' scheduling concerns, start by validating their specific work pattern before showing how our program design aligns with healthcare workflows. Share concrete examples of how current students manage study around shifts - whether it's downloading materials for night shifts, studying during quiet periods, or breaking study into small blocks between shifts. The key is making flexibility tangible rather than theoretical. For instance, explain how asynchronous learning means no mandatory live sessions, and offline access means study can happen even in areas with poor connectivity. For those with rotating rosters, emphasize how weekly study patterns can adapt to changing schedules. Pay particular attention to proactively addressing night shifts and long rotations, showing how our platform's flexibility specifically addresses these challenges. The goal is to transform perceived scheduling barriers into manageable planning opportunities, always grounding explanations in healthcare-specific scenarios that resonate with their experience."
        },
        {
          "id": 2,
          "title": "Return to Study Support",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596104786957",
              "segment_id": "31",
              "timestamp": "31:40"
            },
            "supporting_calls": []
          },
          "student_trigger": "At 31:40 into the call (segment 31), the student revealed significant anxiety about returning to education: 'I haven't studied for 15 years - I'm worried I won't be able to keep up.' This candid expression of concern about academic readiness after a lengthy break from formal education represented a crucial moment for building confidence and demonstrating comprehensive support.",
          "consultant_response": "The consultant provided minimal reassurance without exploring the student's professional experience or detailing available support resources. This missed opportunity to build confidence through recognition of transferable skills and explanation of comprehensive support systems potentially left the student's concerns unaddressed.",
          "priority": "high",
          "recommended_approach": "When students express concerns about returning to study after an extended break, begin by validating their feelings while positioning them within a success context. Start with acknowledgment: 'Many of our most successful students share similar concerns when returning to study after a break.' Then actively explore their professional background: 'Your work experience has equipped you with valuable skills that transfer directly to academic success. Could you tell me about your current role?' Draw explicit connections between professional and academic skills: 'Project management experience, for instance, demonstrates the organizational and analytical skills crucial for successful study.' Throughout the conversation, emphasize comprehensive support systems: 'We provide structured support including orientation modules, study skills workshops, and dedicated academic advisors who specifically help students returning to education.' Share specific success stories: 'We have many students who return after 10-20 years and excel thanks to their professional experience and our targeted support.' The key is transforming perceived barriers into advantages while ensuring students understand the extensive support available throughout their journey."
        },
        {
          "id": 3,
          "title": "Career Transition Guidance",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596104817879",
              "segment_id": "121",
              "timestamp": "08:34"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student expressed clear career transition goals with time sensitivity: 'I want to get into the education space and ideally I'd like to get in there faster than having to do a full four years first' (call_596104817879, seg_121). This statement demonstrated strong motivation for career change combined with practical concerns about program duration.",
          "consultant_response": "The consultant effectively balanced career guidance with role boundaries by suggesting: 'Let's explore how you can make that transition possible by discussing the specific steps with our learning advisors' (call_596104817879, seg_122). This response acknowledged career aspirations while ensuring specialized support through appropriate channels.",
          "priority": "high",
          "recommended_approach": "When addressing career transition inquiries, begin by validating both the career aspiration and efficiency concerns: 'I understand your enthusiasm for entering education and your desire to find an efficient pathway.' Then provide immediate high-level guidance while maintaining clear role boundaries: 'While our learning advisors will create your detailed career plan, I can share that many students transition to education through accelerated pathways combining credit recognition with intensive study options.' Use specific examples: 'For instance, many career changers combine online study with strategic elective choices to build relevant skills quickly.' Throughout the conversation, emphasize comprehensive support while maintaining appropriate pre-enrollment discussion boundaries: 'Our team supports your journey through several stages - from initial program selection through to detailed career planning with our specialist advisors.' The key is keeping students engaged while ensuring expectations align with available services."
        },
        {
          "id": 4,
          "title": "Study Load Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595907829823",
              "segment_id": "161",
              "timestamp": "7:50"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student demonstrated thoughtful consideration of their initial study load: 'I think I might just start off with two. We'll go that way and then just see how we go' (call_595907829823, seg_161). This measured approach revealed both prudence and openness to adjusting based on experience.",
          "consultant_response": "The consultant provided supportive guidance while highlighting adjustment options: 'Perfect. So, keep in mind if you're not liking the two units, you can drop down one unit before that census period' (call_595907829823, seg_163). This response effectively validated the student's conservative approach while ensuring they understood their ability to adjust if needed.",
          "priority": "high",
          "recommended_approach": "When discussing study load decisions, begin by validating the student's strategic approach: 'Starting with two units shows excellent planning - it gives you time to adjust while maintaining steady progress.' Then outline the comprehensive support framework: 'Let me explain how our flexible study options and support services work together to ensure your success.' Share success patterns: 'Many students start with two units to establish their rhythm, then adjust based on their growing confidence and experience.' Throughout the discussion, emphasize the partnership aspect: 'We're here to help you find the right balance, and you can always reach out to discuss adjusting your study load as your needs change.' The key is building student confidence while ensuring they understand both their options and the support available at every stage."
        },
        {
          "id": 5,
          "title": "Student Uncertainty Resolution",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596179434268",
              "segment_id": "12",
              "timestamp": "1:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "Early in the conversation, the student expressed hesitation about their commitment level: 'I'm not 100% in' (call_596179434268, seg_12). This candid admission signaled the need for deeper exploration of their concerns and reservations about the program.",
          "consultant_response": "The consultant's response was notably brief and disengaging: 'Well, I'll close the request off then for now. If you've got any questions, reach out to me' (call_596179434268, seg_33). This approach missed the opportunity to explore and address the student's hesitation, potentially leaving them with unresolved concerns.",
          "priority": "high",
          "recommended_approach": "When students express uncertainty, create a supportive space for exploring their concerns while demonstrating program flexibility. Begin with validation: 'It's natural to want to be certain about such an important decision. Let's explore what's giving you pause.' Guide the conversation through specific concerns, using examples of how other students have successfully navigated similar challenges: 'Many of our students initially shared similar concerns. For instance, one recent graduate worried about balancing work and study, but found our flexible options made it manageable.' Address each concern with specific solutions, such as explaining support services or study pace adjustments. Transform uncertainty from a barrier into an opportunity for creating a personalized study approach: 'Let's look at how we can tailor the program to address your specific concerns.' Remember to emphasize ongoing support: 'Our role is to help you succeed not just in enrolling, but throughout your studies, with dedicated advisors available whenever you need them.'"
        },
        {
          "id": 6,
          "title": "Enhanced Eligibility Discussion",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595908275333",
              "segment_id": "12",
              "timestamp": "01:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student expressed both interest and uncertainty about eligibility: 'I was just applying for it because I was very interested in this course and I was inquiring if I was eligible to complete it and do it' (call_595908275333, seg_12). This statement revealed enthusiasm for the program combined with uncertainty about meeting entry requirements.",
          "consultant_response": "The consultant provided a procedural response: 'Essentially I will send you an email, you forward me through your documents' (call_595908275333, seg_15). While informative about process, this response missed the opportunity to engage with the student's enthusiasm and explore their background more thoroughly.",
          "priority": "high",
          "recommended_approach": "When addressing eligibility inquiries, begin with a comprehensive exploration of the student's background and aspirations before moving to administrative processes. Start by acknowledging their interest: 'It's wonderful to hear your enthusiasm for the program. Let's explore your background together to find the best pathway for you.' Follow with strategic questions: 'Could you tell me about your educational background and what's particularly drawn you to this course?' Use their responses to guide discussion: 'Based on what you've shared, let me outline some potential pathways that align with your experience and goals.' Include discussion of alternative entry options if relevant: 'We have several entry pathways available, including recognition of prior learning and work experience.' Throughout the conversation, maintain focus on building confidence while gathering necessary information: 'Your professional experience in [specific field] could be particularly valuable for this program. Let's discuss how it aligns with our entry requirements.' The goal is creating a supportive dialogue that helps students understand their options while gathering the information needed to guide them effectively toward enrollment."
        }
      ]
    }
  }
}