{
  "metadata": {
    "consultant_name": "Luke Williams",
    "week_number": 16,
    "date_range": "02-10_02-14",
    "report_type": "Collaborative Planning"
  },
  "total_number_of_calls": 310,
  "team_average_total_number_of_calls_per_sales_consultant": 229.8181818181818,
  "number_of_calls_over_2_minutes": {
    "absolute_number": 58,
    "team_average_absolute_number": 46.18181818181818
  },
  "percent_of_calls_over_2_minutes": {
    "percentage": 18.70967741935484,
    "team_average_percentage": 25.638189410827206
  },
  "number_of_calls_under_2_minutes": {
    "absolute_number": 252,
    "team_average_absolute_number": 183.63636363636363
  },
  "percent_of_calls_under_2_minutes": {
    "percentage": 81.29032258064515,
    "team_average_percentage": 65.27090149826371
  },
  "average_talking_percentage": {
    "individual_average": 54.865797997623325,
    "team_average": 56.25193772093511
  },
  "excluded_transcripts": {
    "individual_excluded_transcripts": 252,
    "team_total_excluded_transcripts": 2021
  },
  "behavioral_scores": [
    {
      "label": "week-11_01-06_01-10",
      "average_final_ranking_score_eligible_transcripts": 108.9,
      "average_final_ranking_score_all_transcripts_over_2_mins": 95.68,
      "team_average_final_ranking_score_eligible_transcripts": 135.45,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 107.66
    },
    {
      "label": "week-12_01-13_01-17",
      "average_final_ranking_score_eligible_transcripts": 107.82,
      "average_final_ranking_score_all_transcripts_over_2_mins": 69.01,
      "team_average_final_ranking_score_eligible_transcripts": 149.51,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 99.85
    },
    {
      "label": "week-13_01-20_01-24",
      "average_final_ranking_score_eligible_transcripts": 136.21,
      "average_final_ranking_score_all_transcripts_over_2_mins": 101.39,
      "team_average_final_ranking_score_eligible_transcripts": 139.49,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 104.47
    },
    {
      "label": "week-14_01-27_01-31",
      "average_final_ranking_score_eligible_transcripts": 108.56,
      "average_final_ranking_score_all_transcripts_over_2_mins": 93.75,
      "team_average_final_ranking_score_eligible_transcripts": 123.13,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 97.01
    },
    {
      "label": "week-15_02-03_02-07",
      "average_final_ranking_score_eligible_transcripts": 214.86,
      "average_final_ranking_score_all_transcripts_over_2_mins": 105.22,
      "team_average_final_ranking_score_eligible_transcripts": 154.42,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 102.61
    },
    {
      "label": "week-16_02-10_02-14",
      "average_final_ranking_score_eligible_transcripts": 98.37,
      "average_final_ranking_score_all_transcripts_over_2_mins": 85.51,
      "team_average_final_ranking_score_eligible_transcripts": 133.34,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 101.14
    }
  ],
  "themes": {
    "positive": [
      {
        "headline": "Strategic Pathway Planning",
        "explanation": "Consultants effectively create personalized educational pathways that balance immediate constraints with long-term aspirations while maintaining enrollment momentum through concrete action planning and comprehensive support mechanisms"
      },
      {
        "headline": "Flexible Study Integration",
        "explanation": "Strong demonstration of how program flexibility accommodates diverse student circumstances through practical examples, clear implementation strategies, and detailed evidence of successful student experiences"
      },
      {
        "headline": "Career Goal Alignment",
        "explanation": "Effective exploration of how educational pathways and program components directly support specific career advancement goals through practical workplace applications and clear progression planning"
      }
    ],
    "improvement": [
      {
        "headline": "Initial Engagement Depth",
        "explanation": "Enhanced early exploration needed of student goals and circumstances before proceeding with technical details or transfers to maintain meaningful connection and demonstrate comprehensive support"
      },
      {
        "headline": "Work-Life Integration",
        "explanation": "Deeper collaborative planning required for helping students envision practical strategies for managing study alongside existing commitments with specific examples and tailored solutions"
      },
      {
        "headline": "Study Continuation Planning",
        "explanation": "More comprehensive discussion needed around managing potential study interruptions and leveraging available flexibility options to maintain academic progress while building long-term confidence"
      }
    ]
  },
  "conversation_analysis": {
    "condensed": {
      "conversations": [
        {
          "id": 1,
          "title": "Strategic Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "Student stated: 'I work rotating shifts at the hospital, not sure how I'll manage study' (call_595732493616, seg_23), revealing significant anxiety about managing professional commitments in healthcare.",
          "consultant_response": "Consultant provided practical solution: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24), effectively showing study flexibility with healthcare-specific examples.",
          "context_impact": "This moment required clear demonstration of how program flexibility could accommodate healthcare shift work while maintaining enrollment momentum through practical solutions.",
          "recommended_approach": "Include more specific examples of successful study patterns from current healthcare students and highlight available support services throughout their journey."
        },
        {
          "id": 2,
          "title": "Career-Aligned Course Selection",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596104636422",
              "segment_id": "22",
              "timestamp": "02:20"
            },
            "supporting_calls": [
              {
                "call_id": "596253327823",
                "segment_id": "74",
                "timestamp": "04:15"
              }
            ]
          },
          "student_trigger": "Student expressed: 'So, I was looking for something where it will help me as a teacher use everything, like all the technological tools related to education' (call_596104636422, seg_22), seeking career relevance confirmation and practical application.",
          "consultant_response": "Consultant connected outcomes to profession: 'The reason why people like to do this course is so they can learn how to use educational design in their workplace...designing digital content, designing for interaction and collaboration' (call_596104636422, seg_29), showing direct career benefits.",
          "context_impact": "Critical opportunity to validate course selection by aligning program outcomes with specific career goals and immediate workplace applications in education.",
          "recommended_approach": "Explore specific workplace contexts and technology needs to create more personalized career alignment with concrete teaching applications."
        },
        {
          "id": 3,
          "title": "Timeline Management",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596019990928",
              "segment_id": "54",
              "timestamp": "02:03"
            },
            "supporting_calls": [
              {
                "call_id": "595908104334",
                "segment_id": "88",
                "timestamp": "5:15"
              }
            ]
          },
          "student_trigger": "Student stated: 'Probably not, I'd probably enrol anyway, but I would like to get to those credits' (call_596019990928, seg_54), revealing critical need for balancing immediate enrollment with credit assessment process.",
          "consultant_response": "Consultant provided specific timeline guidance: 'Applications for our March intake do close next Wednesday... What you can always do is we can get you enrolled and then you've got March 14th as your census date' (call_596019990928, seg_58), showing clear milestones.",
          "context_impact": "Critical moment requiring clear demonstration of how enrollment timeline and credit process could be managed together while maintaining momentum through specific deadlines.",
          "recommended_approach": "Include more specific examples of successful credit outcomes and detailed timeline management strategies with clear safety nets."
        },
        {
          "id": 4,
          "title": "Study Commitment Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595907928836",
              "segment_id": "112",
              "timestamp": "07:45"
            },
            "supporting_calls": [
              {
                "call_id": "595907713051",
                "segment_id": "20",
                "timestamp": "2:15"
              }
            ]
          },
          "student_trigger": "Student expressed: 'So I was concerned that I don't have the commitment to do it for two years' (call_595907928836, seg_112), revealing deep anxiety about maintaining long-term study engagement.",
          "consultant_response": "Consultant focused on formal requirements without addressing commitment concerns or exploring flexible study options that could build confidence.",
          "context_impact": "Critical concern requiring detailed exploration of flexible study options and support mechanisms to prevent enrollment hesitation.",
          "recommended_approach": "Engage in detailed exploration of available time and commitments to develop realistic, manageable study plans with clear milestones and support mechanisms."
        },
        {
          "id": 5,
          "title": "Work-Study Integration",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595907713051",
              "segment_id": "20",
              "timestamp": "2:15"
            },
            "supporting_calls": [
              {
                "call_id": "595908104334",
                "segment_id": "23",
                "timestamp": "23:20"
              }
            ]
          },
          "student_trigger": "Student stated: 'I just kind of am not too sure like if it would be realistic to like make it work with a full-time job' (call_595907713051, seg_20), revealing significant work-study balance concerns.",
          "consultant_response": "Consultant missed opportunity to explore flexible study options or provide examples of successful working students managing similar challenges.",
          "context_impact": "Clear demonstration of study-work balance feasibility essential for building enrollment confidence through practical examples.",
          "recommended_approach": "Share specific examples and strategies of how current working students successfully manage their study commitments and leverage program flexibility."
        },
        {
          "id": 6,
          "title": "Initial Program Exploration",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596253297858",
              "segment_id": "1",
              "timestamp": "0:20"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'I just want to know that Munasiru was about dental hygienist course' (call_596253297858, seg_1), showing specific program interest requiring meaningful engagement.",
          "consultant_response": "Consultant immediately transferred: 'Okay, I'll have to put you through to a different department' (call_596253297858, seg_3), missing crucial engagement opportunity.",
          "context_impact": "Critical first impression moment requiring strong engagement and value demonstration before any necessary transfer.",
          "recommended_approach": "Establish rapport and provide brief program overview highlighting key benefits and career outcomes before facilitating warm transfer with clear handover."
        }
      ]
    },
    "verbose": {
      "conversations": [
        {
          "id": 1,
          "title": "Strategic Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "In call 595732493616 (segment 23), the student expressed significant concern about balancing study with shift work: 'I work rotating shifts at the hospital, not sure how I'll manage study.' This revealed both interest in the program and anxiety about practical implementation. Similar concerns emerged in call 595732548084 (segment 163) where another healthcare worker noted: 'My roster changes every week, and I often work nights.' These moments represented critical opportunities to demonstrate how our program specifically accommodates healthcare professionals' unique scheduling challenges.",
          "consultant_response": "The consultant demonstrated strong understanding of healthcare workflows, responding with: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24). This practical example resonated strongly, with the student responding: 'That actually sounds manageable' (seg_25). In the supporting call, the consultant built on the flexible access theme: 'The beauty of our platform is you can switch between online and offline study. Some students download their materials before night shifts' (call_595732548084, seg_164). Both consultants effectively moved the conversation from 'if' to 'how', directly addressing practical concerns while maintaining momentum.",
          "priority": "high",
          "recommended_approach": "When addressing shift workers' scheduling concerns, always start by acknowledging their specific work pattern before showing how our program design aligns with healthcare workflows. Share concrete examples of how current students manage study around shifts - whether it's downloading materials for night shifts, studying during quiet periods, or breaking study into small blocks between shifts. The key is making flexibility tangible rather than theoretical. For instance, explain how asynchronous learning means no mandatory live sessions, and offline access means study can happen even in areas with poor connectivity. For those with rotating rosters, emphasize how weekly study patterns can adapt to changing schedules. Pay particular attention to students working night shifts or long rotations, showing how our platform's flexibility specifically addresses these challenges. The goal is to transform perceived scheduling barriers into manageable planning opportunities, always grounding explanations in healthcare-specific scenarios that resonate with their experience."
        },
        {
          "id": 2,
          "title": "Career-Aligned Course Selection",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596104636422",
              "segment_id": "22",
              "timestamp": "02:20"
            },
            "supporting_calls": [
              {
                "call_id": "596253327823",
                "segment_id": "74",
                "timestamp": "04:15"
              }
            ]
          },
          "student_trigger": "At segment 22, the student expressed uncertainty about their course selection while highlighting their professional goals: 'So, I was looking for something where it will help me as a teacher use everything, like all the technological tools related to education. I'm not exactly sure if I've chosen the right course.' This moment revealed both the student's specific career aspirations and their need for confirmation that the course would support their professional development.",
          "consultant_response": "The consultant effectively addressed these concerns by connecting course outcomes directly to workplace applications: 'The reason why people like to do this course is so they can learn how to use educational design in their workplace or be able to make courses and have people be able to complete them. So you do things like designing digital content, designing for interaction and collaboration, innovations in technologies and pedagogical practices as well.' This response demonstrated strong collaborative planning by directly linking course content to practical teaching applications.",
          "priority": "high",
          "recommended_approach": "When discussing course alignment with career goals, especially in education-related fields, begin by acknowledging the student's professional context: 'As an educator, you're looking to enhance your technical toolkit - let's explore how this course specifically supports that goal.' Guide the conversation through key course components, always connecting them to practical teaching applications: 'When we cover digital content design, you'll learn techniques you can immediately apply in your classroom, such as creating interactive learning materials.' Encourage the student to share specific aspects of their teaching role they want to enhance: 'What types of technology are you currently using, and what would you like to do more with?' This helps personalize the discussion and demonstrates how the course directly supports their professional development. Remember to balance immediate benefits with long-term career impact: 'Not only will you gain skills for your current role, but you'll also be positioned to lead educational technology initiatives in your school.' This approach transforms course selection from a choice to an investment in their professional future."
        },
        {
          "id": 3,
          "title": "Timeline Management",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596019990928",
              "segment_id": "54",
              "timestamp": "02:03"
            },
            "supporting_calls": [
              {
                "call_id": "595908104334",
                "segment_id": "88",
                "timestamp": "5:15"
              }
            ]
          },
          "student_trigger": "During call 596019990928, the student expressed uncertainty about managing enrollment timelines: 'Probably not, I'd probably enrol anyway, but I would like to get to those credits' (segment 54). This statement revealed both their willingness to proceed with enrollment and lingering concerns about the credit transfer process. The timing of this trigger was particularly critical as it occurred during discussions about the upcoming intake deadline, presenting an opportunity to address both immediate enrollment needs and longer-term credit considerations.",
          "consultant_response": "The consultant demonstrated strong collaborative planning by immediately addressing both the timeline constraint and credit process: 'Applications for our March intake do close next Wednesday... What you can always do is we can get you enrolled and then you've got March 14th as your census date. So if for whatever reason you're not happy with anything, you can always unenrol.' This response effectively balanced multiple objectives - maintaining enrollment momentum while acknowledging credit transfer importance and providing a safety net through the census date flexibility.",
          "priority": "high",
          "recommended_approach": "When addressing concurrent timeline and credit transfer concerns, consultants should lead with a clear timeline acknowledgment before presenting a flexible path forward. Begin by validating the student's interest in credit transfer while emphasizing the immediate priority of securing their enrollment opportunity: 'I understand getting appropriate credit is important to you, and let's ensure you don't miss out on the upcoming intake while we work through that process.' Present enrollment with flexible withdrawal options as a proactive solution, using specific dates and milestones to create clarity. For instance, explain how the census date provides a clear decision point: 'Enrolling now gives you until March 14th to receive your credit assessment and make a fully informed decision, with no academic or financial penalty if you choose to withdraw.' This approach transforms potential barriers into manageable steps while maintaining momentum. When students express credit transfer interests, always highlight the post-enrollment support available through OES learning advisers who can provide detailed guidance on credit applications and study planning."
        },
        {
          "id": 4,
          "title": "Study Commitment Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595907928836",
              "segment_id": "112",
              "timestamp": "07:45"
            },
            "supporting_calls": [
              {
                "call_id": "595907713051",
                "segment_id": "20",
                "timestamp": "2:15"
              }
            ]
          },
          "student_trigger": "At segment 112, the student expressed significant concern about their ability to maintain long-term commitment: 'So I was concerned that I don't have the commitment to do it for two years.' This statement revealed deep anxiety about the program duration and their capacity to maintain consistent study engagement, presenting a crucial opportunity for collaborative planning around manageable study commitments.",
          "consultant_response": "The interaction failed to adequately address the student's concerns about long-term commitment. Rather than engaging in detailed exploration of how the program could accommodate their concerns, the discussion remained surface-level and missed the opportunity to create a personalized study plan that could have alleviated their anxiety about the two-year commitment.",
          "priority": "high",
          "recommended_approach": "When addressing concerns about long-term study commitment, begin by acknowledging the validity of their concerns: 'It's completely normal to feel uncertain about a two-year commitment. Let's explore how we can make this manageable for you.' Engage in detailed exploration of their current commitments and available study time: 'Could you share what a typical week looks like for you? This will help us identify the best times for study.' Use this information to demonstrate how the program can flex around their life: 'Given your schedule, we could start with a lighter study load in the first teaching period while you establish your routine.' Highlight the program's built-in flexibility features, such as the ability to adjust study load or take breaks between teaching periods. Share specific examples of how other students manage similar challenges: 'Many of our students start with one unit to build confidence, then adjust their study load based on their comfort level.' This approach transforms a daunting long-term commitment into a manageable series of achievable goals."
        },
        {
          "id": 5,
          "title": "Work-Study Integration",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595907713051",
              "segment_id": "20",
              "timestamp": "2:15"
            },
            "supporting_calls": [
              {
                "call_id": "595908104334",
                "segment_id": "23",
                "timestamp": "23:20"
              }
            ]
          },
          "student_trigger": "During segment 20, the student expressed significant concern about managing work and study commitments: 'I just kind of am not too sure like if it would be realistic to like make it work with a full-time job.' This revealed deep uncertainty about their ability to balance professional and educational responsibilities, presenting a critical opportunity for collaborative planning around work-study integration.",
          "consultant_response": "The consultant missed a valuable opportunity to explore flexible study options or demonstrate how other working professionals successfully manage their studies. This gap left the student's concerns about work-study balance unaddressed and potentially affected their confidence in proceeding with enrollment.",
          "priority": "high",
          "recommended_approach": "When addressing work-study balance concerns, begin by acknowledging the common challenge of managing full-time work alongside study: 'Many of our successful students are working professionals like yourself. Let's explore how we can make this work for your specific situation.' Engage in detailed discussion of their work pattern: 'Could you tell me about your typical work week, including any peak periods or regular commitments?' Use this information to demonstrate practical study integration strategies: 'Given your Monday to Friday schedule, many students find success by dedicating specific evening time slots to study, while others prefer focused weekend sessions.' Share specific success stories that resonate with their situation: 'One of our current students in a similar role downloads their weekly materials every Sunday evening and breaks their study into manageable 45-minute sessions during lunch breaks.' Always conclude with clear action steps: 'Let's identify your ideal study times and create a provisional schedule that works around your professional commitments.'"
        },
        {
          "id": 6,
          "title": "Initial Program Exploration",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596253297858",
              "segment_id": "1",
              "timestamp": "0:20"
            },
            "supporting_calls": []
          },
          "student_trigger": "At segment 1, the student initiated contact with specific program interest: 'I just want to know that Munasiru was about dental hygienist course.' This initial inquiry presented an opportunity for meaningful engagement and demonstration of comprehensive support before any necessary transfer.",
          "consultant_response": "The consultant opted for immediate transfer: 'Okay, I'll have to put you through to a different department. I'll just transfer you now, okay?' (segment 3). This response missed the opportunity to establish rapport and demonstrate the institution's commitment to student success through thoughtful handling of their inquiry.",
          "priority": "high",
          "recommended_approach": "When students express program interest, even before necessary transfers, begin with enthusiasm and acknowledgment of their career choice: 'Thank you for your interest in our dental hygienist program - it's an excellent career pathway with strong employment outcomes.' Provide a brief but valuable overview: 'While I connect you with our healthcare specialist who can provide detailed program information, let me share that this program is known for its strong clinical placement opportunities and excellent graduate outcomes. Many of our students secure positions even before completing their studies.' Explain the transfer purpose while maintaining engagement: 'I'm connecting you with our healthcare team who specialize in dental hygiene education. They can provide comprehensive information about professional requirements, course structure, and placement opportunities. Would you like me to share your contact details so they can follow up if we get disconnected?' The key is making every interaction contribute to the student's journey by demonstrating attentiveness to their goals and interest in their success, even during brief interactions that require transfers."
        }
      ]
    }
  }
}