{
  "metadata": {
    "consultant_name": "Michael Bosman",
    "week_number": 16,
    "date_range": "02-10_02-14",
    "report_type": "Collaborative Planning"
  },
  "total_number_of_calls": 263,
  "team_average_total_number_of_calls_per_sales_consultant": 229.8181818181818,
  "number_of_calls_over_2_minutes": {
    "absolute_number": 46,
    "team_average_absolute_number": 46.18181818181818
  },
  "percent_of_calls_over_2_minutes": {
    "percentage": 17.490494296577946,
    "team_average_percentage": 25.638189410827206
  },
  "number_of_calls_under_2_minutes": {
    "absolute_number": 217,
    "team_average_absolute_number": 183.63636363636363
  },
  "percent_of_calls_under_2_minutes": {
    "percentage": 82.50950570342205,
    "team_average_percentage": 65.27090149826371
  },
  "average_talking_percentage": {
    "individual_average": 46.499569611240666,
    "team_average": 56.25193772093511
  },
  "excluded_transcripts": {
    "individual_excluded_transcripts": 217,
    "team_total_excluded_transcripts": 2021
  },
  "behavioral_scores": [
    {
      "label": "week-12_01-13_01-17",
      "average_final_ranking_score_eligible_transcripts": 137.85,
      "average_final_ranking_score_all_transcripts_over_2_mins": 102.31,
      "team_average_final_ranking_score_eligible_transcripts": 149.51,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 99.85
    },
    {
      "label": "week-13_01-20_01-24",
      "average_final_ranking_score_eligible_transcripts": 118.58,
      "average_final_ranking_score_all_transcripts_over_2_mins": 105.65,
      "team_average_final_ranking_score_eligible_transcripts": 139.49,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 104.47
    },
    {
      "label": "week-14_01-27_01-31",
      "average_final_ranking_score_eligible_transcripts": 117.24,
      "average_final_ranking_score_all_transcripts_over_2_mins": 117.25,
      "team_average_final_ranking_score_eligible_transcripts": 123.13,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 97.01
    },
    {
      "label": "week-15_02-03_02-07",
      "average_final_ranking_score_eligible_transcripts": 132.35,
      "average_final_ranking_score_all_transcripts_over_2_mins": 100.1,
      "team_average_final_ranking_score_eligible_transcripts": 154.42,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 102.61
    },
    {
      "label": "week-16_02-10_02-14",
      "average_final_ranking_score_eligible_transcripts": 155.52,
      "average_final_ranking_score_all_transcripts_over_2_mins": 103.07,
      "team_average_final_ranking_score_eligible_transcripts": 133.34,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 101.14
    }
  ],
  "themes": {
    "positive": [
      {
        "headline": "Strategic Pathway Planning",
        "explanation": "Consultants effectively create personalized educational pathways that balance immediate constraints with long-term career aspirations while maintaining enrollment momentum"
      },
      {
        "headline": "Flexible Study Integration",
        "explanation": "Strong demonstration of how program flexibility accommodates working professionals through practical solutions and personalized study planning approaches"
      },
      {
        "headline": "Proactive Leadership Engagement",
        "explanation": "Clear and supportive approach to connecting students with academic leadership while creating meaningful opportunities for program exploration and support planning"
      }
    ],
    "improvement": [
      {
        "headline": "Career Transition Support",
        "explanation": "Enhanced exploration needed of how program elements specifically support career change goals, particularly for mature students seeking significant transitions"
      },
      {
        "headline": "Academic Confidence Building",
        "explanation": "More comprehensive support needed for students returning to education after extended breaks through validation and practical guidance"
      },
      {
        "headline": "Financial Planning Integration",
        "explanation": "Deeper collaborative planning required around financial pathways and support options during enrollment discussions, including comprehensive FEE-HELP guidance"
      }
    ]
  },
  "conversation_analysis": {
    "condensed": {
      "conversations": [
        {
          "id": 1,
          "title": "Strategic Career Pathway Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596178600256",
              "segment_id": "15",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732493616",
                "segment_id": "242",
                "timestamp": "34:45"
              }
            ]
          },
          "student_trigger": "Student stated: 'I graduated from Monash's MD program in 2023, currently working as a doctor, and I wouldn't mind taking like a part-time work year to study a Master of Public Health' (call_596178600256, seg_15), revealing specific career advancement goals.",
          "consultant_response": "Consultant validated career goals: 'Becoming an MD, obviously, very skilful in its own regard, but then when the business knowledge comes into it, having that extra avenue definitely as another piece to the Swiss Army knife that is a doctor' (call_596178600256, seg_21).",
          "context_impact": "Required clear demonstration of how program could enhance existing medical career while accommodating work schedule.",
          "recommended_approach": "Include more specific examples of how current medical professionals have integrated the program into their careers."
        },
        {
          "id": 2,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "Student expressed: 'I work rotating shifts at the hospital, not sure how I'll manage study' (call_595732493616, seg_23), revealing critical need for flexibility demonstration.",
          "consultant_response": "Consultant provided practical solution: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24).",
          "context_impact": "Required clear demonstration of how program design accommodates healthcare shift workers to maintain enrollment momentum.",
          "recommended_approach": "Include more specific examples of successful study patterns from current healthcare students."
        },
        {
          "id": 3,
          "title": "Career Change Support",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596179331117",
              "segment_id": "1",
              "timestamp": "00:10"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student shared: 'Hi Michael, I'm looking at a late-in-life career change and I'm looking at psychiatry' (call_596179331117, seg_1), seeking career transition guidance.",
          "consultant_response": "Consultant simply stated: 'Okay, so we do psychology online and I'm only the online consultant, I'm afraid, so I need to transfer you' (call_596179331117, seg_11).",
          "context_impact": "Critical opportunity to explore career transition pathway and demonstrate comprehensive program support.",
          "recommended_approach": "Explore student's career transition goals before transfer and outline potential pathway options with specific support mechanisms."
        },
        {
          "id": 4,
          "title": "Academic Readiness Support",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596179126335",
              "segment_id": "6",
              "timestamp": "01:15"
            },
            "supporting_calls": [
              {
                "call_id": "596179126335",
                "segment_id": "9",
                "timestamp": "01:45"
              }
            ]
          },
          "student_trigger": "Student expressed: 'I haven't studied for 15 years - I'm worried I won't be able to keep up' (call_596179126335, seg_6), revealing anxiety about academic readiness.",
          "consultant_response": "Consultant provided minimal response: 'Oh, okay. So yeah, looking to get started and get your head stuck into it now' (call_596179126335, seg_9).",
          "context_impact": "Required collaborative exploration of support systems and study strategies to build confidence.",
          "recommended_approach": "Implement more thorough discussion of academic support services and success strategies for returning students."
        },
        {
          "id": 5,
          "title": "Financial Support Discussion",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596267960615",
              "segment_id": "50",
              "timestamp": "6:43"
            },
            "supporting_calls": [
              {
                "call_id": "596013330163",
                "segment_id": "57",
                "timestamp": "05:30"
              }
            ]
          },
          "student_trigger": "Student asked: 'Is this Commonwealth supported, this program, or no?' (call_596013330163, seg_57), showing critical need for financial planning guidance.",
          "consultant_response": "Consultant provided basic response: 'So there's no Commonwealth supported places, however we do offer fee help to any Australian citizens' (call_596013330163, seg_58).",
          "context_impact": "This moment required comprehensive exploration of financial pathways to maintain enrollment momentum.",
          "recommended_approach": "Develop more comprehensive discussion of financial options and support mechanisms available to students."
        },
        {
          "id": 6,
          "title": "Strategic Leadership Engagement",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596091527468",
              "segment_id": "48",
              "timestamp": "03:05"
            },
            "supporting_calls": []
          },
          "student_trigger": "Consultant introduced: 'Our course coordinator likes to just have a little check-in, see what you're looking to get out of the course' (call_596091527468, seg_48).",
          "consultant_response": "Consultant effectively positioned course director meeting as collaborative opportunity: 'you in turn can ask him what the course is about and what it can offer you'.",
          "context_impact": "Proactive connection to academic leadership enhances program value proposition and support structure.",
          "recommended_approach": "Could gather specific topics student wants to discuss with course director to enhance meeting value."
        }
      ]
    },
    "verbose": {
      "conversations": [
        {
          "id": 1,
          "title": "Strategic Career Pathway Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596178600256",
              "segment_id": "15",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732493616",
                "segment_id": "242",
                "timestamp": "34:45"
              }
            ]
          },
          "student_trigger": "During a key moment in call 596178600256 (segment 15), the student articulated their professional context and aspirations: 'I graduated from Monash's MD program in 2023, currently working as a doctor, and I wouldn't mind taking like a part-time work year to study a Master of Public Health.' This statement revealed both their current career status and strategic thinking about professional development through additional education. Similar career planning needs were expressed in supporting calls, demonstrating a consistent pattern of students seeking to align educational pathways with professional goals.",
          "consultant_response": "The consultant demonstrated strong collaborative planning skills by responding: 'Becoming an MD, obviously, very skilful in its own regard, but then when the business knowledge comes into it, having that extra avenue definitely as another piece to the Swiss Army knife that is a doctor.' This response effectively validated the student's existing qualifications while positioning the additional education as a strategic career enhancement. The consultant's metaphor of the 'Swiss Army knife' resonated particularly well, helping the student envision how the program would complement their current expertise.",
          "priority": "high",
          "recommended_approach": "When engaging with professionals seeking additional qualifications, begin by acknowledging their existing expertise and then create explicit connections between their career goals and program benefits. Start with validation: 'Your medical background provides an excellent foundation - let's explore how this program can enhance your current practice.' Then guide the discussion toward specific career impacts: 'Many of our medical students find the public health knowledge directly applicable to their clinical decision-making.' Use concrete examples from similar professionals: 'One of our recent medical graduates now leads public health initiatives in their hospital, directly applying concepts from the program.' The key is demonstrating how the program complements their existing expertise while opening new career possibilities. Always maintain focus on their specific professional context and aspirations, showing how course elements align with their career development goals."
        },
        {
          "id": 2,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "Students across multiple calls expressed concerns about managing study with professional commitments, exemplified by statements like 'I work rotating shifts at the hospital, not sure how I'll manage study' (call_595732493616, seg_23). These moments revealed critical needs for demonstrating program flexibility and practical study integration strategies.",
          "consultant_response": "Consultants effectively demonstrated understanding of professional constraints while offering practical solutions: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24). This approach successfully transformed perceived barriers into manageable planning opportunities.",
          "priority": "high",
          "recommended_approach": "When addressing study integration concerns, start by validating the unique challenges of their work pattern before demonstrating specific solutions. Begin with acknowledgment: 'Healthcare shift work presents unique challenges - let's explore how our program flexibility can work for your schedule.' Share concrete examples: 'Many of our nursing students download materials for offline study during night shifts, use quiet periods for focused reading, and complete discussions during recovery days.' Draw from success stories: 'One current student manages their rotating roster by planning their study in flexible blocks that adapt to their schedule changes.' The key is making flexibility tangible through specific, relevant examples while maintaining focus on their professional context. Always ensure to highlight both technological solutions (like offline access) and strategic approaches to study planning."
        },
        {
          "id": 3,
          "title": "Career Change Support",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596179331117",
              "segment_id": "1",
              "timestamp": "00:10"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student opened the conversation with a significant disclosure: 'Hi Michael, I'm looking at a late-in-life career change and I'm looking at psychiatry' (call_596179331117, seg_1). This statement revealed both career aspiration and potential vulnerability about transitioning later in life, presenting a crucial opportunity for supportive guidance.",
          "consultant_response": "The consultant's response was procedural rather than exploratory: 'Okay, so we do psychology online and I'm only the online consultant, I'm afraid, so I need to transfer you' (call_596179331117, seg_11). While accurate regarding process, this missed the opportunity to engage with the student's career change aspirations and demonstrate program value before transfer.",
          "priority": "high",
          "recommended_approach": "When engaging with career change inquiries, particularly from mature students, begin by celebrating their initiative while acknowledging the significance of their decision. Start with validation: 'Making a career change takes courage, and it's impressive that you're exploring pathways into psychiatry.' Before any procedural discussions, explore their motivations: 'Could you tell me what drew you to psychiatry? Understanding your goals will help us identify the best pathway for you.' Even when a transfer is necessary, first provide value by explaining relevant program features: 'While I'll connect you with our psychiatry specialist, let me share how our psychology programs support career transitions.' Address any concerns about studying later in life: 'Many of our most successful students bring valuable life and work experience to their studies.' When discussing program options, focus on how specific elements support career change: 'Our flexible study options and professional development support are particularly valuable for career changers.' Throughout the conversation, maintain focus on building confidence while setting realistic expectations about the transition journey."
        },
        {
          "id": 4,
          "title": "Academic Readiness Support",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596179126335",
              "segment_id": "6",
              "timestamp": "01:15"
            },
            "supporting_calls": [
              {
                "call_id": "596179126335",
                "segment_id": "9",
                "timestamp": "01:45"
              }
            ]
          },
          "student_trigger": "Students returning to study after extended breaks expressed significant anxiety about academic readiness, exemplified by statements like 'I haven't studied for 15 years - I'm worried I won't be able to keep up' (call_596179126335, seg_6). These moments required careful validation and support planning to build confidence.",
          "consultant_response": "Consultants often provided minimal responses that failed to address underlying concerns, as seen in replies like 'Oh, okay. So yeah, looking to get started and get your head stuck into it now' (call_596179126335, seg_9). These responses missed opportunities for meaningful support planning.",
          "priority": "high",
          "recommended_approach": "When addressing academic readiness concerns, begin by validating their apprehension while highlighting how their professional experience can be an advantage. Start with empathetic acknowledgment: 'Many successful students return to study after similar breaks - your professional experience often provides valuable real-world context for academic concepts.' Then explore specific concerns: 'Let's identify areas where you'd like additional support so we can connect you with the right resources.' Share success stories: 'One recent graduate returned after 20 years away and found our academic skills workshops particularly helpful, especially combined with their industry experience.' The key is transforming their perceived disadvantage into a potential strength while building confidence through concrete support mechanisms. Always ensure to highlight specific resources like study skills support, academic writing assistance, and peer mentoring opportunities."
        },
        {
          "id": 5,
          "title": "Financial Support Discussion",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596267960615",
              "segment_id": "50",
              "timestamp": "6:43"
            },
            "supporting_calls": [
              {
                "call_id": "596013330163",
                "segment_id": "57",
                "timestamp": "05:30"
              }
            ]
          },
          "student_trigger": "Students across multiple calls expressed need for financial clarity, exemplified by direct questions like 'Is this Commonwealth supported, this program, or no?' (call_596013330163, seg_57). These inquiries represented critical moments requiring comprehensive financial planning support to maintain enrollment momentum.",
          "consultant_response": "Consultants typically provided basic information without deeper exploration, as seen in responses like 'So there's no Commonwealth supported places, however we do offer fee help to any Australian citizens' (call_596013330163, seg_58). While factually accurate, these responses missed opportunities for collaborative financial planning.",
          "priority": "high",
          "recommended_approach": "Transform financial discussions from simple information delivery into collaborative planning opportunities. Begin with validation: 'Understanding the financial aspects is crucial for your planning - let's explore all available options together.' Guide students through comprehensive financial planning: 'While this isn't Commonwealth supported, we have several financial pathways available. Let me walk you through how FEE-HELP works and other support options.' Share specific examples: 'Many students combine FEE-HELP with flexible study loads to manage their investment. For instance, some start with two units to spread the initial investment.' Always connect financial planning to career benefits: 'Consider how this investment aligns with your career progression - many students find the ROI through career advancement quickly offsets the initial cost.' The goal is to transform financial concerns into manageable planning opportunities while maintaining focus on the long-term value of their educational investment."
        },
        {
          "id": 6,
          "title": "Strategic Leadership Engagement",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596091527468",
              "segment_id": "48",
              "timestamp": "03:05"
            },
            "supporting_calls": []
          },
          "student_trigger": "The consultant proactively introduced academic leadership engagement: 'Our course coordinator likes to just have a little check-in, see what you're looking to get out of the course' (call_596091527468, seg_48). This introduction demonstrated excellent collaborative planning by setting expectations for meaningful academic engagement.",
          "consultant_response": "The consultant effectively positioned the meeting as a two-way dialogue: 'you in turn can ask him what the course is about and what it can offer you.' This approach showed strong collaborative planning by creating a framework for meaningful academic discussion and support planning.",
          "priority": "high",
          "recommended_approach": "When introducing academic leadership meetings, frame them as strategic planning opportunities rather than administrative requirements. Begin by highlighting the unique value: 'This meeting allows you to shape your academic journey directly with our program leaders.' Guide the student in preparation: 'Let's identify key topics you'd like to discuss with the coordinator based on your goals.' Use their responses to enhance meeting value: 'Given your interest in [specific area], you might want to ask about [relevant program features].' Help students prepare thoughtful questions: 'Consider what aspects of your career goals you'd like to explore with them.' Create excitement about the opportunity: 'Many students find this meeting instrumental in clarifying their academic path.' Always follow up with clear next steps: 'I'll note these discussion points for the coordinator, ensuring your time together is focused on your priorities.' This approach transforms a simple check-in into a valuable strategic planning session that enhances student engagement and program alignment."
        }
      ]
    }
  }
}