{
  "metadata": {
    "consultant_name": "Michael Bosman",
    "week_number": 17,
    "date_range": "02-17_02-21",
    "report_type": "Collaborative Planning"
  },
  "total_number_of_calls": 265,
  "team_average_total_number_of_calls_per_sales_consultant": 222.45454545454547,
  "number_of_calls_over_2_minutes": {
    "absolute_number": 42,
    "team_average_absolute_number": 50.09090909090909
  },
  "percent_of_calls_over_2_minutes": {
    "percentage": 15.849056603773585,
    "team_average_percentage": 25.577946405699496
  },
  "number_of_calls_under_2_minutes": {
    "absolute_number": 223,
    "team_average_absolute_number": 172.36363636363637
  },
  "percent_of_calls_under_2_minutes": {
    "percentage": 84.15094339622642,
    "team_average_percentage": 74.42205359430051
  },
  "average_talking_percentage": {
    "individual_average": 54.4547239165766,
    "team_average": 52.737881140105245
  },
  "excluded_transcripts": {
    "individual_excluded_transcripts": 223,
    "team_total_excluded_transcripts": 1896
  },
  "behavioral_scores": [
    {
      "label": "week-12_01-13_01-17",
      "average_final_ranking_score_eligible_transcripts": 137.85,
      "average_final_ranking_score_all_transcripts_over_2_mins": 102.31,
      "team_average_final_ranking_score_eligible_transcripts": 149.51,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 99.85
    },
    {
      "label": "week-13_01-20_01-24",
      "average_final_ranking_score_eligible_transcripts": 118.58,
      "average_final_ranking_score_all_transcripts_over_2_mins": 105.65,
      "team_average_final_ranking_score_eligible_transcripts": 139.49,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 104.47
    },
    {
      "label": "week-14_01-27_01-31",
      "average_final_ranking_score_eligible_transcripts": 117.24,
      "average_final_ranking_score_all_transcripts_over_2_mins": 117.25,
      "team_average_final_ranking_score_eligible_transcripts": 123.13,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 97.01
    },
    {
      "label": "week-15_02-03_02-07",
      "average_final_ranking_score_eligible_transcripts": 132.35,
      "average_final_ranking_score_all_transcripts_over_2_mins": 100.1,
      "team_average_final_ranking_score_eligible_transcripts": 154.42,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 102.61
    },
    {
      "label": "week-16_02-10_02-14",
      "average_final_ranking_score_eligible_transcripts": 155.52,
      "average_final_ranking_score_all_transcripts_over_2_mins": 103.07,
      "team_average_final_ranking_score_eligible_transcripts": 133.34,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 101.14
    },
    {
      "label": "week-17_02-17_02-21",
      "average_final_ranking_score_eligible_transcripts": 141.42,
      "average_final_ranking_score_all_transcripts_over_2_mins": 98.59,
      "team_average_final_ranking_score_eligible_transcripts": 124.49,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 93.92
    }
  ],
  "themes": {
    "positive": [
      {
        "headline": "Strategic Pathway Planning",
        "explanation": "Consultants effectively create personalized educational pathways that balance immediate constraints with long-term career aspirations while maintaining enrollment momentum"
      },
      {
        "headline": "Career Integration Excellence",
        "explanation": "Strong demonstration of how program elements support specific career advancement goals through practical examples and clear progression pathways that resonate with professional ambitions"
      },
      {
        "headline": "Proactive Documentation Support",
        "explanation": "Effective guidance through documentation requirements with clear alternatives and support mechanisms while preventing roadblocks and maintaining transparent processes"
      }
    ],
    "improvement": [
      {
        "headline": "Return to Study Confidence",
        "explanation": "More comprehensive support needed for students returning to education after extended breaks with specific strategies, success stories and practical transition resources"
      },
      {
        "headline": "Alternative Pathway Exploration",
        "explanation": "Enhanced discussion needed of qualification routes and bridge programs when direct entry requirements aren't met, including clear progression timelines"
      },
      {
        "headline": "Process Streamlining",
        "explanation": "Clearer upfront planning required to prevent repeated documentation requests and create transparent enrollment processes with defined dependencies"
      }
    ]
  },
  "conversation_analysis": {
    "condensed": {
      "conversations": [
        {
          "id": 1,
          "title": "Career-Focused MBA Planning",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596689386622",
              "segment_id": "28",
              "timestamp": "02:25"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'I've just taken on a new role at Victoria Police as the Facilities Manager for one of the buildings and regions and I just have noticed that to further my career here I probably need an MBA' (call_596689386622, seg_28), revealing clear career advancement motivation.",
          "consultant_response": "Consultant effectively replied: 'Take on that new role and then, yeah, thought about it in the past but now you're probably looking at that glass ceiling needing that MBA sledgehammer to get through it' (call_596689386622, seg_38), powerfully illustrating MBA's career impact.",
          "context_impact": "Critical moment to demonstrate how MBA program specifically supports career progression in facilities management leadership.",
          "recommended_approach": "Include specific examples of how current MBA students in facilities management have advanced their careers through program completion."
        },
        {
          "id": 2,
          "title": "Return to Study Support",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596616942808",
              "segment_id": "63",
              "timestamp": "5:20"
            },
            "supporting_calls": [
              {
                "call_id": "596616942808",
                "segment_id": "64",
                "timestamp": "5:30"
              }
            ]
          },
          "student_trigger": "Student expressed: 'I haven't studied for 15 years - I'm worried I won't be able to keep up' (call_596616942808, seg_63), revealing significant anxiety about academic readiness.",
          "consultant_response": "Consultant briefly acknowledged: 'Yeah, that's a common concern. Let's get through these details first.' (call_596616942808, seg_64)",
          "context_impact": "Critical moment to address anxiety about returning to study and demonstrate available support mechanisms.",
          "recommended_approach": "Explore concerns deeper and highlight specific support mechanisms available for returning students with concrete examples of success stories."
        },
        {
          "id": 3,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596555484091",
              "segment_id": "23",
              "timestamp": "5:45"
            },
            "supporting_calls": [
              {
                "call_id": "596688963810",
                "segment_id": "15",
                "timestamp": "03:15"
              }
            ]
          },
          "student_trigger": "Student expressed: 'I want to advance my career but I'm worried about balancing study with my current role' (call_596555484091, seg_23), revealing critical need for work-study balance solutions.",
          "consultant_response": "Consultant provided practical solution: 'We host them outside of work hours, so usually starting somewhere between 6 to 8 pm and usually running from an hour to two hours once per week' (call_596555484091, seg_115), effectively showing real-world flexibility.",
          "context_impact": "This moment required clear demonstration of how program flexibility specifically accommodates working professionals to maintain enrollment momentum.",
          "recommended_approach": "Include more specific examples of successful study patterns from current working professionals and detailed flexibility options."
        },
        {
          "id": 4,
          "title": "Documentation Process Improvement",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596412883872",
              "segment_id": "25",
              "timestamp": "22:05"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed: 'It just seems like every time I provided what was asked for, I was asked for something else, which is incredibly frustrating' (call_596412883872, seg_25), revealing systemic issues in documentation requirements.",
          "consultant_response": "Consultant stated: 'I do apologise about that. What I can do is I can draft up an email for you and put everything you need in there' (call_596412883872, seg_27).",
          "context_impact": "Opportunity to transform negative experience into positive engagement through improved planning and transparency.",
          "recommended_approach": "Create comprehensive document planning system with clear dependencies and requirements explained upfront to prevent repeated requests."
        },
        {
          "id": 5,
          "title": "Masters Pathway Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596413471663",
              "segment_id": "11",
              "timestamp": "01:23"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'I had some questions about, so like course entry requirements and such for entering the Masters in Project Management' (call_596413471663, seg_11), revealing uncertainty about qualification pathways.",
          "consultant_response": "Consultant provided clear direction: 'So I'll just let you know this Masters is still a ways off for you...finishing that Certificate IV or skipping even that Advanced Diploma and then going straight into a Bachelor might be your best move' (call_596413471663, seg_27).",
          "context_impact": "Clear guidance on entry requirements and progression pathways was crucial for maintaining student engagement and confidence.",
          "recommended_approach": "Include more specific examples of successful progression pathways with detailed timeline estimates and credit recognition options."
        },
        {
          "id": 6,
          "title": "Alternative Pathway Exploration",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596549439520",
              "segment_id": "25",
              "timestamp": "03:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student revealed: 'Well, I've not, I've done an advanced dip but no' (call_596549439520, seg_25), indicating insufficient qualifications for direct entry.",
          "consultant_response": "Consultant stated: 'So this course would not be available to you... I don't deal with those courses' (call_596549439520, seg_27), missing opportunity to explore alternatives.",
          "context_impact": "Critical moment to provide alternative pathways to maintain student engagement and demonstrate possible routes to desired qualification.",
          "recommended_approach": "Provide high-level overview of alternative pathways and bridge programs available with clear progression timelines and success stories."
        }
      ]
    },
    "verbose": {
      "conversations": [
        {
          "id": 1,
          "title": "Career-Focused MBA Planning",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596689386622",
              "segment_id": "28",
              "timestamp": "02:25"
            },
            "supporting_calls": []
          },
          "student_trigger": "During call 596689386622 (segment 28), the student revealed clear career advancement motivation, stating: 'I've just taken on a new role at Victoria Police as the Facilities Manager for one of the buildings and regions and I just have noticed that to further my career here I probably need an MBA.' This disclosure demonstrated both professional ambition and recognition of the MBA's potential value in their career progression.",
          "consultant_response": "The consultant demonstrated strong collaborative planning by effectively connecting the MBA to career advancement, responding: 'Take on that new role and then, yeah, thought about it in the past but now you're probably looking at that glass ceiling needing that MBA sledgehammer to get through it' (segment 38). This metaphorical approach powerfully illustrated the MBA's potential impact while validating the student's career aspirations.",
          "priority": "high",
          "recommended_approach": "When engaging with career-focused professionals, begin by validating their current role achievements before exploring how the MBA can accelerate their career trajectory. Frame the discussion around specific career advancement opportunities: 'Your facilities management experience provides an excellent foundation. Let's explore how our MBA can help you leverage that experience for senior leadership roles.' Share relevant examples of how current students in similar roles have advanced their careers through the program: 'Many of our facilities management students find the strategic management units particularly valuable for advancing to executive positions.' Always maintain appropriate boundaries by focusing on program benefits rather than specific career advice. Pay particular attention to connecting program elements with workplace challenges: 'Our operations management unit often helps facilities managers enhance their strategic planning capabilities.' Remember to emphasize both immediate and long-term career benefits while keeping the discussion focused on educational pathways rather than detailed career planning."
        },
        {
          "id": 2,
          "title": "Return to Study Support",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596616942808",
              "segment_id": "63",
              "timestamp": "5:20"
            },
            "supporting_calls": [
              {
                "call_id": "596616942808",
                "segment_id": "64",
                "timestamp": "5:30"
              }
            ]
          },
          "student_trigger": "In call 596616942808 (segment 63), the student voiced significant anxiety about returning to academic life: 'I haven't studied for 15 years - I'm worried I won't be able to keep up.' This concern revealed deep-seated fears about academic readiness and need for support in transitioning back to study. Similar concerns emerged across multiple calls, indicating a common barrier for returning students.",
          "consultant_response": "The consultant's response was minimal and deflective: 'Yeah, that's a common concern. Let's get through these details first.' (segment 64). This approach missed the opportunity to address the student's anxiety meaningfully and showcase available support systems. The brief acknowledgment without exploration of concerns or support mechanisms left the student's fears unaddressed.",
          "priority": "high",
          "recommended_approach": "When students express concerns about returning to study after a long break, acknowledge these feelings as valid while emphasizing our robust support systems. Begin with validation: 'Many successful students share similar concerns when returning to study - let me show you how we help them thrive.' Then explore specific concerns: 'What aspects of returning to study concern you most?' Share concrete support examples: 'Our online learning platform includes specialized tools for returning students, such as academic writing refreshers and time management resources.' Highlight flexible learning options: 'You can access study materials 24/7 and pace your learning to match your comfort level.' Describe support services: 'Our academic skills team offers one-on-one guidance, and our student mentoring program connects you with successful returning students.' Use success stories: 'One recent graduate returned after 20 years and found our structured support made the transition manageable.' The key is transforming anxiety into confidence by showing clear pathways to success through specific, accessible support mechanisms."
        },
        {
          "id": 3,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596555484091",
              "segment_id": "23",
              "timestamp": "5:45"
            },
            "supporting_calls": [
              {
                "call_id": "596688963810",
                "segment_id": "15",
                "timestamp": "03:15"
              }
            ]
          },
          "student_trigger": "During call 596555484091 (segment 23), the student expressed concern about balancing commitments: 'I want to advance my career but I'm worried about balancing study with my current role.' This revealed both career ambition and practical concerns about managing work-study integration. Similar concerns emerged in supporting calls, indicating a common need for clear flexibility solutions.",
          "consultant_response": "The consultant effectively demonstrated program flexibility by sharing specific scheduling options: 'We host them outside of work hours, so usually starting somewhere between 6 to 8 pm and usually running from an hour to two hours once per week' (segment 115). This practical example helped students visualize how study could fit into their work schedule while maintaining career momentum.",
          "priority": "high",
          "recommended_approach": "When addressing work-study balance concerns, start by acknowledging both career ambitions and practical scheduling needs. Begin with validation: 'Your commitment to career advancement while maintaining work performance shows great initiative. Let me show you how our program is designed for working professionals.' Share specific scheduling examples: 'Many of our current students attend evening sessions from 6-8pm, accessing recordings when work runs late.' Demonstrate flexibility options: 'You can download materials for offline study during breaks, participate in discussions at convenient times, and schedule assessments around work commitments.' Use success stories: 'A current student in a similar role downloads weekly materials Sunday evening, completes readings during lunch breaks, and participates in online discussions between meetings.' Remember to emphasize how specific program features support work-study integration while maintaining focus on career advancement goals."
        },
        {
          "id": 4,
          "title": "Documentation Process Improvement",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596412883872",
              "segment_id": "25",
              "timestamp": "22:05"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student expressed significant frustration with the documentation process: 'It just seems like every time I provided what was asked for, I was asked for something else, which is incredibly frustrating' (call_596412883872, seg_25). This revealed systemic issues in the documentation process that needed immediate attention.",
          "consultant_response": "The consultant offered a basic apology and solution: 'I do apologise about that. What I can do is I can draft up an email for you and put everything you need in there' (segment 27). While this showed accountability, it didn't fully address the systemic issues or prevent similar problems in the future.",
          "priority": "high",
          "recommended_approach": "When addressing process frustrations, begin by acknowledging the student's experience while demonstrating commitment to improvement. Start with genuine empathy: 'I completely understand your frustration with having to provide additional documents repeatedly. Let's ensure this doesn't happen again.' Create a comprehensive solution: 'I'll create a complete checklist of everything needed for your enrollment, including any potential additional requirements based on your initial submissions.' Guide students through the complete process: 'Let me explain why each document is needed and how they work together for your application.' Pay special attention to dependencies between requirements: 'Sometimes your initial documents might indicate a need for additional verification - let me explain when this might happen.' Always maintain transparency about the process while focusing on moving forward: 'Here's exactly what we need and why, so you can gather everything at once.' Remember to provide clear timelines and expectations while ensuring students understand how each requirement contributes to their enrollment success."
        },
        {
          "id": 5,
          "title": "Masters Pathway Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596413471663",
              "segment_id": "11",
              "timestamp": "01:23"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student sought clarity on advanced program requirements: 'I had some questions about, so like course entry requirements and such for entering the Masters in Project Management' (call_596413471663, seg_11). This inquiry revealed both interest in advanced education and uncertainty about qualification requirements, presenting a crucial opportunity for collaborative planning.",
          "consultant_response": "The consultant demonstrated strong pathway planning by providing clear direction: 'So I'll just let you know this Masters is still a ways off for you...finishing that Certificate IV or skipping even that Advanced Diploma and then going straight into a Bachelor might be your best move' (segment 27). This response effectively acknowledged aspirations while providing realistic guidance on progression options.",
          "priority": "high",
          "recommended_approach": "When discussing advanced program requirements, begin by validating the student's aspirations while providing clear pathways. Start with recognition: 'I appreciate your interest in the Masters program - let's explore the best path to help you achieve this goal.' Map out potential routes clearly: 'There are several pathways to Masters qualification, from progressing through a Bachelor's degree to leveraging professional experience.' Share specific examples: 'Many successful Masters students start with a Certificate IV, using credit recognition to accelerate their Bachelor's completion.' Highlight key milestones: 'As you progress through your Bachelor's, maintaining a credit average will position you well for Masters entry.' Always emphasize support throughout the journey: 'Our academic advisors help students at each transition point, ensuring you're well-prepared for the next level.' Remember to maintain momentum by breaking down the pathway into manageable steps while keeping the end goal in focus."
        },
        {
          "id": 6,
          "title": "Alternative Pathway Exploration",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596549439520",
              "segment_id": "25",
              "timestamp": "03:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "A crucial moment occurred when the student disclosed their educational background: 'Well, I've not, I've done an advanced dip but no' (call_596549439520, seg_25). This revelation of insufficient qualifications for direct entry represented a critical juncture requiring guidance toward alternative pathways.",
          "consultant_response": "The consultant's response was insufficient: 'So this course would not be available to you... I don't deal with those courses' (segment 27). This approach missed the opportunity to explore alternative pathways or bridge programs that could help the student achieve their educational goals.",
          "priority": "high",
          "recommended_approach": "When students don't meet direct entry requirements, transform potential barriers into alternative pathways. Begin with acknowledgment: 'Thank you for sharing your educational background. While direct entry isn't available, let me show you some alternative pathways.' Then outline available options: 'Many students with advanced diplomas successfully transition through our bridge programs.' Create a clear vision of progression: 'We can explore how your advanced diploma credits might apply to a bridging qualification.' Guide the discussion toward achievable goals: 'Let's look at how your work experience combined with your advanced diploma could create a pathway forward.' Pay special attention to maintaining momentum by focusing on possibilities rather than limitations: 'Our learning advisors have helped many students in similar situations find successful pathways to their desired program.' Always conclude with clear next steps and available support resources, ensuring students understand their options for achieving their educational goals."
        }
      ]
    }
  }
}