{
  "metadata": {
    "consultant_name": "Michael Kiag",
    "week_number": 17,
    "date_range": "02-17_02-21",
    "report_type": "Collaborative Planning"
  },
  "total_number_of_calls": 281,
  "team_average_total_number_of_calls_per_sales_consultant": 239.125,
  "number_of_calls_over_2_minutes": {
    "absolute_number": 90,
    "team_average_absolute_number": 68.875
  },
  "percent_of_calls_over_2_minutes": {
    "percentage": 32.028469750889684,
    "team_average_percentage": 29.051225325524136
  },
  "number_of_calls_under_2_minutes": {
    "absolute_number": 191,
    "team_average_absolute_number": 170.25
  },
  "percent_of_calls_under_2_minutes": {
    "percentage": 67.97153024911033,
    "team_average_percentage": 70.94877467447586
  },
  "average_talking_percentage": {
    "individual_average": 48.18489425260641,
    "team_average": 53.02123725908919
  },
  "excluded_transcripts": {
    "individual_excluded_transcripts": 191,
    "team_total_excluded_transcripts": 2724
  },
  "behavioral_scores": [
    {
      "label": "week-12_01-13_01-17",
      "average_final_ranking_score_eligible_transcripts": 114.81,
      "average_final_ranking_score_all_transcripts_over_2_mins": 81.9,
      "team_average_final_ranking_score_eligible_transcripts": 157.75,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 113.37
    },
    {
      "label": "week-13_01-20_01-24",
      "average_final_ranking_score_eligible_transcripts": 136.47,
      "average_final_ranking_score_all_transcripts_over_2_mins": 87.88,
      "team_average_final_ranking_score_eligible_transcripts": 162.74,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 120.37
    },
    {
      "label": "week-14_01-27_01-31",
      "average_final_ranking_score_eligible_transcripts": 138.59,
      "average_final_ranking_score_all_transcripts_over_2_mins": 108.77,
      "team_average_final_ranking_score_eligible_transcripts": 155.43,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 112.46
    },
    {
      "label": "week-15_02-03_02-07",
      "average_final_ranking_score_eligible_transcripts": 108.15,
      "average_final_ranking_score_all_transcripts_over_2_mins": 87.91,
      "team_average_final_ranking_score_eligible_transcripts": 157.11,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 113.21
    },
    {
      "label": "week-16_02-10_02-14",
      "average_final_ranking_score_eligible_transcripts": 132.0,
      "average_final_ranking_score_all_transcripts_over_2_mins": 87.67,
      "team_average_final_ranking_score_eligible_transcripts": 163.3,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 109.25
    },
    {
      "label": "week-17_02-17_02-21",
      "average_final_ranking_score_eligible_transcripts": 129.12,
      "average_final_ranking_score_all_transcripts_over_2_mins": 100.08,
      "team_average_final_ranking_score_eligible_transcripts": 148.21,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 109.77
    }
  ],
  "themes": {
    "positive": [
      {
        "headline": "Strategic Pathway Planning",
        "explanation": "Consultants effectively create personalized educational pathways that balance immediate constraints with long-term aspirations while maintaining enrollment momentum through tailored guidance and clear progression options"
      },
      {
        "headline": "Flexible Study Integration",
        "explanation": "Strong demonstration of how program flexibility accommodates diverse student circumstances through practical examples and tailored solutions that directly address individual scheduling needs"
      },
      {
        "headline": "Support System Navigation",
        "explanation": "Clear and proactive guidance through available support mechanisms while maintaining appropriate boundaries between sales and post-enrollment services"
      }
    ],
    "improvement": [
      {
        "headline": "Career Development Integration",
        "explanation": "Enhanced exploration needed of how specific program elements and learning outcomes align with workplace challenges, skill requirements, and career progression goals"
      },
      {
        "headline": "Work-Life Balance Planning",
        "explanation": "More comprehensive exploration needed of how study commitments can be integrated with existing work and family responsibilities through concrete examples and practical strategies"
      },
      {
        "headline": "International Student Support",
        "explanation": "Greater guidance needed for international students regarding study pathway planning and available support services while maintaining appropriate boundaries around visa advice"
      }
    ]
  },
  "conversation_analysis": {
    "condensed": {
      "conversations": [
        {
          "id": 1,
          "title": "Strategic Pathway Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596343545676",
              "segment_id": "18",
              "timestamp": "01:35"
            },
            "supporting_calls": [
              {
                "call_id": "596464790981",
                "segment_id": "94",
                "timestamp": "16:02"
              }
            ]
          },
          "student_trigger": "Student stated: 'Just regarding how my application, just more advice on what I could do moving forward to actually get into like the.' (call_596343545676, seg_18), revealing uncertainty about program entry requirements and pathway options.",
          "consultant_response": "Consultant explained: 'Yeah so look to get into law it's not the easiest course to get into from an academic perspective but we do have a pathway for you okay.' (call_596343545676, seg_22), effectively presenting structured path forward while acknowledging challenges.",
          "context_impact": "Critical moment to demonstrate clear pathway planning and boost student confidence in the application process through structured guidance.",
          "recommended_approach": "Include more specific examples of successful pathway transitions with clear timelines and milestones while maintaining appropriate level of detail."
        },
        {
          "id": 2,
          "title": "Work-Life Balance Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596343271046",
              "segment_id": "35",
              "timestamp": "03:17"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'I'm currently working full-time, I've got a couple of kids and I'm just trying to work out where I guess how this could, I guess, be incorporated within my life' (call_596343271046, seg_35), revealing significant uncertainty about managing multiple commitments.",
          "consultant_response": "Consultant replied: 'Yeah, cool. I'll answer that one first. There's 32 units of study in the course...' (call_596343271046, seg_50), missing opportunity to explore personalized study integration strategies.",
          "context_impact": "Critical moment requiring demonstration of how program flexibility specifically accommodates complex life commitments through practical solutions.",
          "recommended_approach": "Address work-life balance concerns directly with specific examples of successful study integration strategies from similar students, including practical time management approaches."
        },
        {
          "id": 3,
          "title": "Prior Learning Recognition",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596462071083",
              "segment_id": "36",
              "timestamp": "05:30"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student asked: 'I think you're also looking for some information about getting recognition of prior learning, is that correct?' (call_596462071083, seg_23), seeking to understand credit possibilities and pathway optimization.",
          "consultant_response": "Consultant provided solution: 'We would be able to give you the eight elected units of study in our business degree as credit from using that marine engineering degree' (call_596462071083, seg_36), effectively showing tangible benefits.",
          "context_impact": "Clear credit recognition pathways directly influence enrollment likelihood by demonstrating program efficiency and validating prior achievements.",
          "recommended_approach": "Include more specific detail about credit assessment process timeline, documentation requirements, and typical credit patterns for similar qualifications."
        },
        {
          "id": 4,
          "title": "Health-Conscious Study Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596689129763",
              "segment_id": "23",
              "timestamp": "03:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed: 'I've got some health issues that have cropped up which is sort of making it a bit chance' (call_596689129763, seg_23), revealing need for flexible study options while maintaining academic progress.",
          "consultant_response": "Consultant suggested flexible pathway: 'Not towards the grad dip, but you may want to consider a Bachelor of Psychology because of that RPL reasons' (call_596689129763, seg_38), showing sensitivity while maintaining academic focus.",
          "context_impact": "Addressing health-related study concerns directly impacts enrollment confidence and perceived program feasibility through demonstrated flexibility.",
          "recommended_approach": "Provide more specific examples of flexible study options, available support resources, and how other students successfully manage similar circumstances."
        },
        {
          "id": 5,
          "title": "International Student Support",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596462071083",
              "segment_id": "55",
              "timestamp": "09:45"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'I'm just visiting here, I just accompanied my son who is into university' (call_596462071083, seg_50), revealing international student status and need for specialized guidance.",
          "consultant_response": "Consultant focused only on documentation: 'I will also need a copy of your visa as well, just to ensure that we can actually enroll you' (call_596462071083, seg_55), missing opportunity for comprehensive support discussion.",
          "context_impact": "Clear understanding of visa implications and available support critical for enrollment feasibility and pathway planning.",
          "recommended_approach": "Provide comprehensive guidance about study options, support services, and program features specifically relevant to international students while maintaining appropriate boundaries."
        },
        {
          "id": 6,
          "title": "Study Load Flexibility",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596465208842",
              "segment_id": "54",
              "timestamp": "54:00"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student asked: 'Yeah, which is what, how many units a trimester' (call_596465208842, seg_54), seeking clarity on study load structure and management options.",
          "consultant_response": "Consultant explained options: 'Well I mean it's eight units per year... typically what most of our students will do is they'll take two subjects in the first trimester' (call_596465208842, seg_56), effectively balancing structure with flexibility.",
          "context_impact": "Understanding unit structure and flexibility crucial for student confidence in program manageability and long-term success.",
          "recommended_approach": "Include more specific examples of how different study loads align with various work/life scenarios and common patterns of successful students."
        }
      ]
    },
    "verbose": {
      "conversations": [
        {
          "id": 1,
          "title": "Strategic Pathway Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596343545676",
              "segment_id": "18",
              "timestamp": "01:35"
            },
            "supporting_calls": [
              {
                "call_id": "596464790981",
                "segment_id": "94",
                "timestamp": "16:02"
              }
            ]
          },
          "student_trigger": "Multiple students expressed uncertainty about program pathways, exemplified when one stated: 'Just regarding how my application, just more advice on what I could do moving forward to actually get into like the.' (call_596343545676, seg_18). This hesitation revealed a critical need for clear guidance about entry requirements and next steps. Similar concerns emerged across conversations, indicating a common need for structured pathway planning that maintains enrollment momentum while addressing uncertainty.",
          "consultant_response": "Consultants demonstrated varying levels of effectiveness in addressing pathway planning. The strongest example came when a consultant responded: 'Yeah so look to get into law it's not the easiest course to get into from an academic perspective but we do have a pathway for you okay.' (call_596343545676, seg_22). This approach successfully acknowledged potential challenges while immediately presenting solutions, effectively transforming barriers into manageable steps. The consultant used existing documentation to create personalized pathways, significantly increasing student confidence in proceeding.",
          "priority": "high",
          "recommended_approach": "When addressing program pathway inquiries, begin by acknowledging any complexity while immediately highlighting available routes forward. Start with reviewing any existing documentation or qualifications the student has provided, using these as building blocks for their entry strategy. For example, when a student expresses uncertainty about their pathway, respond with clear guidance: 'I understand your goal is to enter our law program. Let's look at your current qualifications and explore the most direct path forward.' Focus on high-level pathway guidance while maintaining clear boundaries around detailed career planning. When discussing alternative entry options, frame them positively: 'The Undergraduate Certificate provides an excellent foundation, with many students successfully transitioning into the full degree program.' Share specific examples: 'One of our current law students started with the certificate, maintained a credit average, and transitioned smoothly into the bachelor program after one trimester.' Always connect pathway discussions to concrete next steps that maintain enrollment momentum: 'Based on your transcript, let's start by submitting your application for the certificate program this week, which positions you well for the law degree transition next year.' The key is transforming uncertainty into confidence through structured, achievable steps while staying within appropriate advisory boundaries."
        },
        {
          "id": 2,
          "title": "Work-Life Balance Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596343271046",
              "segment_id": "35",
              "timestamp": "03:17"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student clearly articulated complex life circumstances requiring careful consideration: 'I'm currently working full-time, I've got a couple of kids and I'm just trying to work out where I guess how this could, I guess, be incorporated within my life' (call_596343271046, seg_35). The repeated use of 'I guess' indicated significant uncertainty about managing multiple commitments alongside study, making this a crucial moment for demonstrating program flexibility and support options.",
          "consultant_response": "The consultant's response failed to adequately address the student's concerns about work-life integration: 'Yeah, cool. I'll answer that one first. There's 32 units of study in the course...' (call_596343271046, seg_50). By focusing immediately on technical course details rather than exploring the student's complex circumstances, the consultant missed an opportunity to demonstrate how the program could accommodate their specific needs.",
          "priority": "high",
          "recommended_approach": "When students express concerns about managing multiple commitments, begin by validating their specific situation and demonstrating understanding of their challenges. Start with acknowledgment: 'Managing full-time work and family responsibilities requires careful planning, and I appreciate you thinking this through carefully.' Then engage in collaborative exploration of their current schedule: 'Could you tell me more about your typical week? This helps us explore how study can fit naturally into your routine.' Share specific examples of how similar students succeed: 'Many parents in our program download materials to study during children's activities or use our mobile app during commutes. One of our current students, also a working parent, does most of her study early mornings before the kids wake up.' Show how program flexibility addresses their circumstances: 'Our online platform lets you access materials 24/7, so you can study when your children are asleep or between work commitments. For instance, you could download readings to your tablet for quick study sessions during lunch breaks.' Always emphasize support systems while maintaining appropriate boundaries: 'Once enrolled, our learning advisers can help you develop detailed study strategies that work with your schedule.' The goal is transforming perceived barriers into manageable challenges through practical, personalized solutions that resonate with their specific situation."
        },
        {
          "id": 3,
          "title": "Prior Learning Recognition",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596462071083",
              "segment_id": "36",
              "timestamp": "05:30"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student initiated discussion about credit recognition possibilities: 'I think you're also looking for some information about getting recognition of prior learning, is that correct?' (call_596462071083, seg_23). This proactive inquiry revealed both awareness of RPL's importance and desire to optimize their study pathway while validating their previous educational achievements.",
          "consultant_response": "The consultant provided clear, specific guidance about credit possibilities: 'We would be able to give you the eight elected units of study in our business degree as credit from using that marine engineering degree' (call_596462071083, seg_36). This response effectively demonstrated understanding of the student's background while providing tangible benefits through credit recognition.",
          "priority": "high",
          "recommended_approach": "When discussing recognition of prior learning, begin by validating the student's previous educational achievements: 'Your marine engineering degree represents significant expertise that we want to recognize.' Frame credit recognition discussions in terms of optimizing their study journey: 'Let's explore how your prior learning could create the most efficient pathway through the program.' Use specific examples: 'For instance, a recent student with an engineering background received eight units of credit, reducing their study load by a full year.' Share typical credit patterns: 'Engineering graduates often receive credit for core business units like project management and quantitative analysis, typically reducing total units by up to eight.' Provide clear next steps: 'To start the credit assessment process, we'll need your engineering transcript. Once submitted, assessments usually take 5-7 business days.' Always balance encouraging dialogue about credit possibilities with appropriate boundaries: 'While final credit decisions happen during enrollment, I can explain how similar qualifications have typically been assessed.' The key is demonstrating how prior learning recognition creates an efficient study pathway while maintaining focus on enrollment decisions rather than detailed credit assessments."
        },
        {
          "id": 4,
          "title": "Health-Conscious Study Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596689129763",
              "segment_id": "23",
              "timestamp": "03:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student disclosed significant health concerns affecting their study capacity: 'I've got some health issues that have cropped up which is sort of making it a bit chance' (call_596689129763, seg_23). This vulnerable disclosure required careful handling to maintain enrollment momentum while acknowledging the impact of health conditions on study planning.",
          "consultant_response": "The consultant demonstrated understanding by suggesting flexible program options: 'Not towards the grad dip, but you may want to consider a Bachelor of Psychology because of that RPL reasons' (call_596689129763, seg_38). This response showed sensitivity to health considerations while maintaining focus on academic progression through appropriate program recommendations.",
          "priority": "high",
          "recommended_approach": "When students disclose health considerations, begin by acknowledging their openness while maintaining appropriate boundaries: 'Thank you for sharing that information. Let me show you how our program flexibility can support different circumstances.' Focus on program features that accommodate varying health needs: 'Our online platform allows you to pace your study according to your wellbeing, with no fixed session times and materials always accessible.' Share specific examples: 'Many students appreciate our flexible assessment options. For instance, if you need to reduce your study load during health-related challenges, you can easily adjust from two units to one unit between trimesters.' Include practical strategies: 'You can download materials to study offline, access recordings of any missed sessions, and request assessment extensions if needed.' Always emphasize available support systems while staying within the sales role: 'Once enrolled, our student support team can help you develop study strategies that work with your specific situation.' The key is demonstrating program adaptability while maintaining appropriate boundaries between sales guidance and health-specific support."
        },
        {
          "id": 5,
          "title": "International Student Support",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596462071083",
              "segment_id": "55",
              "timestamp": "09:45"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student revealed their international status during the conversation: 'I'm just visiting here, I just accompanied my son who is into university' (call_596462071083, seg_50). This disclosure highlighted the need for specialized guidance regarding visa requirements and study options while maintaining appropriate boundaries around immigration advice.",
          "consultant_response": "The consultant's response focused narrowly on documentation requirements: 'I will also need a copy of your visa as well, just to ensure that we can actually enroll you' (call_596462071083, seg_55). This limited approach missed opportunities to provide comprehensive guidance about international student pathways and support services.",
          "priority": "high",
          "recommended_approach": "When working with international students, begin by acknowledging their specific circumstances while maintaining appropriate boundaries around visa advice: 'Understanding your visa status helps us identify the best study options for you.' Provide clear information about program requirements while being explicit about what you can and cannot advise on: 'While I can't offer specific visa advice, I can explain how different visa types generally affect study options with us.' Share specific examples: 'Many international students successfully study with us while traveling between countries. For instance, one student completed two units while visiting family overseas, using our offline study options and flexible assessment submissions.' Focus on program features relevant to international students: 'Our online platform allows you to maintain study progress even when traveling between countries, and our support services are available 24/7 across time zones.' Include practical solutions: 'You can download materials before traveling, submit assessments online from anywhere, and access support through our virtual learning environment.' Always reference appropriate support services: 'Our international student support team can provide detailed guidance on visa requirements once you're enrolled.' The goal is demonstrating comprehensive support availability while maintaining appropriate sales role boundaries."
        },
        {
          "id": 6,
          "title": "Study Load Flexibility",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596465208842",
              "segment_id": "54",
              "timestamp": "54:00"
            },
            "supporting_calls": []
          },
          "student_trigger": "During a critical moment in the enrollment discussion, the student sought clarity about program structure: 'Yeah, which is what, how many units a trimester' (call_596465208842, seg_54). This question revealed the need to understand practical study load management and program flexibility options.",
          "consultant_response": "The consultant provided a clear overview while emphasizing flexibility: 'Well I mean it's eight units per year... typically what most of our students will do is they'll take two subjects in the first trimester' (call_596465208842, seg_56). This response effectively balanced providing structure while highlighting student autonomy in managing their study load.",
          "priority": "high",
          "recommended_approach": "When addressing study load questions, begin by emphasizing student choice and control in structuring their learning journey. Start with a clear overview: 'The program consists of 24 units total, but you have complete flexibility in how you distribute these across trimesters.' Share specific success patterns: 'Many of our students start with two units, spending about 20 hours per week on study. For example, one working professional studies two hours each weekday evening and five hours each weekend day.' Address common concerns proactively: 'If you find two units manageable, you might increase to three in future trimesters, or if life gets busy, you can reduce to one unit. We had a student who increased to three units during their quieter work season and reduced to one during peak times.' Use real examples: 'A current student balances full-time work by studying one unit during busy quarters and two during quieter periods, maintaining steady progress while managing their workload.' Always emphasize support for decision-making: 'Once enrolled, our learning advisers can help you plan your ideal study pattern based on your specific circumstances.' The key is helping students envision a realistic and manageable study journey while emphasizing their autonomy in the planning process."
        }
      ]
    }
  }
}