{
  "metadata": {
    "consultant_name": "Mrudang Pancholi",
    "week_number": 17,
    "date_range": "02-17_02-21",
    "report_type": "Collaborative Planning"
  },
  "total_number_of_calls": 296,
  "team_average_total_number_of_calls_per_sales_consultant": 222.45454545454547,
  "number_of_calls_over_2_minutes": {
    "absolute_number": 72,
    "team_average_absolute_number": 50.09090909090909
  },
  "percent_of_calls_over_2_minutes": {
    "percentage": 24.324324324324326,
    "team_average_percentage": 25.577946405699496
  },
  "number_of_calls_under_2_minutes": {
    "absolute_number": 224,
    "team_average_absolute_number": 172.36363636363637
  },
  "percent_of_calls_under_2_minutes": {
    "percentage": 75.67567567567568,
    "team_average_percentage": 74.42205359430051
  },
  "average_talking_percentage": {
    "individual_average": 53.228999309764355,
    "team_average": 52.737881140105245
  },
  "excluded_transcripts": {
    "individual_excluded_transcripts": 224,
    "team_total_excluded_transcripts": 1896
  },
  "behavioral_scores": [
    {
      "label": "week-17_02-17_02-21",
      "average_final_ranking_score_eligible_transcripts": 117.66,
      "average_final_ranking_score_all_transcripts_over_2_mins": 67.82,
      "team_average_final_ranking_score_eligible_transcripts": 124.49,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 93.92
    }
  ],
  "themes": {
    "positive": [
      {
        "headline": "Strategic Pathway Planning",
        "explanation": "Consultants effectively create personalized educational pathways that balance immediate constraints with long-term aspirations while maintaining enrollment momentum through clear, practical solutions and supportive guidance"
      },
      {
        "headline": "Flexible Study Integration",
        "explanation": "Strong demonstration of how program flexibility accommodates diverse student circumstances through tangible examples, practical scheduling solutions, and specific success stories that resonate with real-world scenarios"
      },
      {
        "headline": "Career Resource Navigation",
        "explanation": "Clear guidance through career planning resources and employment outcomes while maintaining appropriate advisory boundaries and connecting students with comprehensive support services"
      }
    ],
    "improvement": [
      {
        "headline": "Career Development Integration",
        "explanation": "Enhanced exploration needed of how program elements align with specific workplace challenges and career goals while maintaining appropriate advisory boundaries and demonstrating tangible progression pathways"
      },
      {
        "headline": "Return to Study Confidence",
        "explanation": "More comprehensive support needed for students expressing anxiety about returning to education after extended breaks with emphasis on transferable skills, practical examples, and available resources"
      },
      {
        "headline": "Timeline Management Support",
        "explanation": "Clearer guidance required for addressing program duration concerns through specific examples, flexible pathways, and collaborative planning while maintaining enrollment momentum"
      }
    ]
  },
  "conversation_analysis": {
    "condensed": {
      "conversations": [
        {
          "id": 1,
          "title": "Course Suitability Exploration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596617454963",
              "segment_id": "29",
              "timestamp": "1:43"
            },
            "supporting_calls": [
              {
                "call_id": "596689488050",
                "segment_id": "110",
                "timestamp": "15:20"
              }
            ]
          },
          "student_trigger": "Student expressed: 'I just need to know what's possible, you know, what job prospects and suitability' (call_596617454963, seg_29), indicating critical need for guidance on career alignment and program value.",
          "consultant_response": "Consultant explored options effectively: 'Okay, well from what you have completed, you'll definitely be eligible applying for either of those, Applied Data Science or Project Management' (call_596617454963, seg_32).",
          "context_impact": "Critical moment to demonstrate how educational pathways support career aspirations and secure enrollment commitment through specific program-career connections.",
          "recommended_approach": "Include more specific examples of career outcomes and pathway progressions based on student's background while maintaining pre-enrollment focus."
        },
        {
          "id": 2,
          "title": "Documentation Requirements Clarity",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596462504732",
              "segment_id": "56",
              "timestamp": "4:01"
            },
            "supporting_calls": [
              {
                "call_id": "596343462636",
                "segment_id": "57",
                "timestamp": "4:15"
              }
            ]
          },
          "student_trigger": "Student asked: 'So you say it's all right to get it from my GP?' (call_596462504732, seg_56), seeking confirmation on documentation options and clear process guidance.",
          "consultant_response": "Consultant provided specific guidance: 'Yeah, GP is fine if they've known you for a few years. They can say how long they've known you' (call_596462504732, seg_57).",
          "context_impact": "Clear guidance on documentation requirements crucial for maintaining application momentum while providing actionable next steps.",
          "recommended_approach": "Proactively outline alternative documentation options and specific timeline requirements while maintaining enrollment focus."
        },
        {
          "id": 3,
          "title": "Strategic Enrollment Timing",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596689488050",
              "segment_id": "28",
              "timestamp": "3:05"
            },
            "supporting_calls": [
              {
                "call_id": "596617454963",
                "segment_id": "30",
                "timestamp": "3:45"
              }
            ]
          },
          "student_trigger": "Student asked: 'If I wanted to start next year, like could I still do that or?' (call_596689488050, seg_28), revealing need for enrollment timeline flexibility and clear planning pathway.",
          "consultant_response": "Consultant effectively explained: 'We have six teaching periods throughout the year, so if you want to start, are you looking to start Early next year? Mid next year?' (call_596689488050, seg_30).",
          "context_impact": "Critical moment requiring demonstration of program adaptability while maintaining enrollment momentum through specific timing options.",
          "recommended_approach": "Include more specific intake dates and preparation timeline details to enhance planning clarity and maintain momentum."
        },
        {
          "id": 4,
          "title": "Return to Study Support",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596343462636",
              "segment_id": "50",
              "timestamp": "8:15"
            },
            "supporting_calls": [
              {
                "call_id": "596689488050",
                "segment_id": "52",
                "timestamp": "8:45"
              }
            ]
          },
          "student_trigger": "Student shared: 'I haven't studied for 15 years - I'm worried I won't be able to keep up' (call_596343462636, seg_50), revealing significant anxiety about academic readiness.",
          "consultant_response": "Consultant provided factual information without addressing emotional concerns or specific support mechanisms that could build confidence.",
          "context_impact": "Critical opportunity to address academic confidence while maintaining enrollment focus through specific support examples.",
          "recommended_approach": "Implement empathetic acknowledgment and outline specific support systems for returning students while maintaining pre-enrollment boundaries."
        },
        {
          "id": 5,
          "title": "Work-Life Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596343495714",
              "segment_id": "53",
              "timestamp": "04:15"
            },
            "supporting_calls": [
              {
                "call_id": "596689488050",
                "segment_id": "55",
                "timestamp": "04:45"
              }
            ]
          },
          "student_trigger": "Student expressed: 'I am interested in exploring options for flexible study while working full-time' (call_596343495714, seg_53), seeking specific work-study balance solutions.",
          "consultant_response": "Consultant provided overview of flexible study options while maintaining focus on enrollment-relevant information and program value.",
          "context_impact": "Key moment to demonstrate program feasibility for working professionals through practical examples and specific flexibility features.",
          "recommended_approach": "Include more specific examples of successful work-study integration strategies from current students while maintaining pre-enrollment focus."
        },
        {
          "id": 6,
          "title": "Career Resource Integration",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596689488050",
              "segment_id": "110",
              "timestamp": "15:20"
            },
            "supporting_calls": [
              {
                "call_id": "596617454963",
                "segment_id": "112",
                "timestamp": "15:45"
              }
            ]
          },
          "student_trigger": "During course selection, consultant noted: 'So happy for you to have a look through the ones and kind of pick' (call_596689488050, seg_110), missing opportunity for career-focused guidance.",
          "consultant_response": "Consultant defaulted to administrative enrollment options without exploring career relevance or demonstrating program value.",
          "context_impact": "Opportunity to align course selection with career aspirations while maintaining enrollment momentum through specific program-career connections.",
          "recommended_approach": "Develop stronger connection between course selection and career goals while maintaining enrollment focus and appropriate pre-enrollment boundaries."
        }
      ]
    },
    "verbose": {
      "conversations": [
        {
          "id": 1,
          "title": "Course Suitability Exploration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596617454963",
              "segment_id": "29",
              "timestamp": "1:43"
            },
            "supporting_calls": [
              {
                "call_id": "596689488050",
                "segment_id": "110",
                "timestamp": "15:20"
              }
            ]
          },
          "student_trigger": "During key enrollment discussions, students expressed needs for flexible start dates and clear planning pathways. Primary example: 'I just need to know what's possible, you know, what job prospects and suitability' (call_596617454963, seg_29). Similar career alignment requests appeared across multiple calls, indicating this as a crucial decision point for potential students. The nature of these inquiries suggested both interest in the program and need for alignment with professional aspirations.",
          "consultant_response": "Consultants demonstrated varying degrees of effectiveness in handling course suitability discussions. Strong examples included: 'Okay, well from what you have completed, you'll definitely be eligible applying for either of those, Applied Data Science or Project Management' (call_596617454963, seg_32). This approach effectively balanced providing clear options while maintaining enrollment momentum.",
          "priority": "high",
          "recommended_approach": "When addressing course suitability inquiries, begin by acknowledging the student's career aspirations and current circumstances. Start with exploring their professional context: 'Could you tell me more about your career goals and what's driving your interest in these particular areas?' Then connect program elements directly to their objectives: 'Based on your background in [field] and interest in [career goal], let me show you how our [specific program] aligns with your aspirations.' Use concrete examples while maintaining enrollment focus: 'Many professionals in your field choose this pathway because it builds directly relevant skills in [specific area].' Throughout the discussion, demonstrate how program flexibility supports their goals: 'Our online learning platform lets you balance study with work commitments, and our curriculum is designed to apply directly to workplace challenges.' The key is creating a clear connection between their aspirations and our program offerings while maintaining momentum toward enrollment."
        },
        {
          "id": 2,
          "title": "Documentation Requirements Clarity",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596462504732",
              "segment_id": "56",
              "timestamp": "4:01"
            },
            "supporting_calls": [
              {
                "call_id": "596343462636",
                "segment_id": "57",
                "timestamp": "4:15"
              }
            ]
          },
          "student_trigger": "Across multiple calls, students sought clarity on documentation requirements, exemplified by: 'So you say it's all right to get it from my GP?' (call_596462504732, seg_56). These inquiries consistently revealed the importance of clear guidance while maintaining enrollment momentum through documentation processes.",
          "consultant_response": "Strong responses included specific guidance tailored to student circumstances: 'Yeah, GP is fine if they've known you for a few years. They can say how long they've known you' (call_596462504732, seg_57). This approach effectively validated student suggestions while providing clear parameters for acceptable documentation.",
          "priority": "high",
          "recommended_approach": "When addressing documentation requirements, start by validating the student's suggested approach while outlining clear parameters: 'Yes, a GP's letter is definitely acceptable, and I can explain exactly what needs to be included.' Then provide specific guidelines while maintaining momentum: 'The letter should confirm they've known you for X years and can verify your English proficiency. We can help draft a template if needed.' Present alternative options proactively: 'While we process the GP letter, we could also explore other documentation options to ensure smooth progression.' Focus on creating clear action steps: 'Let's outline exactly what you need to request from your GP, and I can help you plan the timeline.' Throughout the discussion, maintain a supportive tone that emphasizes partnership in meeting requirements while keeping the enrollment process moving forward."
        },
        {
          "id": 3,
          "title": "Strategic Enrollment Timing",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596689488050",
              "segment_id": "28",
              "timestamp": "3:05"
            },
            "supporting_calls": [
              {
                "call_id": "596617454963",
                "segment_id": "30",
                "timestamp": "3:45"
              }
            ]
          },
          "student_trigger": "During key enrollment discussions, students expressed needs for flexible start dates and clear planning pathways. Primary example: 'If I wanted to start next year, like could I still do that or?' (call_596689488050, seg_28). Similar timing flexibility requests appeared across multiple calls, indicating this as a crucial decision point for potential students.",
          "consultant_response": "Strong examples included clear explanation of options: 'We have six teaching periods throughout the year, so if you want to start, are you looking to start Early next year? Mid next year?' (call_596689488050, seg_30). This approach effectively balanced providing options while maintaining enrollment momentum.",
          "priority": "high",
          "recommended_approach": "When addressing enrollment timing inquiries, start by acknowledging the student's need for flexibility while creating clear direction: 'We design our enrollment periods to accommodate different schedules and circumstances. Let's explore which intake would best align with your situation.' Then outline specific options while gathering context: 'We have six teaching periods throughout the year - for example, many students starting in [month] find it aligns well with [specific circumstance].' Use real examples while maintaining enrollment focus: 'Some students prefer our February intake to align with the academic year, while others choose April to accommodate work commitments.' Always connect timing discussions to practical next steps: 'If you're considering the [month] intake, we can start preparing your documentation now to ensure a smooth transition.' The goal is to transform timing discussions into concrete planning that moves students closer to enrollment while respecting their individual circumstances."
        },
        {
          "id": 4,
          "title": "Return to Study Support",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596343462636",
              "segment_id": "50",
              "timestamp": "8:15"
            },
            "supporting_calls": [
              {
                "call_id": "596689488050",
                "segment_id": "52",
                "timestamp": "8:45"
              }
            ]
          },
          "student_trigger": "Multiple instances of students expressing anxiety about returning to study after extended breaks, exemplified by: 'I haven't studied for 15 years - I'm worried I won't be able to keep up' (call_596343462636, seg_50). These moments consistently revealed deep-seated concerns about academic readiness and the need for reassurance while maintaining enrollment focus.",
          "consultant_response": "Most consultants provided basic factual information without adequately addressing emotional concerns or outlining specific support mechanisms. This approach often missed opportunities to build confidence while maintaining appropriate pre-enrollment boundaries.",
          "priority": "high",
          "recommended_approach": "When addressing concerns about returning to study, begin with empathetic acknowledgment that validates their experience: 'Many of our successful students return to study after extended breaks - your life and work experience are actually valuable assets to your studies.' Then outline relevant support structures while maintaining enrollment focus: 'Our program includes specific resources designed to help you transition back to study, including orientation programs that refresh academic skills before classes begin.' Use concrete examples that build confidence: 'For instance, our online learning platform lets you revisit materials as needed, and our academic advisors are experienced in supporting returning students.' Throughout the discussion, demonstrate understanding while maintaining appropriate boundaries: 'While detailed study planning happens after enrollment, I can explain how our support systems help students successfully return to education.' The key is building confidence in their ability to succeed while keeping the focus on enrollment decisions."
        },
        {
          "id": 5,
          "title": "Work-Life Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596343495714",
              "segment_id": "53",
              "timestamp": "04:15"
            },
            "supporting_calls": [
              {
                "call_id": "596689488050",
                "segment_id": "55",
                "timestamp": "04:45"
              }
            ]
          },
          "student_trigger": "Multiple students expressed concerns about balancing work and study commitments, exemplified by: 'I am interested in exploring options for flexible study while working full-time' (call_596343495714, seg_53). These inquiries consistently revealed the importance of demonstrating program flexibility while maintaining enrollment momentum.",
          "consultant_response": "Consultants provided varying levels of detail about flexible study options, some effectively demonstrating program adaptability while others missed opportunities to provide specific examples relevant to working professionals.",
          "priority": "high",
          "recommended_approach": "When addressing work-life integration concerns, begin by validating the student's need for flexibility: 'Many of our successful students balance full-time work with study - our program is specifically designed for working professionals.' Then provide concrete examples while maintaining enrollment focus: 'Our flexible online platform lets you access materials 24/7, and assessment schedules accommodate professional commitments.' Use specific scenarios that resonate with their situation: 'For instance, many students download materials for offline study during commutes or quiet periods at work.' Throughout the discussion, demonstrate practical flexibility while maintaining appropriate boundaries: 'While detailed study planning happens post-enrollment, I can show you how our program structure supports successful work-life integration.' The key is making flexibility tangible through relevant examples while keeping focus on enrollment decisions."
        },
        {
          "id": 6,
          "title": "Career Resource Integration",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596689488050",
              "segment_id": "110",
              "timestamp": "15:20"
            },
            "supporting_calls": [
              {
                "call_id": "596617454963",
                "segment_id": "112",
                "timestamp": "15:45"
              }
            ]
          },
          "student_trigger": "Course selection discussions revealed opportunities for stronger career alignment, exemplified by passive guidance: 'So happy for you to have a look through the ones and kind of pick' (call_596689488050, seg_110). These moments indicated needs for more purposeful career-focused course planning while maintaining enrollment momentum.",
          "consultant_response": "Consultants often defaulted to administrative processing of course selections without exploring career relevance or long-term professional goals. This approach missed opportunities to demonstrate program value through career alignment while maintaining appropriate pre-enrollment focus.",
          "priority": "high",
          "recommended_approach": "When discussing course selection, integrate career relevance while maintaining enrollment momentum. Start by exploring professional context: 'Before we look at specific courses, could you tell me more about your career goals? This helps us align your study pathway with your professional aspirations.' Then connect program elements to career development: 'These core units directly support [specific career outcome], while our electives let you specialize in [relevant areas].' Use specific examples that resonate with their goals: 'Many professionals in your field choose this pathway because it builds directly relevant skills in [specific area].' Keep focus on enrollment-relevant decisions: 'While detailed career planning happens post-enrollment, let's ensure your initial course selection aligns with your professional goals.' The key is demonstrating program value through career relevance while avoiding detailed career planning that belongs in post-enrollment support."
        }
      ]
    }
  }
}