{
  "metadata": {
    "consultant_name": "Rochelle Khaddage",
    "week_number": 15,
    "date_range": "02-03_02-07",
    "report_type": "Collaborative Planning"
  },
  "total_number_of_calls": 206,
  "team_average_total_number_of_calls_per_sales_consultant": 253.6875,
  "number_of_calls_over_2_minutes": {
    "absolute_number": 68,
    "team_average_absolute_number": 70.125
  },
  "percent_of_calls_over_2_minutes": {
    "percentage": 33.00970873786408,
    "team_average_percentage": 27.813489709874816
  },
  "number_of_calls_under_2_minutes": {
    "absolute_number": 138,
    "team_average_absolute_number": 183.5625
  },
  "percent_of_calls_under_2_minutes": {
    "percentage": 66.99029126213593,
    "team_average_percentage": 72.18651029012518
  },
  "average_talking_percentage": {
    "individual_average": 57.801987690954654,
    "team_average": 53.68171627040834
  },
  "excluded_transcripts": {
    "individual_excluded_transcripts": 139,
    "team_total_excluded_transcripts": 2938
  },
  "behavioral_scores": [
    {
      "label": "week-6_12-02_12-06",
      "average_final_ranking_score_eligible_transcripts": 209.2,
      "average_final_ranking_score_all_transcripts_over_2_mins": 155.26,
      "team_average_final_ranking_score_eligible_transcripts": 181.48,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 131.4
    },
    {
      "label": "week-9_12-23_12-27",
      "average_final_ranking_score_eligible_transcripts": 160.51,
      "average_final_ranking_score_all_transcripts_over_2_mins": 126.2,
      "team_average_final_ranking_score_eligible_transcripts": 160.73,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 129.43
    },
    {
      "label": "week-10_12-30_01-03",
      "average_final_ranking_score_eligible_transcripts": 195.71,
      "average_final_ranking_score_all_transcripts_over_2_mins": 140.15,
      "team_average_final_ranking_score_eligible_transcripts": 178.81,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 131.7
    },
    {
      "label": "week-11_01-06_01-10",
      "average_final_ranking_score_eligible_transcripts": 199.88,
      "average_final_ranking_score_all_transcripts_over_2_mins": 130.8,
      "team_average_final_ranking_score_eligible_transcripts": 174.2,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 118.12
    },
    {
      "label": "week-12_01-13_01-17",
      "average_final_ranking_score_eligible_transcripts": 152.81,
      "average_final_ranking_score_all_transcripts_over_2_mins": 119.17,
      "team_average_final_ranking_score_eligible_transcripts": 157.75,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 113.37
    },
    {
      "label": "week-13_01-20_01-24",
      "average_final_ranking_score_eligible_transcripts": 201.84,
      "average_final_ranking_score_all_transcripts_over_2_mins": 129.66,
      "team_average_final_ranking_score_eligible_transcripts": 162.74,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 120.37
    },
    {
      "label": "week-14_01-27_01-31",
      "average_final_ranking_score_eligible_transcripts": 195.5,
      "average_final_ranking_score_all_transcripts_over_2_mins": 128.81,
      "team_average_final_ranking_score_eligible_transcripts": 155.43,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 112.46
    },
    {
      "label": "week-15_02-03_02-07",
      "average_final_ranking_score_eligible_transcripts": 225.42,
      "average_final_ranking_score_all_transcripts_over_2_mins": 107.01,
      "team_average_final_ranking_score_eligible_transcripts": 157.11,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 113.21
    }
  ],
  "themes": {
    "positive": [
      {
        "headline": "Strategic Pathway Planning",
        "explanation": "Consultants effectively create personalized educational pathways that balance immediate constraints with long-term aspirations through concrete examples and clear guidance"
      },
      {
        "headline": "Flexible Study Integration",
        "explanation": "Strong demonstration of how program flexibility accommodates diverse student circumstances including shift work, parental duties and remote locations through specific, actionable solutions"
      },
      {
        "headline": "Identity-Sensitive Support",
        "explanation": "Strong demonstration of cultural awareness and respect while providing clear, practical guidance for identity documentation and comprehensive support resources"
      }
    ],
    "improvement": [
      {
        "headline": "Career Development Integration",
        "explanation": "Enhanced exploration needed of how program elements and pathways align with specific workplace challenges and career advancement goals through concrete examples"
      },
      {
        "headline": "Educational Goal Exploration",
        "explanation": "Need for deeper exploration of students' interests and aspirations before presenting specific program options to ensure optimal pathway alignment"
      },
      {
        "headline": "Support Service Connection",
        "explanation": "More comprehensive approach required for proactively connecting students with relevant support resources while maintaining appropriate consultation boundaries"
      }
    ]
  },
  "conversation_analysis": {
    "condensed": {
      "conversations": [
        {
          "id": 1,
          "title": "Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595450899178",
              "segment_id": "110",
              "timestamp": "20:17"
            },
            "supporting_calls": [
              {
                "call_id": "595663967175",
                "segment_id": "24",
                "timestamp": "01:17"
              }
            ]
          },
          "student_trigger": "Student expressed: 'I sort of work full time. I can get a day off a week, like with study leave, which preferably, well I assume I'm not going to be able to fit all classes and whatnot into that one day' (call_595450899178, seg_110), revealing critical scheduling flexibility needs.",
          "consultant_response": "Consultant provided comprehensive solution: 'So look, with studying with us, it's completely flexible. There's no attendance. Everything can be watched at your own pace. It's all pre-recorded... students that work full-time, even some six days a week, can study at any time after work' (call_595450899178, seg_145).",
          "context_impact": "Required clear demonstration of how program flexibility could accommodate full-time work commitments while maintaining enrollment momentum.",
          "recommended_approach": "Could enhance by exploring specific study patterns that have worked well for other working students and developing personalized scheduling strategies."
        },
        {
          "id": 2,
          "title": "Cultural Identity Support",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "595821086284",
              "segment_id": "153",
              "timestamp": "14:10"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'Just a quick question, Nicholas. My identity as an Aboriginal person.' (call_595821086284, seg_153), highlighting need for culturally sensitive support.",
          "consultant_response": "Consultant provided clear options: 'You're probably either going to be doing it yourself on the Student Hub...or you can just call our Student Advisors team' (call_595821086284, seg_161)",
          "context_impact": "This moment required demonstrating institutional respect for cultural identity while providing clear process guidance.",
          "recommended_approach": "Enhance response by proactively discussing available cultural support services and resources."
        },
        {
          "id": 3,
          "title": "Educational Goal Exploration",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "595821060959",
              "segment_id": "12",
              "timestamp": "01:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed: 'Not too sure. I was just sort of looking into it to see what I would like to study if I was going to study.' (call_595821060959, seg_12)",
          "consultant_response": "Consultant focused on ATAR: 'With your ATAR, you have quite a good ATAR that does meet entry for a fair few courses.' (call_595821060959, seg_26)",
          "context_impact": "Critical opportunity to guide student through goal-setting process and clarify study interests.",
          "recommended_approach": "Explore student's interests and career aspirations before discussing specific course options."
        },
        {
          "id": 4,
          "title": "Strategic Pathway Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "Student expressed: 'I work rotating shifts at the hospital, not sure how I'll manage study' (call_595732493616, seg_23), followed by similar concerns from other healthcare workers: 'My roster changes every week' (call_595732548084, seg_163), revealing critical scheduling flexibility needs.",
          "consultant_response": "Consultant demonstrated practical solutions: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24), effectively showing real-world flexibility.",
          "context_impact": "Required demonstrating how program flexibility accommodates diverse work schedules and commitments.",
          "recommended_approach": "Include more specific examples of successful study patterns from current healthcare students."
        },
        {
          "id": 5,
          "title": "Support Service Integration",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595738739271",
              "segment_id": "0",
              "timestamp": "00:00"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student inquired: 'I have some questions about a placement unit and I just wondered if someone could help me with that?' (call_595738739271, seg_0)",
          "consultant_response": "Basic referral provided without exploring student's specific needs or concerns.",
          "context_impact": "Opportunity to demonstrate comprehensive support structure while maintaining appropriate boundaries.",
          "recommended_approach": "Briefly explore student's placement concerns before facilitating connection to appropriate support team."
        },
        {
          "id": 6,
          "title": "Collaborative Goal Setting",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595821060959",
              "segment_id": "12",
              "timestamp": "01:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed uncertainty: 'Yeah, I guess at the moment, not too sure. I was just sort of looking into it' (call_595821060959, seg_12)",
          "consultant_response": "Consultant acknowledged academic standing but missed deeper exploration of interests.",
          "context_impact": "Critical moment to demonstrate consultative approach in educational planning.",
          "recommended_approach": "Implement structured goal exploration before discussing specific program options."
        }
      ]
    },
    "verbose": {
      "conversations": [
        {
          "id": 1,
          "title": "Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595450899178",
              "segment_id": "110",
              "timestamp": "20:17"
            },
            "supporting_calls": [
              {
                "call_id": "595663967175",
                "segment_id": "24",
                "timestamp": "01:17"
              }
            ]
          },
          "student_trigger": "During critical enrollment discussions, multiple students expressed significant concerns about balancing full-time work with study commitments. The primary example came when a student noted: 'I sort of work full time. I can get a day off a week, like with study leave, which preferably, well I assume I'm not going to be able to fit all classes and whatnot into that one day' (call_595450899178, seg_110). This revealed both interest in the program and anxiety about practical implementation.",
          "consultant_response": "The consultant effectively addressed these concerns by highlighting the program's flexibility and alignment with working students' needs: 'So look, with studying with us, it's completely flexible. There's no attendance. Everything can be watched at your own pace. It's all pre-recorded... So look, I have students that work full-time, even some six days a week, and then they're able, because of the flexibility, they can study at any time after work' (call_595450899178, seg_145). This response successfully transformed a potential barrier into an opportunity by demonstrating practical solutions and using real examples of working students managing the program effectively.",
          "priority": "high",
          "recommended_approach": "When addressing work-study balance concerns, begin by acknowledging the specific challenges of combining full-time work with study. Start with validation: 'I understand managing full-time work alongside study can seem challenging.' Then provide concrete examples of how current working students succeed: 'Many of our students work similar schedules to yours and find success by breaking study into manageable segments. For instance, some download lectures to watch during lunch breaks, while others dedicate specific evenings to focused study.' Share specific strategies that have worked: 'One of our current students downloads materials on Sunday evening for the week ahead, then engages with discussion boards during quiet periods at work.' The key is transforming perceived scheduling barriers into manageable planning opportunities, always grounding examples in workplace scenarios that resonate with their experience. Pay particular attention to students expressing scheduling anxiety, offering targeted solutions: 'Given your work pattern, you might find our mobile app particularly useful for studying during breaks or commute time.' Focus on making flexibility tangible rather than theoretical through practical, personalized planning."
        },
        {
          "id": 2,
          "title": "Cultural Identity Support",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "595821086284",
              "segment_id": "153",
              "timestamp": "14:10"
            },
            "supporting_calls": []
          },
          "student_trigger": "During a critical moment in call 595821086284 (segment 153), the student raised an important identity consideration, stating: 'Just a quick question, Nicholas. My identity as an Aboriginal person.' This query represented a significant opportunity to demonstrate institutional sensitivity and support for cultural identity within the academic environment. The student's willingness to discuss their Aboriginal identity indicated trust and an expectation of appropriate cultural awareness from the institution.",
          "consultant_response": "The consultant handled this sensitive matter professionally, responding: 'You're probably either going to be doing it yourself on the Student Hub, if you can have that option to update your personal details there, or you can just call our Student Advisors team and let them know, and they should be able to make the change on behalf of you.' (segment 161). This response effectively balanced practical guidance with respect for the student's autonomy in managing their identity information. The consultant's approach demonstrated institutional support while maintaining appropriate professional boundaries.",
          "priority": "high",
          "recommended_approach": "When addressing matters of cultural identity, consultants must recognize these moments as opportunities to demonstrate institutional commitment to inclusivity while providing practical support. Begin by acknowledging the significance of the student's identity disclosure with a response like: 'Thank you for sharing that with me. Your identity is an important part of your educational journey with us.' Follow this acknowledgment with clear, practical guidance about how the institution supports and recognizes cultural identity. Present options for updating personal information while emphasizing available support services: 'You have flexibility in how you manage your identity information - either through self-service options or with assistance from our Student Advisors team who are trained in cultural sensitivity.' It's crucial to maintain a balance between procedural efficiency and cultural respect, ensuring students feel both practically supported and personally valued. When discussing support services, highlight specific resources available for Aboriginal and Torres Strait Islander students, but allow the student to guide the depth of this discussion based on their signals of interest. The key is creating an atmosphere where students feel confident their cultural identity is respected while maintaining focus on their immediate needs and preferences for managing personal information."
        },
        {
          "id": 3,
          "title": "Educational Goal Exploration",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "595821060959",
              "segment_id": "12",
              "timestamp": "01:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "In call 595821060959 (segment 12), the student expressed uncertainty about their educational direction: 'Yeah, I guess at the moment, not too sure. I was just sort of looking into it to see what I would like to study if I was going to study.' This statement revealed both an openness to exploring options and a need for guidance in clarifying educational goals. The tentative nature of their exploration suggested a critical opportunity for meaningful engagement in educational planning.",
          "consultant_response": "The consultant's response focused primarily on eligibility: 'Okay, so look, with your ATAR, you have quite a good ATAR that does meet entry for a fair few courses.' (segment 26) While this acknowledged the student's academic standing, it missed the opportunity to explore their interests and aspirations before discussing specific courses. The response failed to engage the student in a deeper discussion about their educational goals and career interests.",
          "priority": "high",
          "recommended_approach": "When students express uncertainty about their study direction, begin by validating their exploration phase while guiding them toward deeper reflection about their interests and goals. Start with an empathetic acknowledgment: 'It's completely normal to be exploring your options. Let's take a step back and talk about what interests you most.' Follow with open-ended questions about their interests, previous positive learning experiences, and career aspirations. For instance: 'What subjects or activities have you found most engaging so far?' or 'Are there particular career fields you're curious about?' Build a collaborative dialogue that helps students articulate their interests before presenting specific course options. This approach transforms uncertainty into a constructive exploration of possibilities. Pay particular attention to non-verbal cues and levels of engagement, adjusting the depth of exploration accordingly. When discussing potential courses, connect them directly to the interests and goals the student has shared, making the relevance clear and personal. The goal is to help students feel ownership of their educational journey while providing structured guidance that builds their confidence in decision-making."
        },
        {
          "id": 4,
          "title": "Strategic Pathway Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "A healthcare worker expressed significant concern about managing study with shift work: 'I work rotating shifts at the hospital, not sure how I'll manage study' (call_595732493616, seg_23). This was echoed in another call where a student noted: 'My roster changes every week, and I often work nights' (call_595732548084, seg_163).",
          "consultant_response": "The consultant demonstrated strong understanding of healthcare workflows, responding with practical solutions: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24). This was reinforced in the supporting call with: 'The beauty of our platform is you can switch between online and offline study. Some students download their materials before night shifts' (call_595732548084, seg_164).",
          "priority": "high",
          "recommended_approach": "When addressing shift workers' scheduling concerns, start by validating their specific work pattern then immediately bridge to relevant examples that demonstrate our program's practical flexibility. The key is making our platform's features tangible through real-world healthcare scenarios. For example, when a nurse mentions rotating shifts, respond: 'I understand how challenging rotating rosters can be. Let me show you exactly how our program adapts to that. The platform lets you download all your weekly materials before your rotation starts. So if you're working three night shifts, you might download everything on Monday, use those quiet periods around 2-3am for focused reading, then complete your discussion posts during your recovery days.' This specific, healthcare-focused approach resonates more deeply than general statements about flexibility. Pay particular attention to proactively addressing night shifts and long rotations, always keeping examples grounded in the realities of healthcare work patterns."
        },
        {
          "id": 5,
          "title": "Support Service Integration",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595738739271",
              "segment_id": "0",
              "timestamp": "00:00"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student initiated contact seeking placement guidance: 'I have some questions about a placement unit and I just wondered if someone could help me with that?' (call_595738739271, seg_0). This query represented an opportunity to demonstrate comprehensive support while maintaining appropriate consultation boundaries.",
          "consultant_response": "The consultant provided a basic referral without exploring the nature of the student's placement concerns or explaining how the support team could specifically assist. This transactional approach missed the opportunity to build confidence in the institution's support structures.",
          "priority": "high",
          "recommended_approach": "When students inquire about placement units, begin by briefly exploring their specific concerns while clearly establishing the boundaries of pre-enrollment support. A effective approach starts with acknowledgment and brief exploration: 'I appreciate you asking about placements - they're an important part of your study journey. Could you share what specific aspects you're curious about?' This allows for addressing general questions while smoothly transitioning to specialist support: 'While I can give you an overview, our placement team has dedicated specialists who can provide detailed guidance. Let me explain how they'll support you throughout your placement journey.' This balanced approach demonstrates comprehensive support while maintaining appropriate role boundaries. The goal is to build confidence in institutional support systems while ensuring students receive expert guidance at the right time."
        },
        {
          "id": 6,
          "title": "Collaborative Goal Setting",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595821060959",
              "segment_id": "12",
              "timestamp": "01:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed initial uncertainty about study direction: 'Yeah, I guess at the moment, not too sure. I was just sort of looking into it to see what I would like to study if I was going to study' (call_595821060959, seg_12). This represented a crucial moment for collaborative educational planning.",
          "consultant_response": "While the consultant acknowledged the student's academic standing: 'With your ATAR, you have quite a good ATAR that does meet entry for a fair few courses' (seg_26), they missed the opportunity to deeply explore the student's interests and aspirations before discussing course options.",
          "priority": "high",
          "recommended_approach": "When encountering students in the exploration phase, implement a structured yet flexible approach to goal discovery. Begin with validation: 'This exploration phase is valuable - it's about finding the right path for you.' Then guide the conversation through key areas: past academic experiences ('Which subjects have you found most engaging?'), career interests ('What types of work environments appeal to you?'), and personal goals ('What impact would you like to make in your field?'). Use their responses to create connections to potential study paths: 'I'm hearing a strong interest in [specific area] - let me show you how our programs could align with that.' This approach transforms uncertainty into purposeful exploration while building student confidence in their educational planning."
        }
      ]
    }
  }
}