{
  "metadata": {
    "consultant_name": "Sebastian Saunders",
    "week_number": 16,
    "date_range": "02-10_02-14",
    "report_type": "Collaborative Planning"
  },
  "total_number_of_calls": 220,
  "team_average_total_number_of_calls_per_sales_consultant": 242.8125,
  "number_of_calls_over_2_minutes": {
    "absolute_number": 70,
    "team_average_absolute_number": 62.3125
  },
  "percent_of_calls_over_2_minutes": {
    "percentage": 31.818181818181817,
    "team_average_percentage": 25.75705321113411
  },
  "number_of_calls_under_2_minutes": {
    "absolute_number": 150,
    "team_average_absolute_number": 180.5
  },
  "percent_of_calls_under_2_minutes": {
    "percentage": 68.18181818181817,
    "team_average_percentage": 74.2429467888659
  },
  "average_talking_percentage": {
    "individual_average": 55.77879225362816,
    "team_average": 53.5140458127338
  },
  "excluded_transcripts": {
    "individual_excluded_transcripts": 150,
    "team_total_excluded_transcripts": 2888
  },
  "behavioral_scores": [
    {
      "label": "week-11_01-06_01-10",
      "average_final_ranking_score_eligible_transcripts": 124.15,
      "average_final_ranking_score_all_transcripts_over_2_mins": 96.68,
      "team_average_final_ranking_score_eligible_transcripts": 174.2,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 118.12
    },
    {
      "label": "week-12_01-13_01-17",
      "average_final_ranking_score_eligible_transcripts": 131.87,
      "average_final_ranking_score_all_transcripts_over_2_mins": 111.41,
      "team_average_final_ranking_score_eligible_transcripts": 157.75,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 113.37
    },
    {
      "label": "week-13_01-20_01-24",
      "average_final_ranking_score_eligible_transcripts": 166.1,
      "average_final_ranking_score_all_transcripts_over_2_mins": 95.95,
      "team_average_final_ranking_score_eligible_transcripts": 162.74,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 120.37
    },
    {
      "label": "week-14_01-27_01-31",
      "average_final_ranking_score_eligible_transcripts": 139.63,
      "average_final_ranking_score_all_transcripts_over_2_mins": 88.31,
      "team_average_final_ranking_score_eligible_transcripts": 155.43,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 112.46
    },
    {
      "label": "week-15_02-03_02-07",
      "average_final_ranking_score_eligible_transcripts": 108.98,
      "average_final_ranking_score_all_transcripts_over_2_mins": 100.41,
      "team_average_final_ranking_score_eligible_transcripts": 157.11,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 113.21
    },
    {
      "label": "week-16_02-10_02-14",
      "average_final_ranking_score_eligible_transcripts": 215.5,
      "average_final_ranking_score_all_transcripts_over_2_mins": 108.92,
      "team_average_final_ranking_score_eligible_transcripts": 163.3,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 109.25
    }
  ],
  "themes": {
    "positive": [
      {
        "headline": "Strategic Pathway Planning",
        "explanation": "Consultants effectively create personalized educational pathways that balance immediate constraints with long-term aspirations while maintaining enrollment momentum"
      },
      {
        "headline": "Flexible Study Integration",
        "explanation": "Strong demonstration of how program flexibility accommodates diverse student circumstances including healthcare shifts, parental responsibilities and work commitments"
      },
      {
        "headline": "Process Navigation Support",
        "explanation": "Effective guidance through application, enrollment and documentation requirements with clear steps and comprehensive support mechanisms"
      }
    ],
    "improvement": [
      {
        "headline": "Career Development Integration",
        "explanation": "Enhanced exploration needed of how program elements strategically align with specific workplace challenges and career progression goals"
      },
      {
        "headline": "Life Circumstance Exploration",
        "explanation": "More comprehensive support needed for understanding and leveraging students' current life situations to build confidence and create actionable study plans"
      },
      {
        "headline": "Support Service Navigation",
        "explanation": "Clearer guidance required for available support services and engagement opportunities throughout the student journey"
      }
    ]
  },
  "conversation_analysis": {
    "condensed": {
      "conversations": [
        {
          "id": 1,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "Student stated: 'I work rotating shifts at the hospital, not sure how I'll manage study' (call_595732493616, seg_23), followed by similar concerns from other healthcare workers: 'My roster changes every week' (call_595732548084, seg_163), revealing critical scheduling flexibility needs.",
          "consultant_response": "Consultant provided practical solution: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24), effectively showing real-world flexibility.",
          "context_impact": "These moments required clear demonstration of how program design specifically accommodates healthcare shift workers to maintain enrollment momentum.",
          "recommended_approach": "Include more specific examples of successful study patterns from current healthcare students."
        },
        {
          "id": 2,
          "title": "Course Structure Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596267832921",
              "segment_id": "58",
              "timestamp": "9:43"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'Yeah, where I want to be, I don't know exactly how to structure these two' (call_596267832921, seg_58), revealing uncertainty about combining interests in Information Technology and Social Science.",
          "consultant_response": "Consultant provided strategic solution: 'both of those courses have electives... you can do units from the other course in the elective slots to further your learning' (call_596267832921, seg_64), effectively demonstrating pathway flexibility.",
          "context_impact": "This moment required clear guidance on course structuring options to maintain enrollment momentum while addressing the student's desire for a customized learning pathway.",
          "recommended_approach": "Include more specific examples of successful course combinations and career outcomes."
        },
        {
          "id": 3,
          "title": "Life Circumstance Integration",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595907932333",
              "segment_id": "51",
              "timestamp": "05:45"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'I've tried uni before... it wasn't a bit much for me at the time being a single mum with two kids but now they're way older' (call_595907932333, seg_51), indicating changed circumstances requiring exploration.",
          "consultant_response": "Consultant replied minimally: 'Yeah, okay, great' (call_595907932333, seg_56), missing chance to leverage improved circumstances for confidence building.",
          "context_impact": "Vital opportunity to explore how current life situation supports academic success and build confidence through changed circumstances.",
          "recommended_approach": "Create detailed exploration of how current circumstances enable study success."
        },
        {
          "id": 4,
          "title": "Career Development Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596091121448",
              "segment_id": "94",
              "timestamp": "12:53"
            },
            "supporting_calls": [
              {
                "call_id": "595907889399",
                "segment_id": "13",
                "timestamp": "01:40"
              }
            ]
          },
          "student_trigger": "Student stated: 'I'm looking at this to help me within my role, and upskill myself' (call_596091121448, seg_94), followed by another noting: 'I wanted to improve my business skills' (call_595907889399, seg_13), revealing clear career development focus.",
          "consultant_response": "Consultants provided general course information without exploring specific career enhancement opportunities or skill development pathways.",
          "context_impact": "Critical opportunity to demonstrate program's direct impact on career advancement and professional growth.",
          "recommended_approach": "Map program components directly to student's career advancement goals and skill development needs."
        },
        {
          "id": 5,
          "title": "University Transition Support",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595907932333",
              "segment_id": "14",
              "timestamp": "01:16"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'I'm new to the whole uni thing so it just gives me some thought' (call_595907932333, seg_14), revealing significant apprehension about entering university education.",
          "consultant_response": "Consultant effectively normalized experience: 'most students going to this course haven't studied at uni before... it is very much designed with that in mind' (call_595907932333, seg_15), building confidence through shared experience.",
          "context_impact": "Critical moment requiring validation of concerns while demonstrating clear support pathways for new students.",
          "recommended_approach": "Provide more specific examples of support services and success strategies for new students."
        },
        {
          "id": 6,
          "title": "Financial Planning Support",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596268136173",
              "segment_id": "119",
              "timestamp": "08:58"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'And do I have to do that fee help form now or when I'm enrolled?' (call_596268136173, seg_119), seeking clarity on financial process timing and requirements.",
          "consultant_response": "Consultant provided basic response: 'Yeah, after you're enrolled, which will be once we get your CASPer test results' (call_596268136173, seg_120), missing opportunity for detailed guidance.",
          "context_impact": "Key moment to provide comprehensive financial planning guidance while maintaining enrollment momentum.",
          "recommended_approach": "Develop detailed financial planning timeline with specific support resources."
        }
      ]
    },
    "verbose": {
      "conversations": [
        {
          "id": 1,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "In call 595732493616 (segment 23), the student expressed significant concern about balancing study with shift work: 'I work rotating shifts at the hospital, not sure how I'll manage study.' Similar concerns emerged in call 595732548084 (segment 163) where another healthcare worker noted: 'My roster changes every week.' These moments represented critical opportunities to demonstrate how our program specifically accommodates healthcare professionals' unique scheduling challenges.",
          "consultant_response": "The primary consultant demonstrated strong understanding of healthcare workflows, responding with: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24). This practical example resonated strongly, with the student responding: 'That actually sounds manageable.' In the supporting call, the consultant built on the flexible access theme: 'The beauty of our platform is you can switch between online and offline study. Some students download their materials before night shifts' (call_595732548084, seg_164). Both consultants effectively moved the conversation from 'if' to 'how', directly addressing practical concerns while maintaining momentum.",
          "priority": "high",
          "recommended_approach": "When addressing shift workers' scheduling concerns, start by acknowledging their specific work pattern before showing how our program design aligns with healthcare workflows. Share concrete examples of how current students manage study around shifts - whether it's downloading materials for night shifts, studying during quiet periods, or breaking study into small blocks between shifts. The key is making flexibility tangible rather than theoretical. For instance, explain how asynchronous learning means no mandatory live sessions, and offline access means study can happen even in areas with poor connectivity. For those with rotating rosters, emphasize how weekly study patterns can adapt to changing schedules. Pay particular attention to students working night shifts or long rotations, showing how our platform's flexibility specifically addresses these challenges. The goal is to transform perceived scheduling barriers into manageable planning opportunities, always grounding explanations in healthcare-specific scenarios that resonate with their experience."
        },
        {
          "id": 2,
          "title": "Course Structure Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596267832921",
              "segment_id": "58",
              "timestamp": "9:43"
            },
            "supporting_calls": []
          },
          "student_trigger": "During a crucial discussion about program structure, the student expressed uncertainty about combining their interests, stating 'Yeah, where I want to be, I don't know exactly how to structure these two' (call_596267832921, seg_58). This moment revealed both the student's commitment to their educational goals and their need for guidance in creating a feasible study pathway that would accommodate their diverse interests in Information Technology and Social Science.",
          "consultant_response": "The consultant demonstrated strong collaborative planning by responding with a comprehensive explanation: 'Right, I mean, both of those courses have electives. We don't have any double degree options, but ultimately you will have to pick one or the other. You could do, you know, one and then complete the other later on, but probably what I'd recommend would be choosing one of those two, and then you can do units from the other course in the elective slots to further your learning' (call_596267832921, seg_64). This response effectively transformed the student's uncertainty into a clear understanding of their options by illustrating the flexibility available through electives and future study possibilities.",
          "priority": "high",
          "recommended_approach": "When addressing students' uncertainty about course structuring, begin by validating their desire to combine different areas of study, then immediately bridge to practical solutions that demonstrate program flexibility. Start with acknowledgment: 'Your interest in combining these fields shows great initiative - let's explore how we can create a pathway that incorporates both.' Then outline specific options, using examples of how current students have successfully balanced similar interests. The key is demonstrating how strategic unit selection can create a personalized learning journey. For instance, explain how elective choices can target specific skills while maintaining focus in their primary field. Pay particular attention to future opportunities, showing how this approach can enhance career prospects. Always ground discussions in practical examples, helping students visualize how their diverse interests can be effectively integrated within program structures."
        },
        {
          "id": 3,
          "title": "Life Circumstance Integration",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595907932333",
              "segment_id": "51",
              "timestamp": "05:45"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student shared their previous university experience and life changes: 'I've tried uni before... it wasn't a bit much for me at the time being a single mum with two kids but now they're way older' (call_595907932333, seg_51). This disclosure presented a vital opportunity to explore how changed circumstances could support academic success and build confidence based on life experience.",
          "consultant_response": "The consultant's minimal response of 'Yeah, okay, great' (call_595907932333, seg_56) failed to capitalize on this important moment. The response missed the opportunity to explore how the student's evolved circumstances could positively impact their studies or to discuss how their past experience, even if challenging, could inform their approach to new studies.",
          "priority": "high",
          "recommended_approach": "When students reveal past academic experiences and life changes, consultants must engage deeply to transform potential barriers into stepping stones for success. Begin with validation and positive reframing: 'Your previous university experience, combined with your journey as a parent, gives you valuable insights into managing study effectively. Tell me more about how your circumstances have changed.' Use specific prompts to explore current advantages: 'With your children being older now, what study times might work best around your family routine?' Draw on their life experience: 'Many parents find their organizational skills from managing family life transfer well to academic planning. How do you think your experiences might help?' Create practical strategies: 'Let's design a study approach that builds on your strengths. For instance, if mornings are your best time, we could look at how to maximize those hours.' Always emphasize how changed circumstances can support academic success while acknowledging the wisdom gained from past experiences."
        },
        {
          "id": 4,
          "title": "Career Development Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596091121448",
              "segment_id": "94",
              "timestamp": "12:53"
            },
            "supporting_calls": [
              {
                "call_id": "595907889399",
                "segment_id": "13",
                "timestamp": "01:40"
              }
            ]
          },
          "student_trigger": "Students across multiple calls expressed career development goals: 'I'm looking at this to help me within my role, and upskill myself' (call_596091121448, seg_94) and 'I wanted to improve my business skills' (call_595907889399, seg_13). These statements revealed clear professional development objectives requiring specific program alignment.",
          "consultant_response": "Consultants typically provided general course information without exploring specific career enhancement opportunities or creating clear connections between program components and professional development goals. This generic approach missed opportunities to demonstrate concrete value and career impact.",
          "priority": "high",
          "recommended_approach": "When students express career development goals, immediately engage in specific exploration of their professional objectives. Begin with targeted questions about their current role and desired growth areas: 'Could you tell me more about your current responsibilities and where you'd like to develop?' Use their responses to create direct connections between program elements and career advancement: 'Our project management unit, for example, has helped many students implement improved workflows in their current roles.' Share success stories that demonstrate immediate application: 'One of our recent graduates applied our change management frameworks to lead a major department restructure.' The key is showing how program components directly enhance workplace capabilities while building toward longer-term career goals. Always maintain focus on both immediate skill application and extended professional growth opportunities, helping students envision a clear development pathway through the program."
        },
        {
          "id": 5,
          "title": "University Transition Support",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595907932333",
              "segment_id": "14",
              "timestamp": "01:16"
            },
            "supporting_calls": []
          },
          "student_trigger": "A critical moment occurred when the student expressed vulnerability about their lack of university experience: 'I'm new to the whole uni thing so it just gives me some thought' (call_595907932333, seg_14). This admission revealed underlying anxiety about entering higher education and signaled a need for comprehensive support and guidance. The statement's timing early in the conversation made it particularly significant as it set the tone for addressing fundamental concerns about university readiness.",
          "consultant_response": "The consultant demonstrated strong collaborative planning by normalizing the student's experience and highlighting the program's design for new students: 'most students going to this course haven't studied at uni before... it is very much designed with that in mind' (call_595907932333, seg_15). This response effectively addressed the student's anxiety by placing them within a community of similar learners, making the university experience feel more approachable. The consultant's approach aligned perfectly with the behavioral pattern by acknowledging the student's concerns while simultaneously providing reassurance through context about program design and peer experiences.",
          "priority": "high",
          "recommended_approach": "When students express uncertainty about university study, consultants must create a supportive dialogue that transforms apprehension into confidence. Begin by validating their feelings: 'It's completely normal to feel uncertain when starting university - many of our most successful students shared similar thoughts.' Then engage in collaborative exploration: 'Let's discuss which aspects of university study you're thinking about most.' Use concrete examples of how other new students have succeeded: 'Many students who were new to university found our introductory workshops particularly helpful - they cover everything from academic writing to time management.' Throughout the conversation, maintain a balance between normalizing concerns and highlighting specific support systems. For instance, share how current students adapted: 'One of our recent students found the online orientation particularly helpful for understanding university expectations before classes began.' Pay special attention to moments where students share specific worries, using these as opportunities to demonstrate how the program's design and support services directly address their concerns."
        },
        {
          "id": 6,
          "title": "Financial Planning Support",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596268136173",
              "segment_id": "119",
              "timestamp": "08:58"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student sought clarity about financial documentation timing: 'And do I have to do that fee help form now or when I'm enrolled?' (call_596268136173, seg_119). This question indicated both proactive planning on the student's part and a need for clear guidance about financial processes. The timing of this query suggested it was a potential concern that could impact their enrollment decision.",
          "consultant_response": "While the consultant provided basic timing information: 'Yeah, after you're enrolled, which will be once we get your CASPer test results' (call_596268136173, seg_120), the response lacked detailed guidance about the complete financial planning process. The interaction missed an opportunity to create a comprehensive timeline and explore potential support needs or concerns about financial documentation.",
          "priority": "high",
          "recommended_approach": "When addressing financial process questions, consultants must provide comprehensive guidance while maintaining clarity and momentum. Start with immediate clarity: 'The fee help form comes after enrollment, but let me walk you through the complete financial timeline so you're fully prepared.' Create a clear sequence: 'First, we'll confirm your eligibility through CASPer. Once that's complete, we'll process your enrollment, and then I'll personally guide you through the fee help application.' Use specific examples to illustrate the process: 'Many students find it helpful to gather certain documents in advance - for instance, your tax file number and citizenship evidence.' Address common concerns proactively: 'Students often ask about payment deadlines and census dates - would you like me to explain how these work?' Highlight available support: 'Our financial advisors provide detailed guidance throughout this process. They can help with everything from payment plans to understanding fee help limits.' Remember to create action items: 'Let's create a checklist of the documents you'll need, so you're ready when the time comes.' End with confidence-building next steps: 'I'll send you a detailed email outlining everything we've discussed, and you can always reach out if you need clarification.'"
        }
      ]
    }
  }
}