{
  "metadata": {
    "consultant_name": "Shelton Frimpong",
    "week_number": 17,
    "date_range": "02-17_02-21",
    "report_type": "Collaborative Planning"
  },
  "total_number_of_calls": 236,
  "team_average_total_number_of_calls_per_sales_consultant": 239.125,
  "number_of_calls_over_2_minutes": {
    "absolute_number": 69,
    "team_average_absolute_number": 68.875
  },
  "percent_of_calls_over_2_minutes": {
    "percentage": 29.23728813559322,
    "team_average_percentage": 29.051225325524136
  },
  "number_of_calls_under_2_minutes": {
    "absolute_number": 167,
    "team_average_absolute_number": 170.25
  },
  "percent_of_calls_under_2_minutes": {
    "percentage": 70.76271186440678,
    "team_average_percentage": 70.94877467447586
  },
  "average_talking_percentage": {
    "individual_average": 50.72632973346728,
    "team_average": 53.02123725908919
  },
  "excluded_transcripts": {
    "individual_excluded_transcripts": 167,
    "team_total_excluded_transcripts": 2724
  },
  "behavioral_scores": [
    {
      "label": "week-17_02-17_02-21",
      "average_final_ranking_score_eligible_transcripts": 84.14,
      "average_final_ranking_score_all_transcripts_over_2_mins": 77.92,
      "team_average_final_ranking_score_eligible_transcripts": 148.21,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 109.77
    }
  ],
  "themes": {
    "positive": [
      {
        "headline": "Strategic Pathway Planning",
        "explanation": "Consultants effectively create personalized educational pathways that balance immediate constraints with long-term aspirations while maintaining enrollment momentum through targeted acceleration options"
      },
      {
        "headline": "Flexible Study Integration",
        "explanation": "Strong demonstration of how program flexibility accommodates diverse student circumstances through collaborative pathway development and specific adaptation strategies"
      },
      {
        "headline": "Career Pathway Navigation",
        "explanation": "Effective guidance through educational pathways while maintaining appropriate career guidance boundaries and building student confidence through clear process explanation"
      }
    ],
    "improvement": [
      {
        "headline": "Work-Study Balance Support",
        "explanation": "Enhanced exploration needed of specific strategies for balancing work and study commitments with concrete examples and proactive support mechanisms"
      },
      {
        "headline": "Return to Study Confidence",
        "explanation": "More comprehensive support needed for students returning to education through validation of transferable skills and specific success strategies"
      },
      {
        "headline": "Documentation Process Planning",
        "explanation": "Clearer guidance required for complex documentation scenarios with specific alternative pathways and proactive support mechanisms"
      }
    ]
  },
  "conversation_analysis": {
    "condensed": {
      "conversations": [
        {
          "id": 1,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "Student stated: 'I work rotating shifts at the hospital, not sure how I'll manage study' (call_595732493616, seg_23), followed by similar concerns from other healthcare workers: 'My roster changes every week' (call_595732548084, seg_163), revealing critical scheduling flexibility needs.",
          "consultant_response": "Consultant provided practical solution: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24), effectively showing real-world flexibility.",
          "context_impact": "This moment required clear demonstration of how our program design specifically accommodates healthcare shift workers to maintain enrollment momentum.",
          "recommended_approach": "Include more specific examples of successful study patterns from current healthcare students and their work-study integration strategies."
        },
        {
          "id": 2,
          "title": "Strategic Pathway Acceleration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596697763867",
              "segment_id": "39",
              "timestamp": "5:15"
            },
            "supporting_calls": [
              {
                "call_id": "596688964710",
                "segment_id": "33",
                "timestamp": "2:15"
              }
            ]
          },
          "student_trigger": "Student expressed: 'I want to get into the education space and ideally I'd like to get in there faster than having to do a full four years first' (call_596697763867, seg_39), revealing desire for expedited pathway while maintaining quality.",
          "consultant_response": "Consultant demonstrated strategic planning: 'We'll use your resume to get you entry towards the course... maximum of eight exemptions... which will take a year off the course for you' (call_596697763867, seg_33).",
          "context_impact": "Critical moment requiring demonstration of program flexibility and accelerated options to secure enrollment while ensuring academic integrity.",
          "recommended_approach": "Include more specific examples of successful pathway acceleration and detailed timeline implications with clear academic quality assurance."
        },
        {
          "id": 3,
          "title": "Career Pathway Navigation",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596617450400",
              "segment_id": "8",
              "timestamp": "01:14"
            },
            "supporting_calls": [
              {
                "call_id": "596554633066",
                "segment_id": "90",
                "timestamp": "7:05"
              }
            ]
          },
          "student_trigger": "Student asked: 'Oh okay, I was just wanting to know the process and how long it would take to become a child psychiatrist' (call_596617450400, seg_8), seeking clear pathway guidance while maintaining appropriate boundaries.",
          "consultant_response": "Consultant effectively outlined: 'You'll be looking at our Graduate Diploma of Psychology...it's very flexible so swimming online you get to pick exactly how you want to study whether it's part-time or full-time' (call_596617450400, seg_27), maintaining appropriate role boundaries.",
          "context_impact": "Critical moment requiring balanced demonstration of educational pathways while directing career-specific guidance to appropriate resources.",
          "recommended_approach": "Include more examples of successful career transitions while clearly delineating educational guidance from career planning support."
        },
        {
          "id": 4,
          "title": "Documentation Process Support",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596462150540",
              "segment_id": "31",
              "timestamp": "01:24"
            },
            "supporting_calls": [
              {
                "call_id": "596461708813",
                "segment_id": "19",
                "timestamp": "01:15"
              }
            ]
          },
          "student_trigger": "Student asked: 'Yeah, if you could send us through the form and which ones you need the course outline for?' (call_596462150540, seg_31), seeking clarity on documentation requirements.",
          "consultant_response": "Consultant provided basic instruction: 'I'll send you the form' (call_596462150540, seg_32), without comprehensive support plan or alternative pathways.",
          "context_impact": "Required clear guidance through administrative requirements to maintain enrollment momentum while reducing anxiety.",
          "recommended_approach": "Develop clearer documentation guidance with specific examples and proactive support mechanisms including alternative verification options."
        },
        {
          "id": 5,
          "title": "Return to Study Support",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596464931404",
              "segment_id": "16",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "596413413034",
                "segment_id": "45",
                "timestamp": "08:30"
              }
            ]
          },
          "student_trigger": "Student voiced: 'I haven't studied for 15 years - I'm worried I won't be able to keep up' (call_596464931404, seg_16), revealing significant anxiety about academic readiness.",
          "consultant_response": "Consultant provided generic acknowledgment: 'Don't worry about that' (call_596464931404, seg_17), without exploring transferable skills or specific support mechanisms.",
          "context_impact": "Critical moment to address confidence barriers through validation of life experience and clear support structures.",
          "recommended_approach": "Utilize targeted questions about work/life experiences to identify transferable skills and build academic confidence through concrete examples."
        },
        {
          "id": 6,
          "title": "Work-Study Balance Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596697763867",
              "segment_id": "50",
              "timestamp": "5:15"
            },
            "supporting_calls": [
              {
                "call_id": "596688964710",
                "segment_id": "172",
                "timestamp": "15:30"
              }
            ]
          },
          "student_trigger": "Student stated: 'I'm really interested in the MBA, but with my current role in management, I'm not sure I can commit to the study hours' (call_596697763867, seg_50), revealing work-study balance concerns.",
          "consultant_response": "Consultant provided basic acknowledgment: 'Yes, it can be challenging' (call_596697763867, seg_51), without exploring specific solutions or support mechanisms.",
          "context_impact": "Critical opportunity to demonstrate program flexibility and support for working professionals while maintaining momentum.",
          "recommended_approach": "Create comprehensive work-study integration plans with specific flexibility options and success strategies from similar students."
        }
      ]
    },
    "verbose": {
      "conversations": [
        {
          "id": 1,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "In call 595732493616 (segment 23), the student expressed significant concern about balancing study with shift work: 'I work rotating shifts at the hospital, not sure how I'll manage study.' This revealed both interest in the program and anxiety about practical implementation. Similar concerns emerged in call 595732548084 (segment 163) where another healthcare worker noted: 'My roster changes every week, and I often work nights.' These moments represented critical opportunities to demonstrate how our program specifically accommodates healthcare professionals' unique scheduling challenges.",
          "consultant_response": "The consultant demonstrated strong understanding of healthcare workflows, responding with: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24). This practical example resonated strongly, with the student responding: 'That actually sounds manageable' (seg_25). In the supporting call, the consultant built on the flexible access theme: 'The beauty of our platform is you can switch between online and offline study. Some students download their materials before night shifts' (call_595732548084, seg_164). Both consultants effectively moved the conversation from 'if' to 'how', directly addressing practical concerns while maintaining momentum.",
          "priority": "high",
          "recommended_approach": "When addressing shift workers' scheduling concerns, always start by acknowledging their specific work pattern before showing how our program design aligns with healthcare workflows. Share concrete examples of how current students manage study around shifts - whether it's downloading materials for night shifts, studying during quiet periods, or breaking study into small blocks between shifts. The key is making flexibility tangible rather than theoretical. For instance, explain how asynchronous learning means no mandatory live sessions, and offline access means study can happen even in areas with poor connectivity. For those with rotating rosters, emphasize how weekly study patterns can adapt to changing schedules. Pay particular attention to students working night shifts or long rotations, showing how our platform's flexibility specifically addresses these challenges. The goal is to transform perceived scheduling barriers into manageable planning opportunities, always grounding explanations in healthcare-specific scenarios that resonate with their experience."
        },
        {
          "id": 2,
          "title": "Strategic Pathway Acceleration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596697763867",
              "segment_id": "39",
              "timestamp": "5:15"
            },
            "supporting_calls": [
              {
                "call_id": "596688964710",
                "segment_id": "33",
                "timestamp": "2:15"
              }
            ]
          },
          "student_trigger": "The conversation reached a critical point when the student expressed: 'I want to get into the education space and ideally I'd like to get in there faster than having to do a full four years first' (call_596697763867, seg_39). This statement revealed both ambition and practical constraints, highlighting the need for a tailored pathway that could expedite their educational journey while maintaining academic integrity. Similar patterns emerged in supporting calls, with students consistently seeking ways to optimize their study timeline while ensuring quality education.",
          "consultant_response": "The consultant demonstrated strong collaborative planning by responding: 'We'll use your resume to get you entry towards the course, we can do that, okay? And then the units that you've passed, you were able to get those off and it will be a maximum of eight exemptions of the old electives which will take a year off the course for you' (call_596697763867, seg_33). This approach effectively balanced acceleration with academic rigor by identifying specific pathways for reducing study time while maintaining program quality. The consultant created immediate value by outlining concrete solutions and establishing a clear path forward.",
          "priority": "high",
          "recommended_approach": "When students express interest in accelerated pathways, immediately validate their ambition while demonstrating concrete options for expedition. Begin by acknowledging their goal: 'I understand you're looking to transition into education efficiently - let's explore how we can optimize your pathway.' Then probe for relevant experience: 'Could you tell me about your current qualifications and work experience? This helps us identify potential credits and exemptions.' Guide the conversation through specific examples: 'For instance, many students with similar experience have received exemptions for units like X and Y, potentially reducing their study time by up to a year.' Remember to balance acceleration with academic integrity: 'While we can streamline your journey through credit recognition, we ensure you gain all essential skills for your education career.' The key is making acceleration tangible through real examples while maintaining academic credibility and demonstrating a clear understanding of the student's professional goals."
        },
        {
          "id": 3,
          "title": "Career Pathway Navigation",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596617450400",
              "segment_id": "8",
              "timestamp": "01:14"
            },
            "supporting_calls": [
              {
                "call_id": "596554633066",
                "segment_id": "90",
                "timestamp": "7:05"
              }
            ]
          },
          "student_trigger": "Multiple students sought guidance on career pathways, exemplified in call 596617450400 (segment 8) when a student asked: 'Oh okay, I was just wanting to know the process and how long it would take to become a child psychiatrist.' These inquiries required careful balance between providing educational guidance while maintaining appropriate professional boundaries.",
          "consultant_response": "The consultants effectively maintained appropriate boundaries while providing valuable educational guidance. In the primary example, the consultant outlined: 'You'll be looking at our Graduate Diploma of Psychology...it's very flexible so swimming online you get to pick exactly how you want to study whether it's part-time or full-time' (call_596617450400, seg_27). This approach successfully focused on educational pathways while avoiding detailed career planning advice.",
          "priority": "high",
          "recommended_approach": "When students seek career pathway guidance, begin by acknowledging their career goals while establishing appropriate boundaries: 'While I can't provide specific career planning advice, I can show you how our programs could support your career aspirations.' Focus discussions on educational pathways rather than detailed career planning. For example: 'Our Graduate Diploma provides the educational foundation many students use on their journey toward psychology careers. Let me show you how our program structure aligns with typical progression paths.' When students seek specific career timelines, redirect appropriately: 'While I can't predict exact career timelines, I can explain how our flexible study options help students progress efficiently through their educational requirements.' Remember to highlight post-enrollment career support services while maintaining pre-enrollment boundaries. The goal is demonstrating program value while ensuring students understand which aspects of career planning happen at which stage of their journey."
        },
        {
          "id": 4,
          "title": "Documentation Process Support",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596462150540",
              "segment_id": "31",
              "timestamp": "01:24"
            },
            "supporting_calls": [
              {
                "call_id": "596461708813",
                "segment_id": "19",
                "timestamp": "01:15"
              }
            ]
          },
          "student_trigger": "Students frequently expressed uncertainty about documentation requirements, exemplified by: 'Yeah, if you could send us through the form and which ones you need the course outline for?' (call_596462150540, seg_31). These moments highlighted the need for clear guidance through administrative processes while maintaining enrollment momentum.",
          "consultant_response": "Consultants often provided basic instructions without comprehensive support plans or alternative options for challenging documentation scenarios. This approach missed opportunities to demonstrate robust support systems and maintain enrollment confidence through administrative complexity.",
          "priority": "high",
          "recommended_approach": "When guiding students through documentation requirements, transform potential barriers into manageable steps through clear support and alternatives. Begin with a comprehensive overview: 'Let me walk you through exactly what documents we need and how we can help you obtain them.' Then create a structured plan: 'First, let's identify which documents you have readily available, then I'll show you options for any that might be challenging to obtain.' Provide specific alternatives: 'If you can't locate your original course outlines, we can often work with academic transcripts or detailed course descriptions.' Share success strategies: 'Many students find it helpful to create a simple checklist - let me share what's worked well for others.' Always maintain forward momentum: 'While we're working on gathering these documents, let's also ensure you feel confident about the program structure and support available.'"
        },
        {
          "id": 5,
          "title": "Return to Study Support",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596464931404",
              "segment_id": "16",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "596413413034",
                "segment_id": "45",
                "timestamp": "08:30"
              }
            ]
          },
          "student_trigger": "Across multiple calls, students expressed significant anxiety about returning to study after extended breaks, exemplified by: 'I haven't studied for 15 years - I'm worried I won't be able to keep up' (call_596464931404, seg_16). These moments revealed deep-seated fears about academic readiness that could significantly impact enrollment decisions.",
          "consultant_response": "Consultants typically provided basic acknowledgments without exploring the deeper implications of these concerns or helping students recognize their transferable skills. The responses missed opportunities to transform anxiety into confidence through validation of life and professional experience.",
          "priority": "high",
          "recommended_approach": "When students express anxiety about returning to study after a long break, begin by validating their feelings while steering the conversation toward empowerment. Start with acknowledgment: 'I understand your concerns about returning to study - many of our most successful students shared similar feelings.' Then guide the discussion toward their experiences: 'Could you tell me about what you've been doing professionally during these years?' This opens the door to identify transferable skills: 'The project management experience you mentioned is exactly what helps our students succeed - you're already using many of the organizational skills needed for academic success.' Use their responses to draw clear parallels with study skills: 'That systematic approach you use in your work is very similar to how our most successful students tackle their assignments.' Share specific examples: 'Many returning students find their professional experience gives them an advantage in understanding complex concepts and managing deadlines effectively.'"
        },
        {
          "id": 6,
          "title": "Work-Study Balance Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596697763867",
              "segment_id": "50",
              "timestamp": "5:15"
            },
            "supporting_calls": [
              {
                "call_id": "596688964710",
                "segment_id": "172",
                "timestamp": "15:30"
              }
            ]
          },
          "student_trigger": "Multiple students expressed similar concerns about balancing professional commitments with study requirements. A key example was: 'I'm really interested in the MBA, but with my current role in management, I'm not sure I can commit to the study hours' (call_596697763867, seg_50). These statements consistently revealed both interest in programs and anxiety about managing work-study balance.",
          "consultant_response": "Consultants often provided limited responses without exploring flexible study options or demonstrating understanding of professional demands. This gap left core concerns about work-study balance unaddressed and missed opportunities to showcase program adaptability.",
          "priority": "high",
          "recommended_approach": "When addressing work-study balance concerns, begin by validating their professional situation: 'Many of our successful students are working managers like yourself - let me show you how they maintain both career momentum and academic progress.' Create a collaborative exploration of their specific challenges: 'What aspects of your current role seem most challenging to balance with study?' Then demonstrate concrete solutions: 'Our flexible study options include recorded lectures, mobile learning platforms, and the ability to adjust your study load each semester based on work demands.' Share specific success stories: 'One of our current MBA students in senior management completes coursework during quieter periods and uses our mobile platform during business travel.' Always highlight support systems: 'You'll have access to academic success coaches who specialize in helping professionals optimize their study patterns around work commitments.' The key is making flexibility tangible while showing deep understanding of professional demands."
        }
      ]
    }
  }
}