{
  "metadata": {
    "consultant_name": "Stephen Taylor",
    "week_number": 16,
    "date_range": "02-10_02-14",
    "report_type": "Collaborative Planning"
  },
  "total_number_of_calls": 246,
  "team_average_total_number_of_calls_per_sales_consultant": 242.8125,
  "number_of_calls_over_2_minutes": {
    "absolute_number": 71,
    "team_average_absolute_number": 62.3125
  },
  "percent_of_calls_over_2_minutes": {
    "percentage": 28.86178861788618,
    "team_average_percentage": 25.75705321113411
  },
  "number_of_calls_under_2_minutes": {
    "absolute_number": 175,
    "team_average_absolute_number": 180.5
  },
  "percent_of_calls_under_2_minutes": {
    "percentage": 71.13821138211382,
    "team_average_percentage": 74.2429467888659
  },
  "average_talking_percentage": {
    "individual_average": 53.024319599091974,
    "team_average": 53.5140458127338
  },
  "excluded_transcripts": {
    "individual_excluded_transcripts": 175,
    "team_total_excluded_transcripts": 2888
  },
  "behavioral_scores": [
    {
      "label": "week-11_01-06_01-10",
      "average_final_ranking_score_eligible_transcripts": 173.69,
      "average_final_ranking_score_all_transcripts_over_2_mins": 100.69,
      "team_average_final_ranking_score_eligible_transcripts": 174.2,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 118.12
    },
    {
      "label": "week-12_01-13_01-17",
      "average_final_ranking_score_eligible_transcripts": 124.05,
      "average_final_ranking_score_all_transcripts_over_2_mins": 94.05,
      "team_average_final_ranking_score_eligible_transcripts": 157.75,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 113.37
    },
    {
      "label": "week-13_01-20_01-24",
      "average_final_ranking_score_eligible_transcripts": 119.27,
      "average_final_ranking_score_all_transcripts_over_2_mins": 106.77,
      "team_average_final_ranking_score_eligible_transcripts": 162.74,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 120.37
    },
    {
      "label": "week-14_01-27_01-31",
      "average_final_ranking_score_eligible_transcripts": 214.57,
      "average_final_ranking_score_all_transcripts_over_2_mins": 116.23,
      "team_average_final_ranking_score_eligible_transcripts": 155.43,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 112.46
    },
    {
      "label": "week-15_02-03_02-07",
      "average_final_ranking_score_eligible_transcripts": 162.63,
      "average_final_ranking_score_all_transcripts_over_2_mins": 127.86,
      "team_average_final_ranking_score_eligible_transcripts": 157.11,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 113.21
    },
    {
      "label": "week-16_02-10_02-14",
      "average_final_ranking_score_eligible_transcripts": 108.5,
      "average_final_ranking_score_all_transcripts_over_2_mins": 87.2,
      "team_average_final_ranking_score_eligible_transcripts": 163.3,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 109.25
    }
  ],
  "themes": {
    "positive": [
      {
        "headline": "Strategic Pathway Planning",
        "explanation": "Consultants effectively create personalized educational pathways that balance immediate constraints with long-term aspirations while maintaining enrollment momentum through practical solutions and clear progression options"
      },
      {
        "headline": "Flexible Study Integration",
        "explanation": "Strong demonstration of how program flexibility accommodates diverse student circumstances including work schedules, family commitments, and personal challenges through tailored solutions and specific examples"
      },
      {
        "headline": "Assessment Confidence Building",
        "explanation": "Effective use of comparative analysis, success metrics and relatable examples to transform assessment concerns into manageable challenges while maintaining momentum through concrete strategies"
      }
    ],
    "improvement": [
      {
        "headline": "Career Development Integration",
        "explanation": "Enhanced exploration needed of how program elements align with specific workplace challenges and career transition goals through concrete examples and pathways that demonstrate practical value"
      },
      {
        "headline": "Work-Study Balance Support",
        "explanation": "More comprehensive support needed for balancing professional commitments with study requirements through specific strategies, success stories and proactive planning approaches"
      },
      {
        "headline": "Documentation Process Planning",
        "explanation": "Clearer guidance required for complex documentation scenarios with specific alternative pathways, timeline management and proactive support solutions to maintain enrollment momentum"
      }
    ]
  },
  "conversation_analysis": {
    "condensed": {
      "conversations": [
        {
          "id": 1,
          "title": "Assessment Confidence Building",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596267908284",
              "segment_id": "89",
              "timestamp": "07:33"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student asked: 'And how tough is this exam, if you can compare it with the IELTS test?' (call_596267908284, seg_89), revealing anxiety about assessment difficulty through comparison to familiar benchmark.",
          "consultant_response": "Consultant effectively responded: 'Oh, it's not academic, so it's not going to be as difficult as doing an IELTS test. It's got an incredibly high pass rate, it's like a 95% pass rate' (call_596267908284, seg_90), using familiar comparison and success metrics to build confidence.",
          "context_impact": "Critical moment requiring clear comparison to transform assessment anxiety into confidence while maintaining enrollment momentum through relatable examples.",
          "recommended_approach": "Include more specific preparation strategies and examples of successful student experiences with similar concerns, particularly for international students transitioning to different assessment styles."
        },
        {
          "id": 2,
          "title": "International Qualification Recognition",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596253417656",
              "segment_id": "28",
              "timestamp": "1:38"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'So I've got my diploma but it was translated from UK over to here. Does that still count?' (call_596253417656, seg_28), revealing critical need for clarity on international qualification recognition process.",
          "consultant_response": "Consultant outlined clear process: 'If it's a CEQA approved, then we have a case because if a CEQA come back and say, yes, it's the same as a Diploma of Early Childhood, we might be able to present that to the course coordinator' (call_596253417656, seg_32), effectively mapping next steps.",
          "context_impact": "Key moment requiring clear guidance on qualification recognition process to maintain enrollment momentum while building confidence in institutional support systems.",
          "recommended_approach": "Include specific timelines for assessment process, examples of successful international qualification recognitions, and clear explanation of alternative pathways if needed."
        },
        {
          "id": 3,
          "title": "Career Development Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596091299416",
              "segment_id": "58",
              "timestamp": "7:45"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed: 'I want to advance my career but I'm worried about balancing study with my current role' (call_596091299416, seg_58), revealing dual concerns about career advancement and study management.",
          "consultant_response": "Consultant provided immediate action plan: 'If you're ready to start in March then all you've got to do is send me your diploma documents. And I'll assess them all for you' (call_596091299416, seg_80), showing confidence but missing work-study balance discussion.",
          "context_impact": "Critical opportunity to demonstrate program's ability to support career growth while addressing practical study-work balance concerns through targeted solutions.",
          "recommended_approach": "Expand discussion of specific study-work integration strategies and provide examples of successful career advancement pathways with clear milestones."
        },
        {
          "id": 4,
          "title": "Teaching Pathway Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596091169745",
              "segment_id": "7",
              "timestamp": "00:45"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'I have an inquiry in doing my Bachelor of Teaching or Master of Teaching. I don't know where I will be eligible' (call_596091169745, seg_7), revealing uncertainty about qualification pathways and program options.",
          "consultant_response": "Consultant provided pathway options: 'So if you apply for the bachelor's degree, you can do the primary and early childhood course' (call_596091169745, seg_43), but missed opportunity for deeper exploration of teaching interests.",
          "context_impact": "Clear guidance on eligibility and pathways was crucial for building student confidence in program fit and maintaining enrollment momentum through structured planning.",
          "recommended_approach": "Include more detailed exploration of teaching area preferences, long-term career goals, and specific examples of successful progression through each pathway option with clear timelines."
        },
        {
          "id": 5,
          "title": "Work-Study Balance",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596091299416",
              "segment_id": "58",
              "timestamp": "7:45"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed: 'I want to advance my career but I'm worried about balancing study with my current role' (call_596091299416, seg_58), revealing critical need for practical study management strategies.",
          "consultant_response": "Consultant focused on administrative steps without addressing balance concerns: 'if you're ready to start in March then all you've got to do is send me your diploma documents' (call_596091299416, seg_80), missing chance to address practical concerns.",
          "context_impact": "Key opportunity to demonstrate program's flexibility and comprehensive support for working professionals while maintaining enrollment momentum through specific solutions.",
          "recommended_approach": "Provide specific examples and strategies for managing work-study balance successfully, including time management techniques, support resources, and success stories from similar students."
        },
        {
          "id": 6,
          "title": "Documentation Process Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595907804215",
              "segment_id": "299",
              "timestamp": "27:45"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed: 'Okay, yes, I just need to get my transcript to just in a piece and do that and also declare, yeah' (call_595907804215, seg_299), showing uncertainty about documentation requirements and process steps.",
          "consultant_response": "Consultant offered basic guidance: 'I'm just going to send you an email just confirming what you've got to do next' (call_595907804215, seg_301), without providing comprehensive support or exploring potential challenges.",
          "context_impact": "Clear documentation guidance directly impacts enrollment completion rates and student confidence in managing requirements while maintaining momentum through structured support.",
          "recommended_approach": "Develop comprehensive documentation support approach with clear milestones, contingency planning, and proactive assistance mechanisms to ensure successful completion."
        }
      ]
    },
    "verbose": {
      "conversations": [
        {
          "id": 1,
          "title": "Assessment Confidence Building",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596267908284",
              "segment_id": "89",
              "timestamp": "07:33"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student expressed anxiety about assessment requirements by asking 'And how tough is this exam, if you can compare it with the IELTS test?' (call_596267908284, seg_89). This revealed both their desire to understand academic expectations and their need for relatable comparisons to build confidence. The IELTS reference provided a valuable framework for explaining the assessment approach while indicating possible international student status.",
          "consultant_response": "The consultant demonstrated strong collaborative planning by immediately addressing the concern with clear, comparative information: 'Oh, it's not academic, so it's not going to be as difficult as doing an IELTS test. It's got an incredibly high pass rate, it's like a 95% pass rate' (call_596267908284, seg_90). This response effectively reduced anxiety by providing both a familiar comparison point and concrete success metrics, helping transform perceived barriers into manageable challenges while maintaining enrollment momentum.",
          "priority": "high",
          "recommended_approach": "When addressing assessment concerns, begin by acknowledging the student's frame of reference and using it to build understanding. Start with validating their question: 'That's a great comparison point with IELTS - let me explain how our assessment differs.' Then provide specific, confidence-building information: 'Our assessment focuses on your natural teaching aptitude rather than academic language skills, which many students find more approachable.' Always include concrete success metrics: 'Our 95% pass rate reflects how well students perform when they understand what's expected.' Pay particular attention to international students comparing to language tests, helping them understand the different nature of personality-based assessments. Share specific examples of successful student experiences, such as: 'Many of our international students find this assessment more comfortable than IELTS because it aligns with their practical experience.' Throughout the discussion, maintain focus on building confidence while providing realistic expectations and clear preparation strategies."
        },
        {
          "id": 2,
          "title": "International Qualification Recognition",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596253417656",
              "segment_id": "28",
              "timestamp": "1:38"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student expressed uncertainty about their international credentials: 'So I've got my diploma but it was translated from UK over to here. Does that still count?' (call_596253417656, seg_28). This revealed both their proactive approach to understanding requirements and their concern about qualification recognition. The question represented a critical moment where clear guidance could either build confidence or create barriers to enrollment.",
          "consultant_response": "The consultant demonstrated strong collaborative planning by outlining a clear pathway: 'If it's a CEQA approved, then we have a case because if a CEQA come back and say, yes, it's the same as a Diploma of Early Childhood, we might be able to present that to the course coordinator.' This response effectively addressed the immediate concern while mapping out next steps, showing institutional support for international students' needs.",
          "priority": "high",
          "recommended_approach": "When addressing international qualification concerns, begin by affirming the value of their prior education while outlining our recognition process. Start with validating their academic history: 'Your international qualifications are valuable to us - let's explore how they align with our program requirements.' Guide the conversation with focused questions about their qualifications: 'Could you tell me more about your diploma's content and when you completed it?' Always provide clear timelines for the assessment process: 'The CEQA assessment typically takes X weeks, and during that time we can explore other aspects of your application.' When explaining requirements, frame them as quality assurance measures rather than barriers: 'Our assessment process ensures your qualifications receive appropriate recognition.' Throughout the conversation, maintain momentum by outlining clear next steps and available support resources. The goal is to transform qualification concerns into a structured pathway forward, always highlighting how our processes support international students' success."
        },
        {
          "id": 3,
          "title": "Career Development Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596091299416",
              "segment_id": "58",
              "timestamp": "7:45"
            },
            "supporting_calls": []
          },
          "student_trigger": "During call 596091299416 (segment 58), the student expressed both ambition and concern: 'I want to advance my career but I'm worried about balancing study with my current role.' This moment represented a critical juncture where addressing both the career advancement goals and practical concerns about study-work balance could significantly influence their enrollment decision.",
          "consultant_response": "The consultant focused primarily on immediate action steps: 'A hundred percent yeah...if you're ready to start in March then all you've got to do is send me your diploma documents. And I'll assess them all for you.' While this showed confidence in the student's ability to succeed, it missed the opportunity to address their work-study balance concerns comprehensively.",
          "priority": "high",
          "recommended_approach": "When students express career advancement goals alongside practical concerns, start by acknowledging both aspects: 'It's exciting that you're looking to advance your career - let's explore how our program can support your goals while fitting with your current work commitments.' Guide the conversation with strategic questions about their career aspirations: 'What specific career opportunities are you hoping to pursue?' and work patterns: 'Could you tell me about your typical work schedule?' Use this information to demonstrate program flexibility: 'Many of our working professionals find success by utilizing our flexible assessment deadlines and downloading materials for offline study during quiet periods.' Always connect program features to career benefits: 'This unit on advanced project management aligns perfectly with senior roles in your industry.' When discussing work-study balance, share specific examples: 'One of our current students in a similar role manages their studies by dedicating two evenings per week and Sunday mornings to coursework.' The key is creating a clear vision of how the program can advance their career while fitting into their current life."
        },
        {
          "id": 4,
          "title": "Teaching Pathway Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596091169745",
              "segment_id": "7",
              "timestamp": "00:45"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student expressed uncertainty about program options: 'I have an inquiry in doing my Bachelor of Teaching or Master of Teaching. I don't know where I will be eligible' (call_596091169745, seg_7). This revealed both interest in teaching and uncertainty about qualification pathways, creating an opportunity for comprehensive pathway planning.",
          "consultant_response": "While the consultant outlined basic options: 'So if you apply for the bachelor's degree, you can do the primary and early childhood course', they missed the opportunity to explore the student's teaching interests, experience, and long-term career goals to provide more targeted guidance.",
          "priority": "high",
          "recommended_approach": "When discussing teaching pathways, begin by exploring the student's teaching interests and background: 'Let's discuss your experience with different age groups and what aspects of teaching most interest you.' Use their responses to guide pathway recommendations: 'Based on your interest in early childhood development, the bachelor's pathway with dual qualification could align well with your goals.' Share specific examples of successful progressions: 'Many of our current students chose this pathway because it provides both theoretical foundations and practical classroom experience across age groups.' When explaining program options, connect them to career opportunities: 'The dual qualification structure means you'll be prepared for both early childhood and primary settings, maximizing your employment options.' Throughout the discussion, maintain focus on their individual circumstances while demonstrating how each pathway supports different career objectives. The goal is transforming program selection from a confusing choice into a clear pathway aligned with their teaching aspirations."
        },
        {
          "id": 5,
          "title": "Work-Study Balance",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596091299416",
              "segment_id": "58",
              "timestamp": "7:45"
            },
            "supporting_calls": []
          },
          "student_trigger": "In call 596091299416 (segment 58), the student expressed concern about managing commitments: 'I want to advance my career but I'm worried about balancing study with my current role.' This revealed an important need to demonstrate how our program can accommodate working professionals while maintaining academic progress.",
          "consultant_response": "The consultant focused primarily on administrative next steps: 'if you're ready to start in March then all you've got to do is send me your diploma documents.' This response missed the opportunity to address the student's concerns about work-study balance and provide practical management strategies.",
          "priority": "high",
          "recommended_approach": "When students raise work-study balance concerns, begin by validating their experience: 'Many of our successful students are working professionals like yourself - let's explore how our flexible study options can work with your schedule.' Ask specific questions about their work patterns: 'Could you tell me about your typical work hours and any seasonal busy periods?' Use this information to tailor solutions: 'With your Thursday evening shifts, you might find our Sunday workshop sessions particularly valuable.' Share concrete examples from similar students: 'One of our current students in your industry successfully manages their studies by downloading materials for offline study during quiet periods and utilizing our flexible assessment deadlines during busy work times.' When discussing study commitments, be specific: 'Most students find dedicating 10-12 hours per week works well, and our learning advisors can help you create a schedule that fits your work pattern.' Throughout the conversation, emphasize how our support services and flexible options specifically address work-study balance challenges."
        },
        {
          "id": 6,
          "title": "Documentation Process Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595907804215",
              "segment_id": "299",
              "timestamp": "27:45"
            },
            "supporting_calls": []
          },
          "student_trigger": "During call 595907804215 (segment 299), the student showed uncertainty about documentation requirements: 'Okay, yes, I just need to get my transcript to just in a piece and do that and also declare, yeah.' This moment revealed both willingness to proceed and need for clear guidance on documentation processes to maintain enrollment momentum.",
          "consultant_response": "The consultant provided minimal guidance: 'I'm just going to send you an email just confirming what you've got to do next.' This basic response missed the opportunity to provide comprehensive support and explore potential documentation challenges that could impact enrollment progress.",
          "priority": "high",
          "recommended_approach": "When guiding students through documentation requirements, begin by creating a clear, structured process that anticipates and addresses potential challenges. Start with acknowledgment: 'Documentation can seem overwhelming, but we'll break it down into manageable steps.' Create a detailed timeline: 'Let's outline what documents you need now for enrollment, and what can be submitted later.' Provide specific guidance: 'For your transcript request, I can show you exactly what to ask for and help you draft the email if needed.' When discussing requirements, include alternatives: 'If you can't obtain original documents, we have several other acceptable options we can explore.' The key is transforming documentation from a potential barrier into a clear, achievable process. Maintain momentum through proactive support: 'I'll send you our comprehensive documentation guide, and we can schedule a quick check-in next week to review your progress.' Always include contingency planning: 'If you encounter any difficulties obtaining documents, let's discuss alternative options early so we can maintain your enrollment timeline.' The goal is ensuring students feel supported while maintaining clear progress toward enrollment completion."
        }
      ]
    }
  }
}