{
  "metadata": {
    "consultant_name": "Valentina William",
    "week_number": 16,
    "date_range": "02-10_02-14",
    "report_type": "Collaborative Planning"
  },
  "total_number_of_calls": 243,
  "team_average_total_number_of_calls_per_sales_consultant": 242.8125,
  "number_of_calls_over_2_minutes": {
    "absolute_number": 60,
    "team_average_absolute_number": 62.3125
  },
  "percent_of_calls_over_2_minutes": {
    "percentage": 24.691358024691358,
    "team_average_percentage": 25.75705321113411
  },
  "number_of_calls_under_2_minutes": {
    "absolute_number": 183,
    "team_average_absolute_number": 180.5
  },
  "percent_of_calls_under_2_minutes": {
    "percentage": 75.30864197530865,
    "team_average_percentage": 74.2429467888659
  },
  "average_talking_percentage": {
    "individual_average": 51.30741139648274,
    "team_average": 53.5140458127338
  },
  "excluded_transcripts": {
    "individual_excluded_transcripts": 183,
    "team_total_excluded_transcripts": 2888
  },
  "behavioral_scores": [
    {
      "label": "week-11_01-06_01-10",
      "average_final_ranking_score_eligible_transcripts": 163.03,
      "average_final_ranking_score_all_transcripts_over_2_mins": 143.59,
      "team_average_final_ranking_score_eligible_transcripts": 174.2,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 118.12
    },
    {
      "label": "week-12_01-13_01-17",
      "average_final_ranking_score_eligible_transcripts": 157.33,
      "average_final_ranking_score_all_transcripts_over_2_mins": 107.24,
      "team_average_final_ranking_score_eligible_transcripts": 157.75,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 113.37
    },
    {
      "label": "week-13_01-20_01-24",
      "average_final_ranking_score_eligible_transcripts": 141.2,
      "average_final_ranking_score_all_transcripts_over_2_mins": 114.26,
      "team_average_final_ranking_score_eligible_transcripts": 162.74,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 120.37
    },
    {
      "label": "week-14_01-27_01-31",
      "average_final_ranking_score_eligible_transcripts": 115.03,
      "average_final_ranking_score_all_transcripts_over_2_mins": 122.83,
      "team_average_final_ranking_score_eligible_transcripts": 155.43,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 112.46
    },
    {
      "label": "week-15_02-03_02-07",
      "average_final_ranking_score_eligible_transcripts": 151.59,
      "average_final_ranking_score_all_transcripts_over_2_mins": 109.35,
      "team_average_final_ranking_score_eligible_transcripts": 157.11,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 113.21
    },
    {
      "label": "week-16_02-10_02-14",
      "average_final_ranking_score_eligible_transcripts": 148.92,
      "average_final_ranking_score_all_transcripts_over_2_mins": 98.16,
      "team_average_final_ranking_score_eligible_transcripts": 163.3,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 109.25
    }
  ],
  "themes": {
    "positive": [
      {
        "headline": "Strategic Pathway Planning",
        "explanation": "Consultants effectively create personalized educational pathways that balance immediate constraints with long-term aspirations while maintaining clear progression steps and enrollment momentum"
      },
      {
        "headline": "Flexible Study Integration",
        "explanation": "Strong demonstration of how program flexibility accommodates diverse student circumstances through concrete examples and practical solutions that transform perceived barriers into manageable opportunities"
      },
      {
        "headline": "Experience Recognition Integration",
        "explanation": "Skillful validation of prior learning and professional experience while creating clear pathways for academic recognition and highlighting immediate benefits"
      }
    ],
    "improvement": [
      {
        "headline": "Career Development Integration",
        "explanation": "Enhanced exploration needed of how program elements align with specific career transition goals while maintaining appropriate pre-enrollment boundaries"
      },
      {
        "headline": "Initial Uncertainty Management",
        "explanation": "Stronger acknowledgment required of emotional concerns and overwhelm before transitioning to practical solutions and support referrals"
      },
      {
        "headline": "Administrative Process Resolution",
        "explanation": "More comprehensive support needed for documentation and system access challenges with clearer immediate solutions and specific timelines"
      }
    ]
  },
  "conversation_analysis": {
    "condensed": {
      "conversations": [
        {
          "id": 1,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "Student stated: 'I work rotating shifts at the hospital, not sure how I'll manage study' (call_595732493616, seg_23), followed by similar concerns from other healthcare workers: 'My roster changes every week' (call_595732548084, seg_163), revealing critical scheduling flexibility needs.",
          "consultant_response": "Consultant provided practical solution: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24), effectively showing real-world flexibility.",
          "context_impact": "These moments required demonstrating how program flexibility specifically accommodates healthcare professionals' complex schedules to maintain enrollment momentum.",
          "recommended_approach": "Include more specific examples of successful study patterns from current healthcare students, particularly highlighting night shift management strategies."
        },
        {
          "id": 2,
          "title": "Strategic Credit Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595908094887",
              "segment_id": "31",
              "timestamp": "03:45"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student asked: 'I have a diploma in early childhood education and care would that be able to give me credit?' (call_595908094887, seg_31), seeking to leverage prior learning.",
          "consultant_response": "Consultant provided concrete timeline: 'Of course, so a diploma of early childhood education and care takes off one year of studies for you. So the full degree is normally four years. So it'll only be three years for you to complete' (call_595908094887, seg_32).",
          "context_impact": "Recognition of prior learning was critical for demonstrating program efficiency and value while maintaining enrollment momentum.",
          "recommended_approach": "Include more specific examples of how credits enhance career progression pathway while maintaining pre-enrollment boundaries."
        },
        {
          "id": 3,
          "title": "Course Format Clarity",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595908076000",
              "segment_id": "20",
              "timestamp": "02:08"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student asked: 'I was just wondering, like, how much of it is online? How much is, like, in class and all that stuff?' (call_595908076000, seg_20), indicating need for practical understanding.",
          "consultant_response": "Consultant clearly explained: 'We are 100% an online institution... all your learning will take place on what is known as the student hub' (call_595908076000, seg_23), establishing clear expectations.",
          "context_impact": "Clear understanding of course delivery format was crucial for student confidence in managing online study successfully.",
          "recommended_approach": "Explore student's specific scheduling needs to personalize explanation of online learning benefits and practical implementation."
        },
        {
          "id": 4,
          "title": "Managing Initial Uncertainty",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596178992779",
              "segment_id": "13",
              "timestamp": "00:38"
            },
            "supporting_calls": [
              {
                "call_id": "596178627320",
                "segment_id": "25",
                "timestamp": "1:35"
              }
            ]
          },
          "student_trigger": "Student stated: 'I just, I need to sit down and have a little bit more of a look through everything' (call_596178992779, seg_13), revealing overwhelm with enrollment process.",
          "consultant_response": "Consultant replied: 'Yeah, so the people that should be your main point of contact from there is your student advisors team' (call_596178992779, seg_20), focusing on referral without addressing immediate concerns.",
          "context_impact": "Critical moment requiring careful acknowledgment of emotional state before transitioning to practical solutions.",
          "recommended_approach": "Address emotional state before referral: 'I understand this feels overwhelming. Let's clarify what you've completed and what steps remain ahead.'"
        },
        {
          "id": 5,
          "title": "System Access Resolution",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596178661371",
              "segment_id": "20",
              "timestamp": "00:33"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed: 'I've recently enrolled but haven't got any ID to put in' (call_596178661371, seg_12), needing immediate login assistance.",
          "consultant_response": "Consultant provided basic referral without immediate assistance or clear next steps for access resolution.",
          "context_impact": "Swift resolution of access issues critically affects student's initial experience and engagement with the institution.",
          "recommended_approach": "Provide immediate ID access solution while explaining broader support system navigation and specific resolution timeline."
        },
        {
          "id": 6,
          "title": "Career Change Navigation",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596104907590",
              "segment_id": "98",
              "timestamp": "10:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student shared: 'Well I just completed my Diploma of Biomed Science. I was tossing up between going into OT and that's just a path that kind of hasn't really worked out for me' (call_596104907590, seg_98).",
          "consultant_response": "Consultant acknowledged prior learning but missed opportunity to explore career transition motivations within appropriate boundaries.",
          "context_impact": "Supporting career transitions effectively while maintaining appropriate pre-enrollment guidance boundaries.",
          "recommended_approach": "Engage in appropriate career discussion within pre-enrollment boundaries while ensuring proper referral to specialized support services."
        }
      ]
    },
    "verbose": {
      "conversations": [
        {
          "id": 1,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595732493616",
              "segment_id": "23",
              "timestamp": "02:15"
            },
            "supporting_calls": [
              {
                "call_id": "595732548084",
                "segment_id": "163",
                "timestamp": "03:45"
              }
            ]
          },
          "student_trigger": "Healthcare workers across multiple calls expressed concerns about balancing study with shift work schedules. The primary example came when a student stated 'I work rotating shifts at the hospital, not sure how I'll manage study' (call_595732493616, seg_23). This was echoed in another call where a student mentioned 'My roster changes every week' (call_595732548084, seg_163), indicating a consistent pattern of scheduling concerns among healthcare professionals.",
          "consultant_response": "Consultants demonstrated strong understanding of healthcare workflows, with one responding effectively: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24). This practical approach resonated strongly with students, as evidenced by responses like 'That actually sounds manageable.' Consultants consistently moved conversations from 'if' to 'how,' directly addressing practical concerns while maintaining momentum.",
          "priority": "high",
          "recommended_approach": "When addressing shift workers' scheduling concerns, always start by acknowledging their specific work pattern before showing how our program design aligns with healthcare workflows. Share concrete examples of how current students manage study around shifts - whether it's downloading materials for night shifts, studying during quiet periods, or breaking study into small blocks between shifts. The key is making flexibility tangible rather than theoretical. For instance, explain how asynchronous learning means no mandatory live sessions, and offline access means study can happen even in areas with poor connectivity. For those with rotating rosters, emphasize how weekly study patterns can adapt to changing schedules. Pay particular attention to students working night shifts or long rotations, showing how our platform's flexibility specifically addresses these challenges. The goal is to transform perceived scheduling barriers into manageable planning opportunities, always grounding explanations in healthcare-specific scenarios that resonate with their experience."
        },
        {
          "id": 2,
          "title": "Strategic Credit Planning",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595908094887",
              "segment_id": "31",
              "timestamp": "03:45"
            },
            "supporting_calls": []
          },
          "student_trigger": "At segment 31 in call 595908094887, the student inquired: 'I have a diploma in early childhood education and care would that be able to give me credit?' This question represented a critical moment where the student sought to understand how their prior learning could be leveraged in their new academic journey. The inquiry demonstrated both pragmatic planning and a desire to efficiently progress toward their educational goals.",
          "consultant_response": "The consultant provided a clear and encouraging response: 'Of course, so a diploma of early childhood education and care takes off one year of studies for you. So the full degree is normally four years. So it'll only be three years for you to complete' (segment 32). This response effectively demonstrated collaborative planning by immediately translating the credit recognition into tangible timeline benefits. The consultant's approach validated the student's prior learning while providing specific information about how it would accelerate their journey.",
          "priority": "high",
          "recommended_approach": "When discussing credit transfers, focus on clear program timelines while respecting role boundaries. Begin by acknowledging prior learning: 'Your diploma represents valuable academic achievement that can significantly reduce your study time.' Then outline specific benefits: 'This prior learning typically takes one year off your total study time, meaning you could complete the degree in three years instead of four.' Create clear connections to student goals: 'This means you could be advancing your career with a bachelor's degree a full year earlier.' Always maintain focus on program structure and enrollment-relevant information: 'Let me outline exactly how your diploma credits would fit into the program structure.' The key is demonstrating immediate value while directing detailed career progression questions to post-enrollment support services. Remember to emphasize the efficiency gained through credit recognition while maintaining appropriate pre-enrollment guidance boundaries."
        },
        {
          "id": 3,
          "title": "Course Format Clarity",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "595908076000",
              "segment_id": "20",
              "timestamp": "02:08"
            },
            "supporting_calls": []
          },
          "student_trigger": "Early in the conversation, the student sought clarity about course delivery with the question: 'I was just wondering, like, how much of it is online? How much is, like, in class and all that stuff?' (call_595908076000, seg_20). This foundational question revealed the student's need to understand the practical aspects of course delivery and how it would fit into their life. The hesitant phrasing suggested some uncertainty about online learning, making this a crucial moment for building confidence in the program's structure.",
          "consultant_response": "The consultant provided clear, comprehensive information: 'We are 100% an online institution, so there is no in-person activities at all. So all your learning will take place on what is known as the student hub.' This response effectively established the online nature of the program while introducing the learning platform in an accessible way. The consultant's straightforward approach helped set clear expectations while making the online learning environment seem approachable and manageable.",
          "priority": "high",
          "recommended_approach": "When explaining course format, start by acknowledging the importance of understanding how learning will take place: 'That's a great question, and it's crucial to understand how our online learning works.' Begin with the foundational structure: 'We're a 100% online institution, which means you have complete flexibility in where and when you study.' Then, make the online environment tangible: 'Think of our student hub as your digital campus - it's where you'll find your learning materials, join discussion forums, and connect with classmates and instructors.' Share specific examples of how students engage: 'Many students download their weekly materials on Sunday evening, participate in online discussions mid-week, and complete assignments at times that suit their schedule.' The key is helping students visualize themselves succeeding in an online learning environment while maintaining appropriate pre-enrollment focus."
        },
        {
          "id": 4,
          "title": "Managing Initial Uncertainty",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596178992779",
              "segment_id": "13",
              "timestamp": "00:38"
            },
            "supporting_calls": [
              {
                "call_id": "596178627320",
                "segment_id": "25",
                "timestamp": "1:35"
              }
            ]
          },
          "student_trigger": "During initial enrollment discussions, multiple students expressed uncertainty about next steps. The primary example occurred when a student stated 'I just, I need to sit down and have a little bit more of a look through everything' (call_596178992779, seg_13), revealing overwhelm about the process. This was reinforced by another student who mentioned 'I have been tossing and turning for a while now' (call_596178627320, seg_25), indicating a broader pattern of students seeking clarity and reassurance during early enrollment stages.",
          "consultant_response": "Consultants typically moved quickly to referral solutions, as seen when one responded with 'Yeah, so the people that should be your main point of contact from there is your student advisors team' (call_596178992779, seg_20). While this provided practical next steps, it often missed addressing students' immediate emotional states and need for clarity. The responses focused on delegation rather than collaborative exploration of concerns.",
          "priority": "high",
          "recommended_approach": "When students express feeling overwhelmed about the enrollment process, begin by acknowledging their emotional state before moving to practical solutions. Start with validation: 'I understand this process can feel overwhelming - many students feel the same way at first. Let's take a moment to clarify what you've completed and what's still ahead.' This creates space for collaborative planning while showing empathy. Follow up with specific questions about what aspects feel most challenging, using responses to guide the discussion. For example, if they mention documentation concerns, outline the process step-by-step while highlighting available support at each stage. When referral to student advisors is needed, frame it as additional support rather than a handoff: 'Now that we've clarified the steps, I'd like to connect you with our student advisors who can provide even more detailed guidance as you move forward.' This approach maintains engagement while ensuring students feel supported rather than simply redirected."
        },
        {
          "id": 5,
          "title": "System Access Resolution",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596178661371",
              "segment_id": "20",
              "timestamp": "00:33"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student expressed immediate concern about system access: 'I haven't got any ID to put in' (call_596178661371, seg_12). This fundamental access issue represented a critical moment in the student's initial engagement with the institution, requiring swift and clear resolution to maintain confidence in their enrollment decision.",
          "consultant_response": "The consultant provided basic referral without offering immediate assistance or clear expectations about resolution timeline. This approach missed the opportunity to demonstrate proactive support and left the student without immediate steps they could take to resolve their access issues.",
          "priority": "high",
          "recommended_approach": "When addressing ID access issues, recognize that these moments significantly impact a student's confidence in institutional support systems. Begin with immediate reassurance: 'I understand how frustrating it is not being able to access your account. Let me help you resolve this right away.' Follow with clear, actionable steps: 'First, I'll provide your student ID number now, and then we'll ensure you have everything else you need to access your account.' During the resolution process, use the time to orient the student to the support ecosystem: 'While we're getting this sorted, let me explain how our different support teams work together to help you succeed.' Always provide specific timeframes: 'You should have full system access within the next two hours, but if you don't, here's my direct number to follow up.' The goal is to transform a potential point of frustration into a demonstration of the institution's comprehensive support system."
        },
        {
          "id": 6,
          "title": "Career Change Navigation",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596104907590",
              "segment_id": "98",
              "timestamp": "10:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student revealed a significant career transition moment: 'Well I just completed my Diploma of Biomed Science. I was tossing up between going into OT and that's just a path that kind of hasn't really worked out for me' (call_596104907590, seg_98). This disclosure represented a crucial opportunity to explore the student's career redirection while maintaining appropriate pre-enrollment boundaries.",
          "consultant_response": "The consultant's response focused primarily on administrative aspects of prior learning recognition without adequately exploring the career transition aspects within appropriate boundaries. This missed the opportunity to engage in appropriate career discussion while ensuring proper referral to specialized support services.",
          "priority": "high",
          "recommended_approach": "When students indicate career transitions, maintain clear pre-enrollment boundaries while providing appropriate guidance. Begin with acknowledgment: 'Completing your Diploma in Biomed Science is a significant achievement. Let me show you how this prior learning can benefit you in our program.' Guide the conversation through program structure: 'Our program includes units that build on your science background while introducing new perspectives.' When career questions arise, provide appropriate referral: 'After enrollment, our career advisors can provide detailed guidance on professional pathways and specializations.' Throughout the conversation, validate their decision to change paths while maintaining focus on program benefits: 'Many of our students successfully transition between fields, and our learning advisors can help you develop specific strategies after enrollment.' The key is providing appropriate pre-enrollment guidance while ensuring proper referral to specialized career support services."
        }
      ]
    }
  }
}