{
  "metadata": {
    "consultant_name": "Pawan Thapa",
    "week_number": 18,
    "date_range": "02-24_02-28",
    "report_type": "Collaborative Planning"
  },
  "total_number_of_calls": 240,
  "team_average_total_number_of_calls_per_sales_consultant": 158.1818181818182,
  "number_of_calls_over_2_minutes": {
    "absolute_number": 42,
    "team_average_absolute_number": 29.09090909090909
  },
  "percent_of_calls_over_2_minutes": {
    "percentage": 17.5,
    "team_average_percentage": 12.06543043438548
  },
  "number_of_calls_under_2_minutes": {
    "absolute_number": 198,
    "team_average_absolute_number": 129.0909090909091
  },
  "percent_of_calls_under_2_minutes": {
    "percentage": 82.5,
    "team_average_percentage": 51.57093320197816
  },
  "average_talking_percentage": {
    "individual_average": 54.70050437570585,
    "team_average": 52.8184611261591
  },
  "excluded_transcripts": {
    "individual_excluded_transcripts": 198,
    "team_total_excluded_transcripts": 1420
  },
  "behavioral_scores": [
    {
      "label": "week-11_01-06_01-10",
      "average_final_ranking_score_eligible_transcripts": 128.45,
      "average_final_ranking_score_all_transcripts_over_2_mins": 109.78,
      "team_average_final_ranking_score_eligible_transcripts": 135.45,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 107.66
    },
    {
      "label": "week-12_01-13_01-17",
      "average_final_ranking_score_eligible_transcripts": 142.73,
      "average_final_ranking_score_all_transcripts_over_2_mins": 90.73,
      "team_average_final_ranking_score_eligible_transcripts": 149.51,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 99.85
    },
    {
      "label": "week-13_01-20_01-24",
      "average_final_ranking_score_eligible_transcripts": 127.15,
      "average_final_ranking_score_all_transcripts_over_2_mins": 87.27,
      "team_average_final_ranking_score_eligible_transcripts": 139.49,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 104.47
    },
    {
      "label": "week-14_01-27_01-31",
      "average_final_ranking_score_eligible_transcripts": 101.87,
      "average_final_ranking_score_all_transcripts_over_2_mins": 76.16,
      "team_average_final_ranking_score_eligible_transcripts": 123.13,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 97.01
    },
    {
      "label": "week-15_02-03_02-07",
      "average_final_ranking_score_eligible_transcripts": 137.07,
      "average_final_ranking_score_all_transcripts_over_2_mins": 77.68,
      "team_average_final_ranking_score_eligible_transcripts": 154.42,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 102.61
    },
    {
      "label": "week-16_02-10_02-14",
      "average_final_ranking_score_eligible_transcripts": 140.5,
      "average_final_ranking_score_all_transcripts_over_2_mins": 74.8,
      "team_average_final_ranking_score_eligible_transcripts": 133.34,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 101.14
    },
    {
      "label": "week-17_02-17_02-21",
      "average_final_ranking_score_eligible_transcripts": 101.93,
      "average_final_ranking_score_all_transcripts_over_2_mins": 79.56,
      "team_average_final_ranking_score_eligible_transcripts": 124.49,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 93.92
    },
    {
      "label": "week-18_02-24_02-28",
      "average_final_ranking_score_eligible_transcripts": 124.89,
      "average_final_ranking_score_all_transcripts_over_2_mins": 99.84,
      "team_average_final_ranking_score_eligible_transcripts": 138.95,
      "team_average_final_ranking_score_all_transcripts_over_2_mins": 104.67
    }
  ],
  "themes": {
    "positive": [
      {
        "headline": "Strategic Pathway Planning",
        "explanation": "Consultants effectively create personalized educational pathways that balance immediate constraints with long-term aspirations while maintaining enrollment momentum through practical solutions"
      },
      {
        "headline": "Flexible Study Integration",
        "explanation": "Strong demonstration of how program flexibility accommodates diverse student circumstances through specific solutions, real-world examples, and comprehensive support mechanisms"
      },
      {
        "headline": "Career Transition Support",
        "explanation": "Effective facilitation of career changes by validating existing experience while providing concrete examples of successful transitions and available support mechanisms"
      }
    ],
    "improvement": [
      {
        "headline": "Career Development Integration",
        "explanation": "Enhanced exploration needed of how specific program elements directly support career transition goals and professional advancement opportunities through targeted examples"
      },
      {
        "headline": "Documentation Process Planning",
        "explanation": "More comprehensive exploration needed of documentation requirements, alternative pathways, and specific support resources when addressing transcript and certification barriers"
      },
      {
        "headline": "Study Readiness Support",
        "explanation": "Deeper collaborative planning required for students returning to education after extended breaks, including specific strategies and confidence-building approaches"
      }
    ]
  },
  "conversation_analysis": {
    "condensed": {
      "conversations": [
        {
          "id": 1,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596845919696",
              "segment_id": "68",
              "timestamp": "05:45"
            },
            "supporting_calls": [
              {
                "call_id": "596761479729",
                "segment_id": "48",
                "timestamp": "06:20"
              }
            ]
          },
          "student_trigger": "Student stated: 'I want to advance my career but I'm worried about balancing study with my current role' (call_596845919696, seg_68), revealing significant concerns about managing concurrent commitments.",
          "consultant_response": "Consultant engaged collaboratively: 'The course itself is designed for students who are working full-time. Our lectures are only held after 6 p.m., and they are recorded for you' (call_596845919696, seg_68), effectively showing practical flexibility.",
          "context_impact": "Critical opportunity to demonstrate program flexibility and comprehensive support mechanisms while maintaining enrollment momentum.",
          "recommended_approach": "Include more specific examples of successful study-work integration strategies from current students and explore individual work patterns to create personalized solutions."
        },
        {
          "id": 2,
          "title": "Career Transition Support",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596982717264",
              "segment_id": "16",
              "timestamp": "02:35"
            },
            "supporting_calls": [
              {
                "call_id": "596846361763",
                "segment_id": "16",
                "timestamp": "01:15"
              }
            ]
          },
          "student_trigger": "Student stated: 'I'm looking to improve my skills. I've done my bachelors in hospitality management and I'm trying to see how I can switch career away from the restaurant business' (call_596982717264, seg_16), seeking career change guidance.",
          "consultant_response": "Consultant validated effectively: 'regarding the course itself, yes we have a lot of students...60% of our students are looking to this course to change careers. The way the course is actually built is for students who are working full-time' (call_596982717264, seg_21).",
          "context_impact": "Critical moment requiring validation of career change aspirations while demonstrating program's ability to support the transition through industry-specific examples.",
          "recommended_approach": "Include specific examples of successful hospitality-to-new-field transitions and provide concrete pathway options with timeline expectations."
        },
        {
          "id": 3,
          "title": "Study Readiness Support",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596846028945",
              "segment_id": "38",
              "timestamp": "08:15"
            },
            "supporting_calls": [
              {
                "call_id": "596846028945",
                "segment_id": "64",
                "timestamp": "16:30"
              }
            ]
          },
          "student_trigger": "Student expressed: 'I haven't studied for 15 years - I'm worried I won't be able to keep up' (call_596846028945, seg_38), revealing significant anxiety about academic readiness.",
          "consultant_response": "Consultant replied: 'Our lectures are held after 6 p.m., and you can catch up on recordings if you miss any session' (call_596846028945, seg_64), focusing on logistics rather than academic support.",
          "context_impact": "Key moment to address concerns about returning to study while building confidence through available support systems and success stories.",
          "recommended_approach": "Provide specific examples of how returning students successfully transition back to study and outline available academic support services with clear access points."
        },
        {
          "id": 4,
          "title": "Documentation Process Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "597070135109",
              "segment_id": "6",
              "timestamp": "00:16"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'Although I have the academic certificate, but I don't have the transcript' (call_597070135109, seg_6), indicating significant documentation barriers.",
          "consultant_response": "Consultant simply stated: 'What I can do for you, just to make things simpler, is I can transfer you to the right people' (call_597070135109, seg_15).",
          "context_impact": "Documentation issues can significantly impact enrollment progress and require clear resolution pathways with specific timelines.",
          "recommended_approach": "Provide clearer explanation of documentation options, specific next steps before transfer, and alternative documentation pathways with timelines."
        },
        {
          "id": 5,
          "title": "Alternative Pathway Planning",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "597147798866",
              "segment_id": "56",
              "timestamp": "07:56"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student stated: 'Okay, now you've done a bachelor's in psychology, but your weighted average mark will not get you to move into the honors program' (call_597147798866, seg_56), revealing need for alternative pathway guidance.",
          "consultant_response": "Consultant offered practical solution: 'So you will need to do, rather than doing three years of your studies, again, you can try and finishing the studies within that, you know, one year or 1.2 years and get a better mark to get into the honours program' (call_597147798866, seg_60).",
          "context_impact": "Critical moment requiring clear alternative options to maintain student engagement despite academic barriers.",
          "recommended_approach": "Include specific examples of how previous students have successfully navigated this accelerated pathway option with timeline expectations."
        },
        {
          "id": 6,
          "title": "Career Development Planning",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596846361763",
              "segment_id": "16",
              "timestamp": "01:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "Student expressed: 'Something that interests me and due to my current role, I want to get better experience in project management' (call_596846361763, seg_16), seeking professional development guidance.",
          "consultant_response": "Consultant missed opportunity by responding: 'That's great, so you've actually got pretty much most of the things that is required' (call_596846361763, seg_24).",
          "context_impact": "Key moment to align program benefits with student's professional development goals through specific examples and pathways.",
          "recommended_approach": "Explore specific career goals and align program features with professional aspirations through concrete examples and success stories."
        }
      ]
    },
    "verbose": {
      "conversations": [
        {
          "id": 1,
          "title": "Effective Work-Study Integration",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596845919696",
              "segment_id": "68",
              "timestamp": "05:45"
            },
            "supporting_calls": [
              {
                "call_id": "596761479729",
                "segment_id": "48",
                "timestamp": "06:20"
              }
            ]
          },
          "student_trigger": "During multiple calls, students consistently expressed concerns about managing concurrent commitments, exemplified by the statement 'I want to advance my career but I'm worried about balancing study with my current role' (call_596845919696, seg_68). This revealed both career advancement motivation and practical anxiety about managing the dual demands of work and study, representing a critical barrier to enrollment that needed immediate addressing through collaborative planning.",
          "consultant_response": "The consultant demonstrated strong understanding of work-study integration needs by explaining: 'The course itself is designed for students who are working full-time. Our lectures are only held after 6 p.m., and they are recorded for you so that you can view it the next day' (call_596845919696, seg_68). This response effectively showcased program flexibility while providing concrete examples of how working students can manage their studies. The approach maintained momentum by directly addressing concerns while highlighting practical solutions.",
          "priority": "high",
          "recommended_approach": "When addressing work-study balance concerns, begin by acknowledging their validity while immediately positioning the program's flexibility as a solution rather than a challenge. Start with validation: 'Many of our successful students are working professionals like yourself' before exploring specific program features that support work-study integration. Share concrete examples of how current students manage study around their work commitments - whether it's downloading materials for commutes, utilizing lunch breaks for reading, or accessing recorded lectures after busy workdays. For those with irregular schedules, emphasize how weekly study patterns can adapt to changing work demands. Pay particular attention to timing preferences, showing how evening lectures and recorded sessions specifically address professional scheduling needs. When discussing support hours, frame them in the context of the student's work schedule: 'With support available from 8am to 9pm, you can connect with advisors before work, during breaks, or after hours.' Create personalized study scenarios based on their specific work pattern: 'If you're working typical business hours, you might prefer our evening sessions. If you work shifts, our recorded lectures and downloadable materials let you study when it suits you.' The goal is transforming perceived barriers into manageable challenges through practical, personalized planning that demonstrates clear pathways to success."
        },
        {
          "id": 2,
          "title": "Career Transition Support",
          "type": "positive",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596982717264",
              "segment_id": "16",
              "timestamp": "02:35"
            },
            "supporting_calls": [
              {
                "call_id": "596846361763",
                "segment_id": "16",
                "timestamp": "01:15"
              }
            ]
          },
          "student_trigger": "A critical planning opportunity emerged when the student revealed their career transition aspirations: 'I'm looking to improve my skills. I've done my bachelors in hospitality management and I'm trying to see how I can switch career away from the restaurant business' (call_596982717264, seg_16). This disclosure represented both a clear need for guidance and a chance to demonstrate how the program specifically supports career changers. The student's openness about their career transition goals created an ideal moment for collaborative planning focused on professional development.",
          "consultant_response": "The consultant effectively validated the career change aspiration while highlighting program alignment: 'regarding the course itself, yes we have a lot of students...60% of our students are looking to this course to change careers. The way the course is actually built is for students who are working full-time' (call_596982717264, seg_21). This response successfully normalized the career transition while emphasizing how the program structure specifically supports working professionals making career changes. The consultant's approach maintained momentum by showing clear understanding of and support for the student's goals.",
          "priority": "high",
          "recommended_approach": "When supporting career changers, begin by validating their transition goals while demonstrating how our program specifically facilitates career evolution. Start with acknowledgment: 'Career transitions are significant steps, and our program is designed to support professionals making these changes.' Share specific examples of how current students manage the transition: 'Many of our students continue working while gradually building new skills and professional networks through our industry-focused assignments.' When discussing program structure, emphasize features that specifically support career changers: 'Our evening sessions and flexible online learning options let you maintain your current role while developing expertise in your new field.' Use success stories that resonate: 'We recently had a hospitality professional similar to yourself who completed our program while working full-time, and they're now leading projects in their new field.' Pay particular attention to transferable skills, showing how their existing expertise can enhance their success in the program: 'Your hospitality experience in customer service and team management provides valuable foundations for roles in project management or business analysis.' Create clear timelines: 'Most career changers complete the transition within 18-24 months, using the first year to build core skills while maintaining their current role.' The goal is showing how program features directly enable career transition while maintaining current employment stability, always grounding explanations in relevant industry examples that demonstrate clear pathways to success."
        },
        {
          "id": 3,
          "title": "Study Readiness Support",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "596846028945",
              "segment_id": "38",
              "timestamp": "08:15"
            },
            "supporting_calls": [
              {
                "call_id": "596846028945",
                "segment_id": "64",
                "timestamp": "16:30"
              }
            ]
          },
          "student_trigger": "The student voiced significant concern about academic readiness: 'I haven't studied for 15 years - I'm worried I won't be able to keep up' (call_596846028945, seg_38). This vulnerability about returning to study after an extended break presented a crucial opportunity for collaborative planning to address fears and build confidence in their ability to succeed through structured support mechanisms.",
          "consultant_response": "The consultant's response focused solely on logistics: 'Our lectures are held after 6 p.m., and you can catch up on recordings if you miss any session' (call_596846028945, seg_64). This reply failed to address the core concern about academic readiness, missing the opportunity to discuss relevant support services and strategies for returning students, potentially leaving their anxiety unaddressed.",
          "priority": "high",
          "recommended_approach": "When students express anxiety about returning to study after a long break, begin by normalizing their concerns while highlighting available support systems. Start with validation: 'Many of our successful students return to study after similar breaks - it's natural to feel apprehensive.' Then outline specific support mechanisms: 'Our program includes comprehensive academic support services, including study skills workshops and online learning resources.' Share examples of how other returning students have successfully managed their transition: 'Many students find our structured approach, with clear weekly goals and regular feedback, helps them regain their academic confidence.' Pay particular attention to specific anxiety triggers, addressing these with concrete examples of available support. For instance: 'Our academic skills advisors can help you refresh your writing skills through one-on-one sessions, and our online study guides walk you through academic requirements step by step.' When discussing the transition period, be specific: 'The first two weeks focus on orientation and study skills, giving you time to adjust before diving into course content.' Focus on showing how program design and support services specifically address common concerns of returning students: 'Our weekly discussion forums let you collaborate with peers, and learning advisors provide regular check-ins to ensure you're comfortable with the material.' The goal is transforming academic anxiety into confidence through clear demonstration of available support pathways and specific strategies for success."
        },
        {
          "id": 4,
          "title": "Documentation Process Planning",
          "type": "improvement",
          "is_aggregated": true,
          "related_calls": {
            "primary_call": {
              "call_id": "597070135109",
              "segment_id": "6",
              "timestamp": "00:16"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student expressed concern about missing documentation, stating 'Although I have the academic certificate, but I don't have the transcript' (call_597070135109, segment 6). This revealed immediate anxiety about a potential enrollment barrier and needed clear guidance on resolving the documentation issue. The student's tone indicated both urgency and uncertainty about how to proceed.",
          "consultant_response": "The consultant's response was primarily procedural, stating 'What I can do for you, just to make things simpler, is I can transfer you to the right people' (call_597070135109, segment 15). While this addressed the immediate need for connecting with appropriate support, it missed the opportunity to provide reassurance and clarity about the documentation process. The response lacked engagement with the student's underlying concerns about how this might affect their enrollment progress.",
          "priority": "high",
          "recommended_approach": "When handling documentation concerns, begin by acknowledging the stress these situations can cause: 'I understand missing documentation can be worrying, but let's work through this together.' Before initiating any transfer, provide a clear overview of available options: 'While we work on obtaining your transcript, there may be alternative documentation we can consider initially.' Create a specific action plan with timelines: 'First, let's confirm what documentation you do have. For instance, your academic certificate could serve as preliminary evidence while we secure your transcript within the next 2-3 weeks.' Outline clear next steps: 'Our documentation team can guide you through options like requesting official transcripts, which typically take 5-10 business days, or providing statutory declarations if needed.' Share specific examples: 'Many students have successfully used combinations of academic certificates, employer letters, and statutory declarations while waiting for official transcripts.' While maintaining appropriate boundaries, ensure students understand both immediate actions and the broader resolution path: 'Once we connect you with our documentation team, they'll help you explore options like contacting your previous institution or using alternative verification methods.' Always confirm understanding before transfer: 'Before I connect you with our documentation specialists, do you have any questions about the options we've discussed?' This structured approach helps students feel supported while moving toward a clear solution with specific timelines and expectations."
        },
        {
          "id": 5,
          "title": "Alternative Pathway Planning",
          "type": "positive",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "597147798866",
              "segment_id": "56",
              "timestamp": "07:56"
            },
            "supporting_calls": []
          },
          "student_trigger": "During the call, a critical moment arose when the student acknowledged their academic standing by stating: 'Okay, now you've done a bachelor's in psychology, but your weighted average mark will not get you to move into the honors program' (call_597147798866, seg_56). This self-awareness of academic limitations created an opportunity to demonstrate how alternative pathways could still lead to their desired outcome. The student's direct acknowledgment of this barrier showed their readiness to explore other options, making this an ideal moment for collaborative planning.",
          "consultant_response": "The consultant demonstrated strong collaborative planning skills by immediately offering a practical alternative: 'So you will need to do, rather than doing three years of your studies, again, you can try and finishing the studies within that, you know, one year or 1.2 years and get a better mark to get into the honours program' (call_597147798866, seg_60). This response effectively maintained the student's engagement by providing a clear, actionable alternative that acknowledged their current situation while offering a path forward. The consultant's approach transformed what could have been a moment of discouragement into an opportunity for strategic planning.",
          "priority": "high",
          "recommended_approach": "When students face academic barriers, consultants should focus on transforming these challenges into strategic opportunities through collaborative planning. Begin by validating the student's current situation: 'I understand your weighted average mark creates a challenge, but let's explore how we can work toward your goals.' Then, outline specific alternative pathways with clear timelines: 'Many students have successfully used the one-year intensive option to improve their academic standing. This typically involves 2-3 units per teaching period over 12-14 months.' Share success stories from past students: 'One of our recent graduates faced a similar situation and completed the intensive program in 14 months, achieving the marks needed for honors entry. They managed this while working part-time by utilizing our flexible study options.' When discussing accelerated options, be specific about workload and support: 'The intensive program requires about 25-30 hours of study per week. To support this, you'll have access to academic advisors, study skills workshops, and our online learning platform for flexible study timing.' Provide clear milestones: 'We'll set up regular check-points every 6 weeks to review your progress and adjust strategies as needed.' This approach helps students maintain momentum while building confidence in their ability to overcome academic obstacles through strategic planning with clear expectations and support mechanisms."
        },
        {
          "id": 6,
          "title": "Career Development Planning",
          "type": "improvement",
          "is_aggregated": false,
          "related_calls": {
            "primary_call": {
              "call_id": "596846361763",
              "segment_id": "16",
              "timestamp": "01:15"
            },
            "supporting_calls": []
          },
          "student_trigger": "The student revealed clear career advancement goals by stating: 'Something that interests me and due to my current role, I want to get better experience in project management' (call_596846361763, seg_16). This disclosure presented a prime opportunity to demonstrate how specific program elements could support their professional development aspirations and create a detailed career advancement plan.",
          "consultant_response": "The consultant's surface-level response: 'That's great, so you've actually got pretty much most of the things that is required' (call_596846361763, seg_24) failed to leverage this opportunity for deeper career planning. This generic acknowledgment missed the chance to explore specific program features that align with project management skill development or to create a targeted professional development pathway.",
          "priority": "high",
          "recommended_approach": "When students express specific career development goals, engage in detailed exploration of how program elements support their professional aspirations. Begin with deeper understanding: 'Tell me more about the project management aspects you're looking to develop - are you interested in particular methodologies or industry contexts?' Then connect program features directly to career goals: 'Our advanced project management unit includes real-world case studies and practical assignments that let you apply frameworks to your current workplace challenges.' Share specific examples of career progression: 'Many of our students use their course projects to demonstrate new capabilities to their employers - for instance, one recent graduate led a process improvement initiative as part of their final assessment, which led to a promotion within three months.' When discussing skill development, be specific: 'You'll learn both traditional and agile project management methodologies, with opportunities to practice stakeholder engagement, risk management, and project planning through simulated scenarios.' Outline clear development milestones: 'By the end of your first semester, you'll have completed two major project simulations. By year's end, you'll have a portfolio of practical project management experiences to showcase to employers.' Create tangible connections between study and career advancement: 'Each assignment is designed to build specific capabilities valued by employers - from stakeholder analysis to risk management frameworks.' The goal is to create a clear vision of how each program element contributes to their professional growth, making the connection between study and career advancement tangible and actionable through specific examples and timelines."
        }
      ]
    }
  }
}