{
    "type": "behavioural",
    "requirement": "Collaborative planning",
    "week": 14,
    "university": "Monash",
    "reporting_period": "01-27_01-31",
    "first_page_title": "<em>Monash Collaborative planning |</em> percentage alignment to collaborative planning filtered for high-need students",
    "second_page_title": "<em>Weekly report initiative 2 |</em> Collaborative planning with high-need students",
    "graph": {
        "bars": [
            {
                "title": "12-02_12-06\nweek 6",
                "upper_bound": 269.55,
                "lower_bound": 118.89,
                "green": 159.84
            },
            {
                "title": "12-23_12-27\nweek 9",
                "upper_bound": 201.34,
                "lower_bound": 51.41,
                "green": 152.6
            },
            {
                "title": "12-30_01-03\nweek 10",
                "upper_bound": 185.93,
                "lower_bound": 14.0,
                "green": 149.83
            },
            {
                "title": "01-06_01-10\nweek 11",
                "upper_bound": 190.51,
                "lower_bound": 60.45,
                "green": 135.45
            },
            {
                "title": "01-13_01-17\nweek 12",
                "upper_bound": 183.08,
                "lower_bound": 82.0,
                "green": 149.51
            },
            {
                "title": "01-20_01-24\nweek 13",
                "upper_bound": 189.9,
                "lower_bound": 85.82,
                "green": 139.49
            },
            {
                "title": "01-27_01-31\nweek 14",
                "upper_bound": 225.5,
                "lower_bound": 84.42,
                "green": 123.13
            }
        ],
        "green_label": "Team average",
        "red_label": "Upper & Lower bound",
        "result_label": "86% = Team Average"
    },
    "individual_performance": {
        "verdicts_count": 2119,
        "consultant_results": [
            {
                "name": "Michael Whyte",
                "high_need_score": "225.5",
                "all_score": "92.3",
                "percentage_high_need": "2/55 (3.6%)",
                "rank": 1
            },
            {
                "name": "James Lockie",
                "high_need_score": "201.2",
                "all_score": "97.6",
                "percentage_high_need": "10/207 (4.8%)",
                "rank": 2
            },
            {
                "name": "Ramon Keane",
                "high_need_score": "141.2",
                "all_score": "103.1",
                "percentage_high_need": "6/174 (3.4%)",
                "rank": 3
            },
            {
                "name": "Alyssa Pennacchia",
                "high_need_score": "131.5",
                "all_score": "88.0",
                "percentage_high_need": "8/251 (3.2%)",
                "rank": 4
            },
            {
                "name": "Elisha Odhiambo",
                "high_need_score": "121.7",
                "all_score": "102.7",
                "percentage_high_need": "10/241 (4.1%)",
                "rank": 5
            },
            {
                "name": "Michael Bosman",
                "high_need_score": "117.2",
                "all_score": "117.2",
                "percentage_high_need": "14/213 (6.6%)",
                "rank": 6
            },
            {
                "name": "Luke Williams",
                "high_need_score": "108.6",
                "all_score": "93.8",
                "percentage_high_need": "7/243 (2.9%)",
                "rank": 7
            },
            {
                "name": "Pawan Thapa",
                "high_need_score": "101.9",
                "all_score": "76.2",
                "percentage_high_need": "11/236 (4.7%)",
                "rank": 8
            },
            {
                "name": "Tayla Viglione",
                "high_need_score": "92.5",
                "all_score": "106.5",
                "percentage_high_need": "10/242 (4.1%)",
                "rank": 9
            },
            {
                "name": "Mrudang Pancholi",
                "high_need_score": "84.4",
                "all_score": "95.4",
                "percentage_high_need": "8/232 (3.4%)",
                "rank": 10
            },
            {
                "name": "Olive Jerome",
                "high_need_score": "0.0",
                "all_score": "84.4",
                "percentage_high_need": "0/25 (0.0%)",
                "rank": 11
            }
        ],
        "average_result": {
            "name": "Team average",
            "high_need_score": "123.1",
            "all_score": "97.0",
            "percentage_high_need": "86/2119 (4.1%)"
        }
    },
    "weekly_insights": {
        "verdicts_count": 257,
        "insights": {
            "concise": {
                "positive": [
                    {
                        "title": "Effective Work-Study Balance Planning",
                        "content": "Student trigger: Multiple students, including paramedics and hospital workers, expressed concerns about managing shift work alongside studies | Context/impact: Clear demonstration of program flexibility crucial for student confidence in course completion | Consultant response: Consultants provided specific flexibility examples: 'majority of our students are working full-time... you'll have video recordings... no exams, at no point you'll be required being on campus' | Improvement: None needed - excellent collaborative planning examples"
                    },
                    {
                        "title": "Effective Support System Integration",
                        "content": "Student trigger: Students seeking clarity on accessing support while managing work schedules | Context/impact: Comprehensive support availability information increased confidence in program manageability | Consultant response: Clear support hours communication: 'They are available seven days a week, Monday to Friday from 8am to 9pm and weekends are from 9am to 6pm' | Improvement: None needed - excellent support framework explanation"
                    },
                    {
                        "title": "Clear Program Navigation",
                        "content": "Student trigger: Students seeking clarity on program requirements and alternative pathways | Context/impact: Clear pathway explanation and alternative solutions maintained enrollment momentum | Consultant response: Comprehensive guidance provided: 'To get into the program, you will need to have a bachelor's degree and a weighted average mark over 60' | Improvement: None needed - excellent pathway navigation examples"
                    }
                ],
                "opportunities": [
                    {
                        "title": "Limited Career Goal Integration",
                        "content": "Student trigger: Students discussing career transitions and seeking recognition of professional experience | Context/impact: Missed opportunities to align program benefits with career objectives | Consultant response: Basic program information without exploring career alignment or value of experience | Improvement: Should better integrate career goals and professional experience while maintaining boundaries"
                    },
                    {
                        "title": "Basic Financial Planning",
                        "content": "Student trigger: Students seeking comprehensive information about financial support options | Context/impact: Limited financial guidance potentially creating enrollment barriers | Consultant response: Basic cost information without exploring comprehensive support options | Improvement: Should provide more thorough financial planning guidance while maintaining role boundaries"
                    },
                    {
                        "title": "Personal Circumstance Integration",
                        "content": "Student trigger: Student disclosed significant personal changes affecting study decisions | Context/impact: Missed opportunity to demonstrate understanding and discuss relevant support | Consultant response: Continued with administrative questions without acknowledging circumstances | Improvement: Should acknowledge personal circumstances and discuss relevant support while maintaining boundaries"
                    }
                ]
            },
            "verbose": {
                "positive": [
                    {
                        "title": "Effective Work-Study Balance Planning",
                        "content": {
                            "student_trigger": "Multiple students expressed significant concerns about managing work commitments alongside studies. The primary example involved a paramedic stating: 'I work full-time shift work as a paramedic, would it be easy enough to work around full-time shift work?' Supporting example showed similar concern from a hospital worker: 'I'm currently working as well in the hospital so I still cannot figure out like what sort of timing that I would be able to do.'",
                            "consultant_response": "Consultants demonstrated excellent collaborative planning by providing comprehensive solutions addressing multiple aspects of work-study balance. Primary example: 'Majority of our students are working full-time part-time and casual so yeah I'm sure you'll be fine. There is one interactive session once a week involved as long as it doesn't clash I mean even if it clashes with your work or the commitments you will have the video recordings later on to watch anyway.' Supporting example reinforced flexibility: 'The program itself is designed for students who are working full-time. Our lectures are actually held after 6 p.m.'",
                            "recommended_approach": "This represents best practice in work-study planning: 1) Acknowledge specific work challenges, 2) Provide concrete flexibility examples, 3) Explain multiple study options, 4) Highlight recorded content availability, 5) Demonstrate understanding of shift work demands, and 6) Create confidence through relevant examples"
                        }
                    },
                    {
                        "title": "Effective Support System Integration",
                        "content": {
                            "student_trigger": "Students across multiple calls expressed concerns about accessing support while managing work schedules. Primary example showed concern about support accessibility outside business hours, while supporting example sought clarity on available support services and access procedures.",
                            "consultant_response": "Consultants provided comprehensive support information while maintaining appropriate role boundaries. Primary example demonstrated thorough support availability: 'They are available until 9 p.m. during the weekdays... They're also available until 6 p.m. on the weekends.' Supporting example showed similar clarity: 'They are available seven days a week, Monday to Friday from 8am to 9pm and weekends are from 9am to 6pm.' This approach effectively demonstrated institutional commitment to student success while setting clear expectations.",
                            "recommended_approach": "Continue effective support communication by: 1) Providing specific availability details, 2) Emphasizing comprehensive support coverage, 3) Maintaining focus on accessibility, 4) Connecting support to student success, 5) Setting clear expectations about service scope, and 6) Directing detailed inquiries appropriately"
                        }
                    },
                    {
                        "title": "Clear Program Navigation",
                        "content": {
                            "student_trigger": "Students sought clarity on program requirements and pathways. Primary example asked about entry requirements: 'I'm wanting to find out about the entry requirements.' Supporting example revealed documentation challenges requiring alternative solutions.",
                            "consultant_response": "Consultants provided clear, comprehensive guidance while maintaining appropriate boundaries. Primary example: 'To get into the program, you will need to have a bachelor's degree and a weighted average mark over 60, and three years of work experience.' Supporting example demonstrated solution-focused approach: 'What we could do is, if you want, you could start a graduate certificate level. The graduate certificate is the first four units of the master's anyway.'",
                            "recommended_approach": "While maintaining strong current practices: 1) Acknowledge specific program interests, 2) Provide clear prerequisite information, 3) Offer viable alternatives when needed, 4) Maintain appropriate role boundaries, 5) Connect prerequisites to student success, and 6) Direct detailed questions to appropriate resources"
                        }
                    }
                ],
                "opportunities": [
                    {
                        "title": "Limited Career Goal Integration",
                        "content": {
                            "student_trigger": "Multiple students discussed career advancement goals and professional experience. Primary example: 'If I start and finish this course and I'm already sitting in a mid-level position in the company... I want to move to senior level position.' Supporting example: 'I am a web developer for the past nine years. Is there also like credit that you can get from like work recognition?'",
                            "consultant_response": "Consultants provided basic responses without exploring career alignment or experience value. Primary example moved quickly to administrative details without addressing career development potential. Supporting example showed similar limitation: 'Yeah, unfortunately there's not with us, with Monash. We don't actually accept work experience for RPL.' These responses missed opportunities to demonstrate program value through career-focused planning.",
                            "recommended_approach": "Enhance career integration while maintaining boundaries by: 1) Exploring professional development goals within pre-enrollment scope, 2) Explaining how program features support career advancement, 3) Discussing how experience enhances learning journey, 4) Creating clear program-career connections, 5) Highlighting career-relevant program features, and 6) Directing detailed career planning to appropriate resources"
                        }
                    },
                    {
                        "title": "Basic Financial Planning",
                        "content": {
                            "student_trigger": "Multiple students sought comprehensive financial information. Primary example: 'So, the question I had is about any payment plans and all that, any subsidies.' Supporting example showed specific scholarship interest: 'So essentially what I can do is I can enroll, apply for a scholarship and then if I don't get a scholarship I can withdraw?'",
                            "consultant_response": "Consultants provided surface-level responses without exploring comprehensive options. Primary example deferred discussion: 'Now okay all right we will get to all that information in a moment.' Supporting example offered limited guidance: 'It's up to you, you can withdraw or being a, you know, you've already done the grad set, you've got a really high mark, if you want to apply for fee help you can apply for fee help as well.'",
                            "recommended_approach": "Enhance financial planning discussions by: 1) Acknowledging financial planning importance, 2) Providing overview of all payment options, 3) Explaining scholarship processes clearly, 4) Discussing FEE-HELP availability and criteria, 5) Exploring employer sponsorship opportunities, and 6) Directing to detailed financial resources while maintaining boundaries"
                        }
                    },
                    {
                        "title": "Personal Circumstance Integration",
                        "content": {
                            "student_trigger": "Student disclosed significant personal change impacting study decisions, presenting an opportunity to demonstrate understanding and discuss relevant support options while maintaining appropriate boundaries. This disclosure required sensitive acknowledgment and appropriate guidance toward support resources.",
                            "consultant_response": "Consultant continued with administrative questions without acknowledging the personal circumstance or exploring potential impacts on study planning. This missed opportunity to demonstrate understanding and connect with relevant support services while maintaining appropriate boundaries.",
                            "recommended_approach": "Enhance personal circumstance integration by: 1) Acknowledging disclosures sensitively, 2) Demonstrating understanding of potential impacts, 3) Highlighting relevant support services, 4) Creating space for concerns discussion, 5) Connecting circumstances to program flexibility features, and 6) Directing detailed support planning to appropriate services while maintaining boundaries"
                        }
                    }
                ]
            }
        }
    },
    "metadata": {
        "generated_date": "2024-12-13",
        "report_id": "MONU-B-COLL-W7-2024",
        "data_source": "OES Sales Excellence.AI"
    }
}