{
    "type": "behavioural",
    "requirement": "Collaborative planning",
    "week": 17,
    "university": "Monash",
    "reporting_period": "02-17_02-21",
    "first_page_title": "<em>Monash Collaborative planning |</em> percentage alignment to collaborative planning filtered for high-need students",
    "second_page_title": "<em>Weekly report initiative 2 |</em> Collaborative planning with high-need students",
    "graph": {
        "bars": [
            {
                "title": "12-02_12-06\nweek 6",
                "upper_bound": 269.55,
                "lower_bound": 118.89,
                "green": 159.84
            },
            {
                "title": "12-23_12-27\nweek 9",
                "upper_bound": 201.34,
                "lower_bound": 51.41,
                "green": 152.6
            },
            {
                "title": "12-30_01-03\nweek 10",
                "upper_bound": 185.93,
                "lower_bound": 14.0,
                "green": 149.83
            },
            {
                "title": "01-06_01-10\nweek 11",
                "upper_bound": 190.51,
                "lower_bound": 60.45,
                "green": 135.45
            },
            {
                "title": "01-13_01-17\nweek 12",
                "upper_bound": 183.08,
                "lower_bound": 82.0,
                "green": 149.51
            },
            {
                "title": "01-20_01-24\nweek 13",
                "upper_bound": 189.9,
                "lower_bound": 85.82,
                "green": 139.49
            },
            {
                "title": "01-27_01-31\nweek 14",
                "upper_bound": 225.5,
                "lower_bound": 84.42,
                "green": 123.13
            },
            {
                "title": "02-03_02-07\nweek 15",
                "upper_bound": 214.86,
                "lower_bound": 42.0,
                "green": 154.42
            },
            {
                "title": "02-10_02-14\nweek 16",
                "upper_bound": 178.02,
                "lower_bound": 98.37,
                "green": 133.34
            },
            {
                "title": "02-17_02-21\nweek 17",
                "upper_bound": 207.82,
                "lower_bound": 86.7,
                "green": 124.49
            }
        ],
        "green_label": "Team average",
        "red_label": "Upper & Lower bound",
        "result_label": "86% = Team Average"
    },
    "individual_performance": {
        "verdicts_count": 2447,
        "consultant_results": [
            {
                "name": "Elisha Odhiambo",
                "high_need_score": "207.8",
                "all_score": "115.0",
                "percentage_high_need": "12/250 (4.8%)",
                "rank": 1
            },
            {
                "name": "Luke Williams",
                "high_need_score": "190.7",
                "all_score": "120.2",
                "percentage_high_need": "6/200 (3.0%)",
                "rank": 2
            },
            {
                "name": "Michael Bosman",
                "high_need_score": "141.4",
                "all_score": "98.6",
                "percentage_high_need": "9/265 (3.4%)",
                "rank": 3
            },
            {
                "name": "Ramon Keane",
                "high_need_score": "141.0",
                "all_score": "109.3",
                "percentage_high_need": "15/217 (6.9%)",
                "rank": 4
            },
            {
                "name": "James Lockie",
                "high_need_score": "118.4",
                "all_score": "67.8",
                "percentage_high_need": "13/242 (5.4%)",
                "rank": 5
            },
            {
                "name": "Mrudang Pancholi",
                "high_need_score": "117.7",
                "all_score": "67.8",
                "percentage_high_need": "10/296 (3.4%)",
                "rank": 6
            },
            {
                "name": "Alyssa Pennacchia",
                "high_need_score": "112.7",
                "all_score": "100.3",
                "percentage_high_need": "9/263 (3.4%)",
                "rank": 7
            },
            {
                "name": "Pawan Thapa",
                "high_need_score": "101.9",
                "all_score": "79.6",
                "percentage_high_need": "15/242 (6.2%)",
                "rank": 8
            },
            {
                "name": "Michael Whyte",
                "high_need_score": "98.9",
                "all_score": "95.0",
                "percentage_high_need": "13/135 (9.6%)",
                "rank": 9
            },
            {
                "name": "Tayla Viglione",
                "high_need_score": "86.7",
                "all_score": "109.1",
                "percentage_high_need": "15/335 (4.5%)",
                "rank": 10
            },
            {
                "name": "Olive Jerome",
                "high_need_score": "0.0",
                "all_score": "0.0",
                "percentage_high_need": "1/2 (50.0%)",
                "rank": 11
            }
        ],
        "average_result": {
            "name": "Team average",
            "high_need_score": "124.5",
            "all_score": "93.9",
            "percentage_high_need": "118/2447 (4.8%)"
        }
    },
    "weekly_insights": {
        "verdicts_count": 257,
        "insights": {
            "concise": {
                "positive": [
                    {
                        "title": "Effective Work-Study Integration",
                        "content": "Student trigger: Student expressed: 'I work rotating shifts at the hospital, not sure how I'll manage study' (call_595732493616, seg_23), revealing critical need to demonstrate practical study flexibility. | Context/impact: This moment required clear demonstration of how our program design specifically accommodates healthcare shift workers to maintain enrollment momentum. | Consultant response: Consultant provided practical solution: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24), effectively showing real-world flexibility. | Improvement: Include more specific examples of successful study patterns from current healthcare students, particularly those managing night shifts and rotating rosters."
                    },
                    {
                        "title": "Strategic Educational Pathway Guidance",
                        "content": "Student trigger: Student stated: 'I completed a graduate diploma in psychology from Monash Online in 2019. And I just want to know what's my next step? What do I do in the psychology area?' (call_596549383734, seg_3), seeking clear pathway guidance. | Context/impact: This moment required clear demonstration of potential pathways while maintaining appropriate pre-enrollment guidance boundaries. | Consultant response: Consultant explored aspirations effectively: 'You're looking to progress into the Masters thereafter, I'm assuming? Are you looking to become a psychologist?' (call_596549383734, seg_6), opening dialogue about career goals while suggesting concrete next steps. | Improvement: Include more specific examples of successful career progression pathways while maintaining appropriate pre-enrollment guidance boundaries."
                    },
                    {
                        "title": "Disability Support Planning",
                        "content": "Student trigger: Student stated: 'When I was in uni, when I was doing my Bachelors, I registered myself with Disability Support Services' (call_596549283284, seg_18), revealing need for support continuity. | Context/impact: Critical moment for demonstrating institutional support capabilities while maintaining appropriate service boundaries. | Consultant response: Consultant assured: 'There's a question I do ask you about any disabilities that you may have, so we can note them down and we can get that support arranged for you' (call_596549283284, seg_24), effectively validating support needs. | Improvement: Provide clearer explanation of support registration process while maintaining appropriate enrollment focus and service transitions."
                    }
                ],
                "opportunities": [
                    {
                        "title": "Return to Study Support",
                        "content": "Student trigger: Student expressed: 'I'm so scared. I haven't been in the study so long' (call_596462170384, seg_146), revealing significant anxiety about returning to education. | Context/impact: Critical moment requiring comprehensive support discussion to build confidence and prevent anxiety from blocking enrollment progress. | Consultant response: Consultant replied with: 'No, it's exciting' (call_596462170384, seg_147), missing opportunity for deeper exploration of concerns. | Improvement: Explore specific concerns, share success stories of similar students, and outline available support services while building confidence through practical examples."
                    },
                    {
                        "title": "Documentation Process Planning",
                        "content": "Student trigger: Student expressed: 'In terms of obviously not having my results and everything' (call_596617228935, seg_14), showing anxiety about documentation gap. | Context/impact: Documentation gaps presented critical barrier to enrollment completion requiring immediate problem-solving support. | Consultant response: Consultant stated: 'Yeah so until we've got your results we won't be able to do that for you' (call_596617228935, seg_18), focusing mainly on requirements rather than solutions. | Improvement: Create detailed interim action plan while waiting for results to maintain engagement and momentum through specific preparatory activities."
                    },
                    {
                        "title": "Learning Support Integration",
                        "content": "Student trigger: Student disclosed: 'I was diagnosed with ADHD so that's why I couldn't really complete most of my courses because I was undiagnosed' (call_596549078131, seg_79), sharing learning support needs. | Context/impact: Critical opportunity to demonstrate understanding and outline specific support mechanisms while maintaining appropriate boundaries. | Consultant response: Consultant replied: 'No, fantastic' (call_596549078131, seg_85), failing to acknowledge significance or explore support options. | Improvement: Detail specific learning support services and accommodation options available while setting clear expectations about post-enrollment support processes."
                    }
                ]
            },
            "verbose": {
                "positive": [
                    {
                        "title": "Effective Work-Study Integration",
                        "content": {
                            "student_trigger": "In call 595732493616 (segment 23), the student expressed significant concern about balancing study with shift work: 'I work rotating shifts at the hospital, not sure how I'll manage study.' Similar concerns emerged in call 595732548084 (segment 163) where another healthcare worker noted: 'My roster changes every week, and I often work nights.' These moments represented critical opportunities to demonstrate how our program specifically accommodates healthcare professionals' unique scheduling challenges.",
                            "consultant_response": "The primary consultant demonstrated strong understanding of healthcare workflows, responding with: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24). This practical example resonated strongly, with the student responding: 'That actually sounds manageable' (seg_25). In the supporting call, the consultant built on the flexible access theme: 'The beauty of our platform is you can switch between online and offline study. Some students download their materials before night shifts' (call_595732548084, seg_164). Both consultants effectively moved the conversation from 'if' to 'how', directly addressing the practical concerns while maintaining momentum.",
                            "recommended_approach": "When addressing shift workers' scheduling concerns, start by acknowledging their specific work pattern before showing how our program design aligns with healthcare workflows. Share concrete examples of how current students manage study around shifts - whether it's downloading materials for night shifts, studying during quiet periods, or breaking study into small blocks between shifts. The key is making flexibility tangible rather than theoretical. For instance, explain how asynchronous learning means no mandatory live sessions, and offline access means study can happen even in areas with poor connectivity. For those with rotating rosters, emphasize how weekly study patterns can adapt to changing schedules. Pay particular attention to students working night shifts or long rotations, showing how our platform's flexibility specifically addresses these challenges. The goal is to transform perceived scheduling barriers into manageable planning opportunities, always grounding explanations in healthcare-specific scenarios that resonate with their experience."
                        }
                    },
                    {
                        "title": "Strategic Educational Pathway Guidance",
                        "content": {
                            "student_trigger": "In call 596549383734 (segment 3), the student sought guidance on their educational journey, stating 'I completed a graduate diploma in psychology from Monash Online in 2019. And I just want to know what's my next step? What do I do in the psychology area?' This revealed both their readiness to progress and need for clear pathway guidance. The specific mention of previous study created an opportunity for strategic planning that could connect past achievements with future aspirations.",
                            "consultant_response": "The consultant demonstrated strong collaborative planning by engaging with the student's aspirations, responding with: 'You're looking to progress into the Masters thereafter, I'm assuming? Are you looking to become a psychologist?' (call_596549383734, seg_6). This approach effectively opened a dialogue about career goals while suggesting potential next steps, creating a framework for meaningful discussion about educational pathways. The consultant maintained appropriate boundaries while providing clear direction for further exploration.",
                            "recommended_approach": "When students seek guidance on educational pathways, begin by acknowledging their current achievements and immediately transition into exploring their career aspirations while maintaining appropriate pre-enrollment boundaries. Start with open-ended questions that encourage students to share their goals, such as 'What aspects of psychology particularly interest you?' or 'What type of role do you envision yourself in?' This creates a foundation for personalized guidance. When discussing potential pathways, always connect them directly to the student's expressed interests and goals. For instance, if a student mentions interest in clinical work, outline the specific educational steps required while highlighting how each stage builds towards their goal. Pay particular attention to students transitioning between qualification levels, as they often need clarity on how additional education enhances their career prospects. Share specific examples of successful transitions while maintaining appropriate advisory boundaries. The key is maintaining a balance between providing clear direction and allowing students to explore options that align with their aspirations."
                        }
                    },
                    {
                        "title": "Disability Support Planning",
                        "content": {
                            "student_trigger": "During call 596549283284 (segment 18), the student proactively disclosed their history with support services: 'When I was in uni, when I was doing my Bachelors, I registered myself with Disability Support Services.' This disclosure demonstrated both self-advocacy and a desire to ensure continued support in their new academic journey, creating a critical moment for demonstrating institutional support capabilities while maintaining appropriate service boundaries.",
                            "consultant_response": "The consultant responded with clarity about support registration: 'There's a question I do ask you about any disabilities that you may have, so we can note them down and we can get that support arranged for you' (call_596549283284, seg_24). This response effectively validated the student's needs while providing concrete information about the support registration process, demonstrating the institution's commitment to accessible education while maintaining appropriate enrollment focus.",
                            "recommended_approach": "When students disclose previous experience with disability support services, begin by validating their proactive approach: 'Thank you for sharing that information - it helps us ensure continuity of support in your academic journey.' Then clearly outline the support registration process while maintaining appropriate enrollment focus: 'While we focus on your enrollment today, let me explain how our disability support registration works.' Guide them through the immediate next steps while setting clear expectations about post-enrollment support: 'During enrollment, we'll note your support needs, and once enrolled, our disability support team will work with you to implement specific accommodations.' Share examples of available support options without making specific promises: 'Our support services can include flexible assessment arrangements, accessible materials, and specialized academic support, though specific accommodations are arranged after enrollment.' The goal is demonstrating institutional commitment to support while keeping the conversation within appropriate pre-enrollment boundaries and maintaining clear service role distinctions."
                        }
                    }
                ],
                "opportunities": [
                    {
                        "title": "Return to Study Support",
                        "content": {
                            "student_trigger": "During call 596462170384 (segment 146), the student expressed significant anxiety about returning to education, stating 'I'm so scared. I haven't been in the study so long.' This disclosure revealed deep concerns about academic readiness and potential challenges of returning to study after an extended break. The moment presented a critical opportunity to address fears that could potentially block enrollment progress if left unaddressed.",
                            "consultant_response": "The consultant's brief response of 'No, it's exciting' (call_596462170384, seg_147) failed to adequately address the depth of the student's expressed anxiety or explore available support services. While attempting to provide positivity, this response missed the opportunity to validate the student's feelings and discuss specific support mechanisms that could help ensure their successful return to study.",
                            "recommended_approach": "When students express anxiety about returning to study, begin with validation: 'It's completely natural to feel nervous about returning to study - many successful students share similar feelings initially.' Then engage in specific concern exploration: 'Let's talk about what aspects feel most challenging to you, so we can identify the right support services.' Share concrete examples of how returning students succeed: 'Many students who return after a break find our orientation workshops particularly helpful in rebuilding confidence. For example, we offer academic skills sessions that cover everything from essay writing to time management.' Demonstrate understanding of common concerns: 'Students often worry about technology skills or academic writing, but our support teams provide personalized guidance in these areas.' The key is transforming general anxiety into specific, addressable concerns while showcasing the comprehensive support system available. Create clear action steps: 'Once enrolled, your student success advisor will help create a personalized study plan that builds on your strengths and addresses any areas where you'd like extra support.'"
                        }
                    },
                    {
                        "title": "Documentation Process Planning",
                        "content": {
                            "student_trigger": "During call 596617228935 (segment 14), the student expressed uncertainty about missing documentation: 'In terms of obviously not having my results and everything.' This revealed anxiety about how documentation gaps might affect their enrollment prospects, creating a critical moment for maintaining confidence while developing clear interim plans.",
                            "consultant_response": "The consultant's response was notably limited: 'Yeah so until we've got your results we won't be able to do that for you' (call_596617228935, seg_18). This failed to provide constructive guidance or maintain engagement during the waiting period, missing the opportunity to transform a potential barrier into a strategic planning opportunity.",
                            "recommended_approach": "When addressing documentation gaps, immediately pivot to constructive planning: 'While we wait for your results, let's create a plan to keep your enrollment moving forward.' Outline specific steps students can take: 'Many applicants use this time to gather other required documents, explore financial planning options, or begin preliminary program preparation.' Create clear timelines and action items: 'Let's identify what you can do now and what needs to wait for results.' Share examples of how other students have successfully managed similar situations: 'One recent student used this waiting period to organize their study space and explore our online learning platform.' Break down the documentation process into manageable steps: 'First, let's confirm exactly what results we're waiting for and their expected timeline.' The goal is transforming waiting periods into productive preparation time while maintaining clear enrollment momentum through specific, actionable steps that keep students engaged in the process."
                        }
                    },
                    {
                        "title": "Learning Support Integration",
                        "content": {
                            "student_trigger": "During call 596549078131 (segment 79), the student disclosed specific learning needs: 'I was diagnosed with ADHD so that's why I couldn't really complete most of my courses because I was undiagnosed.' This disclosure represented a crucial opportunity to demonstrate understanding of learning challenges and explore available support mechanisms. The student's openness about past challenges created a critical moment for showing how appropriate support could lead to different outcomes.",
                            "consultant_response": "The consultant's brief response of 'No, fantastic' (call_596549078131, seg_85) failed to acknowledge the significance of the student's disclosure or explore available support services. This missed opportunity to engage in meaningful discussion about learning support options potentially left the student uncertain about the level of support available to prevent similar challenges in their new academic journey.",
                            "recommended_approach": "When students disclose learning challenges, begin by validating their experience: 'Thank you for sharing that information - it helps us ensure you have access to appropriate support for success.' Then outline available support services while maintaining proper boundaries: 'While specific accommodations are arranged after enrollment, let me explain how our learning support system works.' Share specific examples of available assistance: 'Our support services include study strategy coaching, flexible assessment options, and specialized academic resources.' Focus on creating confidence through clear support pathways: 'Many students find our structured unit format and varied learning materials help them develop effective study techniques.' Pay particular attention to differentiating current support from past experiences: 'Our comprehensive support system is designed to help students with diverse learning needs succeed through personalized strategies.' The goal is demonstrating institutional commitment to accessible education while maintaining appropriate pre-enrollment boundaries and setting realistic expectations about available support."
                        }
                    }
                ]
            }
        }
    },
    "metadata": {
        "generated_date": "2024-12-13",
        "report_id": "MONU-B-COLL-W7-2024",
        "data_source": "OES Sales Excellence.AI"
    }
}