{
    "type": "behavioural",
    "requirement": "Collaborative planning",
    "week": 16,
    "university": "Monash",
    "reporting_period": "02-10_02-14",
    "first_page_title": "<em>Monash Collaborative planning |</em> percentage alignment to collaborative planning filtered for high-need students",
    "second_page_title": "<em>Weekly report initiative 2 |</em> Collaborative planning with high-need students",
    "graph": {
        "bars": [
            {
                "title": "12-02_12-06\nweek 6",
                "upper_bound": 269.55,
                "lower_bound": 118.89,
                "green": 159.84
            },
            {
                "title": "12-23_12-27\nweek 9",
                "upper_bound": 201.34,
                "lower_bound": 51.41,
                "green": 152.6
            },
            {
                "title": "12-30_01-03\nweek 10",
                "upper_bound": 185.93,
                "lower_bound": 14.0,
                "green": 149.83
            },
            {
                "title": "01-06_01-10\nweek 11",
                "upper_bound": 190.51,
                "lower_bound": 60.45,
                "green": 135.45
            },
            {
                "title": "01-13_01-17\nweek 12",
                "upper_bound": 183.08,
                "lower_bound": 82.0,
                "green": 149.51
            },
            {
                "title": "01-20_01-24\nweek 13",
                "upper_bound": 189.9,
                "lower_bound": 85.82,
                "green": 139.49
            },
            {
                "title": "01-27_01-31\nweek 14",
                "upper_bound": 225.5,
                "lower_bound": 84.42,
                "green": 123.13
            },
            {
                "title": "02-03_02-07\nweek 15",
                "upper_bound": 214.86,
                "lower_bound": 42.0,
                "green": 154.42
            },
            {
                "title": "02-10_02-14\nweek 16",
                "upper_bound": 178.02,
                "lower_bound": 98.37,
                "green": 133.34
            }
        ],
        "green_label": "Team average",
        "red_label": "Upper & Lower bound",
        "result_label": "86% = Team Average"
    },
    "individual_performance": {
        "verdicts_count": 2528,
        "consultant_results": [
            {
                "name": "Elisha Odhiambo",
                "high_need_score": "178.0",
                "all_score": "136.8",
                "percentage_high_need": "13/290 (4.5%)",
                "rank": 1
            },
            {
                "name": "Michael Bosman",
                "high_need_score": "155.5",
                "all_score": "103.1",
                "percentage_high_need": "9/263 (3.4%)",
                "rank": 2
            },
            {
                "name": "Ramon Keane",
                "high_need_score": "144.5",
                "all_score": "105.0",
                "percentage_high_need": "21/266 (7.9%)",
                "rank": 3
            },
            {
                "name": "Tayla Viglione",
                "high_need_score": "142.2",
                "all_score": "107.0",
                "percentage_high_need": "15/319 (4.7%)",
                "rank": 4
            },
            {
                "name": "Pawan Thapa",
                "high_need_score": "140.5",
                "all_score": "74.8",
                "percentage_high_need": "11/264 (4.2%)",
                "rank": 5
            },
            {
                "name": "Alyssa Pennacchia",
                "high_need_score": "135.0",
                "all_score": "86.8",
                "percentage_high_need": "5/306 (1.6%)",
                "rank": 6
            },
            {
                "name": "Mrudang Pancholi",
                "high_need_score": "129.6",
                "all_score": "108.3",
                "percentage_high_need": "12/270 (4.4%)",
                "rank": 7
            },
            {
                "name": "James Lockie",
                "high_need_score": "114.3",
                "all_score": "88.1",
                "percentage_high_need": "11/239 (4.6%)",
                "rank": 8
            },
            {
                "name": "Luke Williams",
                "high_need_score": "98.4",
                "all_score": "85.5",
                "percentage_high_need": "19/310 (6.1%)",
                "rank": 9
            },
            {
                "name": "Olive Jerome",
                "high_need_score": "0.0",
                "all_score": "182.5",
                "percentage_high_need": "0/1 (0.0%)",
                "rank": 10
            }
        ],
        "average_result": {
            "name": "Team average",
            "high_need_score": "133.3",
            "all_score": "101.1",
            "percentage_high_need": "116/2528 (4.6%)"
        }
    },
    "weekly_insights": {
        "verdicts_count": 257,
        "insights": {
            "concise": {
                "positive": [
                    {
                        "title": "Effective Work-Study Integration",
                        "content": "Student trigger: Student expressed: 'I work rotating shifts at the hospital, not sure how I'll manage study' (call_595732493616, seg_23), followed by similar concerns from other healthcare workers: 'My roster changes every week' (call_595732548084, seg_163), revealing critical scheduling flexibility needs. | Context/impact: This moment required clear demonstration of how program design specifically accommodates healthcare shift workers to maintain enrollment momentum. | Consultant response: Consultant provided practical solution: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24), effectively showing real-world flexibility. | Improvement: Include more specific examples of successful study patterns from current healthcare students with varied shift patterns."
                    },
                    {
                        "title": "Career Pathway Planning",
                        "content": "Student trigger: Student asked: 'If I do the graduate diploma and then the advanced graduate diploma, how far along the pathway to being an actual registered psychologist am I?' (call_596091044814, seg_10), seeking clear career progression guidance. | Context/impact: Critical moment requiring pathway clarity while maintaining appropriate guidance boundaries. | Consultant response: Consultant effectively outlined progression: 'In terms of completing both of those two, you would be on track to becoming a registered psychologist...you will be able to start working as a psychologist but in non-clinical roles' (call_596091044814, seg_24). | Improvement: Include more specific examples of non-clinical roles and typical progression timelines while maintaining sales role boundaries."
                    },
                    {
                        "title": "Financial Support Navigation",
                        "content": "Student trigger: Student expressed: 'Oh wow, so with that 18 grand is there any chance that I can ask for the government help or any subsidiary?' (call_595908157534, seg_99), showing critical concern about course affordability. | Context/impact: Clear guidance on financial aid options crucial for maintaining enrollment momentum. | Consultant response: Consultant effectively explained: 'As an Australian citizen you do automatically have access to government support which is in the form of fee help' (call_595908157534, seg_101), providing clear pathway to assistance. | Improvement: Include more proactive exploration of available financial support options and documentation requirements."
                    },
                    {
                        "title": "Professional Network Development",
                        "content": "Student trigger: Student inquired: 'Will I be able to connect with other professionals in my field?' (call_596267563999, seg_27), seeking concrete information about networking opportunities. | Context/impact: Opportunity to demonstrate program's concrete professional networking value and industry-specific benefits. | Consultant response: Consultant effectively outlined peer learning opportunities and specific industry connections, showing clear pathway to professional network development through course interactions. | Improvement: Include more success stories and specific examples of professional relationships formed through program collaboration."
                    }
                ],
                "opportunities": [
                    {
                        "title": "Return to Study Support",
                        "content": "Student trigger: Student expressed: 'I haven't studied for 15 years - I'm worried I won't be able to keep up' (call_596090912145, seg_15), revealing significant anxiety about academic readiness. | Context/impact: Essential moment to address confidence barriers while demonstrating comprehensive support mechanisms. | Consultant response: Consultant asked: 'What's changed in your circumstances since then that's made you consider studying again?' (call_596090912145, seg_17), missing opportunity to provide immediate reassurance and support details. | Improvement: Provide specific examples of support services and share success stories of similar students who excelled after long breaks."
                    },
                    {
                        "title": "Documentation Process Support",
                        "content": "Student trigger: Student stated: 'I don't have, I've only got like the degree itself, but I can send that through' (call_596179350052, seg_20), revealing need for alternative documentation solutions. | Context/impact: Unclear documentation guidance risks enrollment delays and increased student frustration. | Consultant response: Consultant provided minimal guidance: 'It'll be a while' (call_596179350052, seg_21), missing opportunity to outline solutions or alternatives. | Improvement: Develop clear action plan with interim steps, alternative documentation options, and specific timeline expectations."
                    },
                    {
                        "title": "Career Development Integration",
                        "content": "Enhanced exploration needed of how program elements align with specific workplace challenges and career goals while maintaining appropriate pre-enrollment guidance boundaries"
                    }
                ]
            },
            "verbose": {
                "positive": [
                    {
                        "title": "Effective Work-Study Integration",
                        "content": {
                            "student_trigger": "In call 595732493616 (segment 23), the student expressed significant concern about balancing study with shift work: 'I work rotating shifts at the hospital, not sure how I'll manage study.' This revealed both interest in the program and anxiety about practical implementation. Similar concerns emerged in call 595732548084 (segment 163) where another healthcare worker noted: 'My roster changes every week, and I often work nights.' These moments represented critical opportunities to demonstrate how our program specifically accommodates healthcare professionals' unique scheduling challenges.",
                            "consultant_response": "The consultant demonstrated strong understanding of healthcare workflows, responding with: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24). This practical example resonated strongly, with the student responding: 'That actually sounds manageable' (seg_25). In the supporting call, the consultant built on the flexible access theme: 'The beauty of our platform is you can switch between online and offline study. Some students download their materials before night shifts' (call_595732548084, seg_164). Both consultants effectively moved the conversation from 'if' to 'how', directly addressing practical concerns while maintaining momentum.",
                            "recommended_approach": "When addressing shift workers' scheduling concerns, begin by acknowledging their specific work pattern before showing how our program design aligns with healthcare workflows. Share concrete examples of how current students manage study around shifts - whether it's downloading materials for night shifts, studying during quiet periods, or breaking study into small blocks between shifts. The key is making flexibility tangible rather than theoretical. For instance, explain how asynchronous learning means no mandatory live sessions, and offline access means study can happen even in areas with poor connectivity. For those with rotating rosters, emphasize how weekly study patterns can adapt to changing schedules. Pay particular attention to students working night shifts or long rotations, showing how our platform's flexibility specifically addresses these challenges. The goal is to transform perceived scheduling barriers into manageable planning opportunities, always grounding explanations in healthcare-specific scenarios that resonate with their experience."
                        }
                    },
                    {
                        "title": "Career Pathway Planning",
                        "content": {
                            "student_trigger": "The student sought specific clarity about their psychology career progression, asking: 'If I do the graduate diploma and then the advanced graduate diploma, how far along the pathway to being an actual registered psychologist am I?' (call_596091044814, seg_10). This detailed question demonstrated both strong engagement with the program and a critical need for understanding how these qualifications would contribute to their professional goals.",
                            "consultant_response": "The consultant provided comprehensive pathway guidance while maintaining appropriate boundaries: 'In terms of completing both of those two, you would be on track to becoming a registered psychologist... you will be able to start working as a psychologist but in non-clinical roles supporting clinicians' (call_596091044814, seg_24). This response effectively balanced immediate program benefits with longer-term career progression.",
                            "recommended_approach": "When addressing psychology career pathway questions, begin by validating the student's career aspirations while maintaining clear sales role boundaries: 'Your interest in becoming a registered psychologist shows excellent career planning. Let me outline how our programs support that journey.' Structure the response to focus first on immediate outcomes: 'The graduate diploma provides foundational psychology knowledge and opens doors to roles like behavioral technician or research assistant.' Then progress to advanced qualifications: 'The advanced diploma builds on this foundation, qualifying you for non-clinical psychology roles such as behavior specialist or psychological wellbeing practitioner.' When discussing registration requirements, maintain focus on current program value: 'While full registration requires additional study through a master's program, each qualification level provides valuable practical experience and career progression opportunities.' Throughout the explanation, use specific examples from current students: 'For instance, one of our recent graduates started as a research assistant while completing further qualifications.' The key is helping students visualize their journey while maintaining appropriate role boundaries and focusing on achievable next steps."
                        }
                    },
                    {
                        "title": "Financial Support Navigation",
                        "content": {
                            "student_trigger": "When the student exclaimed 'Oh wow, so with that 18 grand is there any chance that I can ask for the government help or any subsidiary?' (call_595908157534, seg_99), it marked a critical moment where financial concerns could have derailed enrollment momentum. The student's reaction to the course cost and immediate inquiry about support options indicated both strong interest in the program and a need for clarity on financial assistance to move forward.",
                            "consultant_response": "The consultant demonstrated strong collaborative planning by immediately addressing eligibility and explaining the support process: 'As an Australian citizen you do automatically have access to government support which is in the form of fee help where the only thing you'll need to take advantage of is to provide us with your tax file number so that we can defer your payments into government support.' This response effectively reduced the perceived financial barrier by confirming support availability and outlining clear next steps.",
                            "recommended_approach": "When students express concern about course costs, begin by acknowledging their financial considerations while positioning government support as a standard enrollment component. Start with confirming eligibility through a citizenship check, then explain FEE-HELP as a common solution: 'That's a very common concern, and I'm glad you asked about support options. Let me explain how most of our students manage this through FEE-HELP.' Transform the cost barrier into a procedural step by clearly outlining the support process and requirements. For example: 'While the course investment is significant, the government support system makes education accessible - many of our students use FEE-HELP to defer all costs until they're earning above the threshold.' When students show particular concern about cost, emphasize both the accessibility of support and the straightforward application process: 'Once we confirm your citizenship status, all you'll need is your tax file number to access FEE-HELP.' This approach combines reassurance with practical guidance while maintaining enrollment momentum."
                        }
                    },
                    {
                        "title": "Professional Network Development",
                        "content": {
                            "student_trigger": "The student expressed interest in professional connections by asking: 'Will I be able to connect with other professionals in my field?' (call_596267563999, seg_27). This revealed both a desire for networking opportunities and an understanding of the value of professional relationships in their chosen field.",
                            "consultant_response": "The consultant effectively outlined both formal and informal networking opportunities within the program structure, demonstrating how course interactions naturally lead to valuable professional relationships while maintaining appropriate pre-enrollment guidance boundaries.",
                            "recommended_approach": "When discussing networking opportunities, emphasize both formal and informal connection points within the program. Begin with concrete examples: 'In your cohort, you'll collaborate with professionals from various industries through group projects and discussion forums. Many students find these connections evolve into valuable professional relationships.' Share specific success stories: 'A recent graduate formed a professional network during group projects that led to industry collaborations post-graduation.' Describe how academic collaboration naturally builds professional networks: 'Our virtual team projects mirror real-world collaboration, creating organic networking opportunities.' Show how course interactions lead to lasting professional connections: 'Students often maintain these relationships well beyond graduation, creating a valuable industry network.' Pay particular attention to industry-specific opportunities, demonstrating how shared professional interests create natural networking opportunities. The key is showing how academic collaboration naturally evolves into professional networking while maintaining appropriate guidance boundaries and focusing on program-specific features that enable valuable connections."
                        }
                    }
                ],
                "opportunities": [
                    {
                        "title": "Return to Study Support",
                        "content": {
                            "student_trigger": "During segment 15, the student expressed significant anxiety about returning to study: 'I haven't studied for 15 years - I'm worried I won't be able to keep up.' This vulnerable disclosure represented a crucial moment to address confidence concerns and demonstrate available support mechanisms. The student's openness about their fears provided an opportunity to show how the program supports returning students through comprehensive resources and structured guidance.",
                            "consultant_response": "The consultant's response, while reflective, missed the opportunity to provide immediate reassurance: 'What's changed in your circumstances since then that's made you consider studying again?' While this question encouraged reflection, it didn't address the immediate concerns about academic readiness or highlight available support services that could build confidence and demonstrate clear pathways to success.",
                            "recommended_approach": "When students express concerns about returning to study after a long break, begin by normalizing their feelings while highlighting support systems. Start with validation: 'Many of our successful students return to study after similar breaks, and we have specific support systems to help you transition back.' Then explore their current strengths: 'Your professional experience often provides valuable perspectives that enhance academic success.' Share specific examples of how working professionals leverage their experience: 'Many students find their project management skills from work directly enhance their academic performance.' For instance, highlight a success story: 'One of our recent graduates returned to study after 20 years and found their industry experience gave them unique insights into case studies.' Outline concrete support mechanisms: 'We offer study skills workshops, time management coaching, and one-on-one learning adviser support.' The key is building confidence through tangible examples and clear support pathways, always maintaining a balance between encouragement and realistic preparation for academic demands."
                        }
                    },
                    {
                        "title": "Documentation Process Support",
                        "content": {
                            "student_trigger": "The student expressed uncertainty about documentation requirements, stating 'I don't have, I've only got like the degree itself, but I can send that through' (call_596179350052, seg_20). This moment revealed the need for clear guidance on document submission processes and alternatives.",
                            "consultant_response": "The consultant's brief response of 'It'll be a while' (call_596179350052, seg_21) missed the opportunity to provide constructive guidance or explore alternative solutions. This lack of detailed support likely increased the student's anxiety about documentation requirements.",
                            "recommended_approach": "When addressing documentation challenges, start by validating the student's current situation while outlining clear pathways forward. Begin with acknowledgment: 'I understand you have your degree certificate. Let's explore how we can work with that while obtaining any additional required documents.' Create a structured plan: 'First, let's submit what you have now to start the process. While that's being reviewed, we can work on obtaining the remaining documentation.' Provide specific alternatives: 'If there are delays with official transcripts, we can explore interim solutions such as unofficial records or employer verification.' Always maintain forward momentum: 'Even if we're waiting for some documents, we can begin other aspects of your enrollment preparation.' The goal is to transform documentation requirements from potential barriers into manageable steps while maintaining enrollment momentum."
                        }
                    }
                ]
            }
        }
    },
    "metadata": {
        "generated_date": "2024-12-13",
        "report_id": "MONU-B-COLL-W7-2024",
        "data_source": "OES Sales Excellence.AI"
    }
}