{
    "type": "behavioural",
    "requirement": "Consultative Approach",
    "week": 15,
    "university": "Monash",
    "reporting_period": "02-03_02-07",
    "first_page_title": "<em>Monash Consultative Approach |</em> percentage alignment to collaborative planning filtered for high-need students",
    "second_page_title": "<em>Weekly report initiative 2 |</em> Collaborative planning with high-need students",
    "graph": {
        "bars": [
            {
                "title": "12-02_12-06\nweek 6",
                "upper_bound": 269.55,
                "lower_bound": 118.89,
                "green": 159.84
            },
            {
                "title": "12-23_12-27\nweek 9",
                "upper_bound": 201.34,
                "lower_bound": 51.41,
                "green": 152.6
            },
            {
                "title": "12-30_01-03\nweek 10",
                "upper_bound": 185.93,
                "lower_bound": 14.0,
                "green": 149.83
            },
            {
                "title": "01-06_01-10\nweek 11",
                "upper_bound": 190.51,
                "lower_bound": 60.45,
                "green": 135.45
            },
            {
                "title": "01-13_01-17\nweek 12",
                "upper_bound": 183.08,
                "lower_bound": 82.0,
                "green": 149.51
            },
            {
                "title": "01-20_01-24\nweek 13",
                "upper_bound": 189.9,
                "lower_bound": 85.82,
                "green": 139.49
            },
            {
                "title": "01-27_01-31\nweek 14",
                "upper_bound": 225.5,
                "lower_bound": 84.42,
                "green": 123.13
            },
            {
                "title": "02-03_02-07\nweek 15",
                "upper_bound": 214.86,
                "lower_bound": 42.0,
                "green": 154.42
            }
        ],
        "green_label": "Team average",
        "red_label": "Upper & Lower bound",
        "result_label": "86% = Team Average"
    },
    "individual_performance": {
        "verdicts_count": 2442,
        "consultant_results": [
            {
                "name": "Luke Williams",
                "high_need_score": "214.9",
                "all_score": "105.2",
                "percentage_high_need": "7/260 (2.7%)",
                "rank": 1
            },
            {
                "name": "Elisha Odhiambo",
                "high_need_score": "199.1",
                "all_score": "131.9",
                "percentage_high_need": "11/214 (5.1%)",
                "rank": 2
            },
            {
                "name": "Ramon Keane",
                "high_need_score": "175.6",
                "all_score": "129.5",
                "percentage_high_need": "17/233 (7.3%)",
                "rank": 3
            },
            {
                "name": "Alyssa Pennacchia",
                "high_need_score": "173.5",
                "all_score": "109.9",
                "percentage_high_need": "8/268 (3.0%)",
                "rank": 4
            },
            {
                "name": "Tayla Viglione",
                "high_need_score": "151.3",
                "all_score": "92.5",
                "percentage_high_need": "14/296 (4.7%)",
                "rank": 5
            },
            {
                "name": "Mrudang Pancholi",
                "high_need_score": "137.4",
                "all_score": "99.4",
                "percentage_high_need": "15/273 (5.5%)",
                "rank": 6
            },
            {
                "name": "Pawan Thapa",
                "high_need_score": "137.1",
                "all_score": "77.7",
                "percentage_high_need": "13/278 (4.7%)",
                "rank": 7
            },
            {
                "name": "Michael Bosman",
                "high_need_score": "132.3",
                "all_score": "100.1",
                "percentage_high_need": "11/257 (4.3%)",
                "rank": 8
            },
            {
                "name": "Michael Whyte",
                "high_need_score": "112.1",
                "all_score": "108.5",
                "percentage_high_need": "5/83 (6.0%)",
                "rank": 9
            },
            {
                "name": "James Lockie",
                "high_need_score": "42.0",
                "all_score": "57.8",
                "percentage_high_need": "6/223 (2.7%)",
                "rank": 10
            },
            {
                "name": "Olive Jerome",
                "high_need_score": "0.0",
                "all_score": "55.2",
                "percentage_high_need": "1/57 (1.8%)",
                "rank": 11
            }
        ],
        "average_result": {
            "name": "Team average",
            "high_need_score": "154.4",
            "all_score": "102.6",
            "percentage_high_need": "108/2442 (4.4%)"
        }
    },
    "weekly_insights": {
        "verdicts_count": 257,
        "insights": {
            "concise": {
                "positive": [
                    {
                        "title": "Effective Work-Study Integration",
                        "content": "Student trigger: Student stated: 'I work rotating shifts at the hospital, not sure how I'll manage study' (call_595732493616, seg_23), followed by similar concerns: 'My roster changes every week, and I often work nights' (call_595732548084, seg_163). | Context/impact: Critical moment to demonstrate how program design specifically accommodates healthcare shift workers while maintaining enrollment momentum. | Consultant response: Consultant provided practical solution: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24). | Improvement: Include more specific examples of successful study patterns from current healthcare students with varied shift patterns."
                    },
                    {
                        "title": "Career Development Alignment",
                        "content": "Student trigger: Student stated: 'I'm a statistician and an analyst at the State Electricity Commission and we are building a bit of a team...but it was the managerial side and the kind of business analytics side that I don't have so much experience in' (595555449904, seg_26). | Context/impact: Clear demonstration needed of how program bridges technical expertise with management capabilities while maintaining enrollment momentum. | Consultant response: Consultant effectively connected background to benefits: 'given that you do have that statistics background and now working in that analyst role...it could be a formalization of some things you do know whilst also providing insights into new avenues' (595555449904, seg_49). | Improvement: Include more specific examples of how program content builds management capabilities while leveraging existing technical expertise."
                    },
                    {
                        "title": "Educational Pathway Planning",
                        "content": "Student trigger: Student stated: 'I'm looking at a pathway into psychology, into clinical psych' (call_595566214918, seg_70). | Context/impact: Critical moment for establishing program relevance and alignment with career aspirations while maintaining appropriate guidance boundaries. | Consultant response: Consultant provided clear pathway: 'Yeah, so the next course in the APAC sequence is the fourth year program...Honours program or its equivalent is next' (call_595566214918, seg_71). | Improvement: Include more discussion of immediate next steps while referring detailed career planning to appropriate post-enrollment resources."
                    }
                ],
                "opportunities": [
                    {
                        "title": "Documentation Support",
                        "content": "Student trigger: Student expressed: 'Apparently my CV's not on file for my application to continue with my Master's' (call_595555490953, seg_46). | Context/impact: Documentation issues creating potential barrier to enrollment progression requiring clear resolution path. | Consultant response: Consultant gave basic response: 'Oh, okay. Rightio. Would you like me to give you a call once he wraps up his current conversation?' (call_595555490953, seg_49). | Improvement: Provide clear guidance on documentation requirements, submission options, and immediate support resources."
                    },
                    {
                        "title": "Life Transition Planning",
                        "content": "Student trigger: Student shared: 'I'm working full-time until the end of February and then I'll be unemployed' (call_595554925199, seg_155). | Context/impact: Critical opportunity to demonstrate how program can support major life transitions while maintaining appropriate boundaries. | Consultant response: Consultant offered general flexibility: 'So more than welcome to take several study breaks throughout the course if needed' (call_595554925199, seg_52). | Improvement: Develop more comprehensive discussion of how program flexibility supports employment transitions while clearly distinguishing support services."
                    },
                    {
                        "title": "Career Development Support",
                        "content": "Student trigger: Student shared: 'Actually, I was just looking to do some small course for AI related like finance or something...for my future development purpose because I'm a CPA' (call_595451450076, seg_15). | Context/impact: Opportunity to align program features with professional development needs while maintaining appropriate guidance scope. | Consultant response: Consultant suggested: 'If you want just a short course, you probably won't need to look towards a postgraduate degree' (call_595451450076, seg_88). | Improvement: Better explore immediate program benefits and specific course alignments while referring detailed career planning to appropriate resources."
                    }
                ]
            },
            "verbose": {
                "positive": [
                    {
                        "title": "Effective Work-Study Integration",
                        "content": {
                            "student_trigger": "In call 595732493616 (segment 23), the student expressed significant concern about balancing study with shift work: 'I work rotating shifts at the hospital, not sure how I'll manage study.' This revealed both interest in the program and anxiety about practical implementation. Similar concerns emerged in call 595732548084 (segment 163) where another healthcare worker noted: 'My roster changes every week, and I often work nights.' These moments represented critical opportunities to demonstrate how our program specifically accommodates healthcare professionals' unique scheduling challenges.",
                            "consultant_response": "The primary consultant demonstrated strong understanding of healthcare workflows, responding with: 'Many of our nursing students study between shifts. Our online platform lets you download materials for offline study during quiet periods' (call_595732493616, seg_24). This practical example resonated strongly, with the student responding: 'That actually sounds manageable' (seg_25). In the supporting call, the consultant built on the flexible access theme: 'The beauty of our platform is you can switch between online and offline study. Some students download their materials before night shifts' (call_595732548084, seg_164). Both consultants effectively moved the conversation from 'if' to 'how', directly addressing practical concerns while maintaining momentum.",
                            "recommended_approach": "When addressing shift workers' scheduling concerns, start by validating their specific work pattern before showing how our program design aligns with healthcare workflows. Share concrete examples of how current students manage study around shifts - whether it's downloading materials for night shifts, studying during quiet periods, or breaking study into small blocks between shifts. The key is making flexibility tangible rather than theoretical. For instance, explain how asynchronous learning means no mandatory live sessions, and offline access means study can happen even in areas with poor connectivity. For those with rotating rosters, emphasize how weekly study patterns can adapt to changing schedules. Pay particular attention to students working night shifts or long rotations, showing how our platform's flexibility specifically addresses these challenges. The goal is to transform perceived scheduling barriers into manageable planning opportunities, always grounding explanations in healthcare-specific scenarios that resonate with their experience."
                        }
                    },
                    {
                        "title": "Career Development Alignment",
                        "content": {
                            "student_trigger": "At segment 26 of the call, the student revealed their professional context and aspirations: 'I'm a statistician and an analyst at the State Electricity Commission and we are building a bit of a team...but it was the managerial side and the kind of business analytics side that I don't have so much experience in.' This disclosure presented a prime opportunity to demonstrate program alignment with career development goals while maintaining appropriate guidance boundaries.",
                            "consultant_response": "The consultant demonstrated strong collaborative planning by effectively connecting the student's background to program benefits: 'given that you do have that statistics background and now working in that analyst role...it could be a formalization of some things you do know whilst also providing insights into new avenues' (segment 49). This response successfully validated existing expertise while highlighting growth opportunities, maintaining appropriate career guidance boundaries.",
                            "recommended_approach": "When students reveal specific technical backgrounds and management aspirations, begin by acknowledging their expertise while identifying clear development pathways. Start with validation: 'Your strong background in statistics provides an excellent foundation for advancing into management analytics.' Then explore specific growth areas: 'Which aspects of business analytics would be most valuable in your team leadership role?' Use their responses to highlight relevant program components, always connecting back to their career context. For instance: 'Our advanced analytics modules focus on translating technical insights into strategic business decisions, which aligns perfectly with your transition into team leadership.' Pay particular attention to students moving from technical to management roles, showing how the program bridges this transition. When discussing course content, emphasize both the practical applications and the strategic thinking aspects, showing how the program builds upon technical expertise to develop management capabilities. The goal is to transform identified skill gaps into clear development opportunities while maintaining appropriate career guidance boundaries."
                        }
                    },
                    {
                        "title": "Educational Pathway Planning",
                        "content": {
                            "student_trigger": "When the student expressed 'I'm looking at a pathway into psychology, into clinical psych' (call_595566214918, seg_70), they revealed a critical need for understanding how the program aligned with their career aspirations. This moment represented a pivotal opportunity to demonstrate the program's relevance to their professional goals while maintaining appropriate boundaries in career guidance.",
                            "consultant_response": "The consultant effectively responded with a clear progression outline: 'Yeah, so the next course in the APAC sequence is the fourth year program...Honours program or its equivalent is next' (call_595566214918, seg_71). This response successfully balanced providing clear direction while staying within appropriate guidance boundaries. The consultant's approach of breaking down the educational pathway into distinct, manageable steps helped the student understand their journey while maintaining focus on immediate enrollment decisions.",
                            "recommended_approach": "When addressing pathway queries, begin by acknowledging career aspirations while maintaining clear role boundaries. Start with validating the student's goals: 'Understanding your pathway to clinical psychology is important. Let me outline the educational steps while connecting you with resources for detailed career planning.' Focus on immediate next steps and program benefits, such as 'Our program provides the foundation you need through accredited coursework, research preparation, and clinical skill development.' For students seeking detailed career guidance, clearly distinguish roles: 'While I can outline the educational requirements, our career advisors post-enrollment can help develop detailed study plans aligned with your clinical psychology goals.' Always keep the focus on how program features support their immediate educational decisions while ensuring students understand where to find additional career planning support. The goal is to provide clear academic guidance while maintaining appropriate boundaries regarding specific career advice."
                        }
                    }
                ],
                "opportunities": [
                    {
                        "title": "Documentation Support",
                        "content": {
                            "student_trigger": "During call 595555490953 at segment 46, the student expressed concern about missing documentation: 'Apparently my CV's not on file for my application to continue with my Master's.' This revealed an immediate barrier to enrollment progression that required clear guidance and support to resolve.",
                            "consultant_response": "The consultant provided only basic acknowledgment: 'Oh, okay. Rightio. Would you like me to give you a call once he wraps up his current conversation?' (segment 49). This response failed to address the immediate documentation issue or provide clear guidance on resolution steps, potentially leaving the student uncertain about how to proceed.",
                            "recommended_approach": "When addressing documentation issues, begin by acknowledging the specific concern and immediately outlining available support options. Start with clear confirmation: 'I understand your CV is missing from the application. Let me work with you to resolve this quickly.' Then provide specific guidance: 'There are several ways we can update your application with the CV. You can submit it directly through our online portal, or I can connect you with our applications team for immediate assistance.' For students expressing urgency, emphasize the support available: 'Many students face similar documentation challenges, and we have dedicated teams to help with exactly this type of requirement.' Walk through each step clearly: 'First, let's verify the CV format requirements. Then, I'll show you the quickest way to submit it and confirm it's been received.' The goal is to transform documentation challenges from barriers into manageable steps while ensuring students feel supported throughout the process."
                        }
                    },
                    {
                        "title": "Life Transition Planning",
                        "content": {
                            "student_trigger": "The student disclosed: 'I'm working full-time until the end of February and then I'll be unemployed' (call_595554925199, seg_155). This revelation presented a crucial opportunity to demonstrate how the program could adapt to their changing circumstances while maintaining appropriate support boundaries.",
                            "consultant_response": "The consultant's response was limited to general flexibility options: 'So more than welcome to take several study breaks throughout the course if needed' (call_595554925199, seg_52). While acknowledging program flexibility, this response missed the opportunity to explore how specific program features could support their transition while maintaining appropriate boundaries between sales and support roles.",
                            "recommended_approach": "When students reveal significant life transitions, begin by acknowledging their situation while focusing on relevant program features. Start with validation: 'I understand you're going through an employment transition. Let me show you how our program's flexibility can support you during this change.' Then highlight specific program features that address their circumstances: 'Our flexible study options allow you to adjust your study load based on your circumstances, and you can access all materials 24/7 to fit your changing schedule.' When discussing support, clearly distinguish between pre- and post-enrollment services: 'While I can outline our program's flexible features, once enrolled, our learning coaches can help create detailed study plans that adapt to your changing situation.' Share specific examples: 'Many students use employment transitions to focus more intensively on their studies, taking advantage of our accelerated study options.' The goal is to demonstrate program value while maintaining appropriate support boundaries and setting clear expectations for different types of assistance available throughout their journey."
                        }
                    },
                    {
                        "title": "Career Development Support",
                        "content": {
                            "student_trigger": "The student expressed specific professional development goals: 'Actually, I was just looking to do some small course for AI related like finance or something...for my future development purpose because I'm a CPA' (call_595451450076, seg_15). This revealed both clear career advancement aspirations and a need to understand how program components could support professional growth.",
                            "consultant_response": "The consultant provided a limited response focused on discouraging program fit rather than exploring alignment possibilities: 'If you want just a short course, you probably won't need to look towards a postgraduate degree' (call_595451450076, seg_88). This missed an opportunity to demonstrate program value and explore how specific components could support the student's professional development goals.",
                            "recommended_approach": "When addressing professional development inquiries, begin by validating the student's career goals while maintaining appropriate guidance boundaries. Start with acknowledgment: 'I understand you're looking to enhance your CPA expertise with AI knowledge. Let me show you how our program components could support this goal.' Then focus on immediate program benefits that align with their objectives: 'Our finance courses include specific modules on AI applications, which many accounting professionals find directly applicable to their work.' When students seek detailed career guidance, clearly distinguish roles: 'While I can outline our program's relevant features, our career advisors post-enrollment can help create a detailed professional development plan.' This approach maintains helpful guidance while setting clear expectations about different types of support available. The goal is to demonstrate immediate program value while ensuring students understand the resources available for detailed career planning post-enrollment."
                        }
                    }
                ]
            }
        }
    },
    "metadata": {
        "generated_date": "2024-12-13",
        "report_id": "MONU-B-COLL-W7-2024",
        "data_source": "OES Sales Excellence.AI"
    }
}