{
    "type": "behavioural",
    "requirement": "Collaborative planning",
    "week": 13,
    "university": "Monash",
    "reporting_period": "01-20_01-24",
    "first_page_title": "<em>Monash Collaborative planning |</em> percentage alignment to collaborative planning filtered for high-need students",
    "second_page_title": "<em>Weekly report initiative 2 |</em> Collaborative planning with high-need students",
    "graph": {
        "bars": [
            {
                "title": "12-02_12-06\nweek 6",
                "upper_bound": 269.55,
                "lower_bound": 118.89,
                "green": 159.84
            },
            {
                "title": "12-23_12-27\nweek 9",
                "upper_bound": 201.34,
                "lower_bound": 51.41,
                "green": 152.6
            },
            {
                "title": "12-30_01-03\nweek 10",
                "upper_bound": 185.93,
                "lower_bound": 14.0,
                "green": 149.83
            },
            {
                "title": "01-06_01-10\nweek 11",
                "upper_bound": 190.51,
                "lower_bound": 60.45,
                "green": 135.45
            },
            {
                "title": "01-13_01-17\nweek 12",
                "upper_bound": 183.08,
                "lower_bound": 82.0,
                "green": 149.51
            },
            {
                "title": "01-20_01-24\nweek 13",
                "upper_bound": 189.9,
                "lower_bound": 85.82,
                "green": 139.49
            }
        ],
        "green_label": "Team average",
        "red_label": "Upper & Lower bound",
        "result_label": "86% = Team Average"
    },
    "individual_performance": {
        "verdicts_count": 2737,
        "consultant_results": [
            {
                "name": "Elisha Odhiambo",
                "high_need_score": "189.9",
                "all_score": "137.5",
                "percentage_high_need": "14/283 (4.9%)",
                "rank": 1
            },
            {
                "name": "Ramon Keane",
                "high_need_score": "186.0",
                "all_score": "137.6",
                "percentage_high_need": "18/237 (7.6%)",
                "rank": 2
            },
            {
                "name": "Michael Whyte",
                "high_need_score": "145.2",
                "all_score": "88.3",
                "percentage_high_need": "10/168 (6.0%)",
                "rank": 3
            },
            {
                "name": "Mrudang Pancholi",
                "high_need_score": "144.6",
                "all_score": "116.4",
                "percentage_high_need": "14/269 (5.2%)",
                "rank": 4
            },
            {
                "name": "Luke Williams",
                "high_need_score": "136.2",
                "all_score": "101.4",
                "percentage_high_need": "10/228 (4.4%)",
                "rank": 5
            },
            {
                "name": "Pawan Thapa",
                "high_need_score": "127.2",
                "all_score": "87.3",
                "percentage_high_need": "18/227 (7.9%)",
                "rank": 6
            },
            {
                "name": "Michael Bosman",
                "high_need_score": "118.6",
                "all_score": "105.7",
                "percentage_high_need": "8/342 (2.3%)",
                "rank": 7
            },
            {
                "name": "Tayla Viglione",
                "high_need_score": "117.9",
                "all_score": "101.2",
                "percentage_high_need": "17/316 (5.4%)",
                "rank": 8
            },
            {
                "name": "Olive Jerome",
                "high_need_score": "108.7",
                "all_score": "62.5",
                "percentage_high_need": "3/66 (4.5%)",
                "rank": 9
            },
            {
                "name": "Alyssa Pennacchia",
                "high_need_score": "95.4",
                "all_score": "95.8",
                "percentage_high_need": "11/280 (3.9%)",
                "rank": 10
            },
            {
                "name": "James Lockie",
                "high_need_score": "85.8",
                "all_score": "73.5",
                "percentage_high_need": "7/321 (2.2%)",
                "rank": 11
            }
        ],
        "average_result": {
            "name": "Team average",
            "high_need_score": "139.5",
            "all_score": "104.5",
            "percentage_high_need": "130/2737 (4.7%)"
        }
    },
    "weekly_insights": {
        "verdicts_count": 257,
        "insights": {
            "concise": {
                "positive": [
                    {
                        "title": "Strategic Educational Pathway Guidance",
                        "content": "Student trigger: Students seeking clarity on psychology program progression and registration requirements | Context/impact: Clear progression guidance crucial for informed enrollment decisions | Consultant response: Comprehensive pathway explanation while maintaining boundaries: 'So you've got the first course being the Graduate Diploma in Psychology... this aligns with APAC accreditation requirements.' | Improvement: None needed - exemplary demonstration of pathway guidance"
                    },
                    {
                        "title": "Professional Study Integration",
                        "content": "Student trigger: Working professionals expressing concerns about managing full-time work alongside studies | Context/impact: Effective demonstration of program flexibility increased confidence in work-study balance | Consultant response: Clear explanation of program design for working professionals: 'This course is created for students who are working full-time. Our lectures are held after 6 p.m... all recorded for you.' | Improvement: Could enhance with more specific examples of successful work-study strategies"
                    },
                    {
                        "title": "Strategic Support Navigation",
                        "content": "Student trigger: Students seeking clarity on available support services, including specific needs like autism support | Context/impact: Building enrollment confidence through clear support system understanding | Consultant response: Clear outline of support layers: 'We have responsive academic staff support within 24 hours, student coaching services, and provisions for assignment extensions.' | Improvement: None needed - maintained excellent balance of support information and role boundaries"
                    }
                ],
                "opportunities": [
                    {
                        "title": "Enhanced Context Integration",
                        "content": "Student trigger: Students indicating significant life changes or seeking detailed understanding of study requirements | Context/impact: Missed opportunities to understand how circumstances affect study needs | Consultant response: Focused on administrative aspects without exploring implications for study success | Improvement: Should explore how life circumstances impact study patterns and support needs"
                    },
                    {
                        "title": "Career Integration Planning",
                        "content": "Student trigger: Students seeking guidance on industry work potential and career development | Context/impact: Insufficient career pathway guidance impacted enrollment confidence | Consultant response: Basic referral to career services without exploring program alignment to career goals | Improvement: Should better connect program benefits to career goals while maintaining boundaries"
                    },
                    {
                        "title": "Financial Planning Support",
                        "content": "Student trigger: Students seeking clarity on payment options and financial pathways | Context/impact: Limited financial planning discussion affected enrollment confidence | Consultant response: Provided basic fee information without exploring comprehensive planning options | Improvement: Should engage in more thorough financial planning while maintaining role boundaries"
                    }
                ]
            },
            "verbose": {
                "positive": [
                    {
                        "title": "Strategic Educational Pathway Guidance",
                        "content": {
                            "student_trigger": "Multiple students sought guidance on academic pathways, particularly regarding psychology program progression and registration requirements. In the primary example, the student expressed: 'And so, say that I wanted to go down the pathway of becoming a registered psychologist...' These inquiries represented critical opportunities for collaborative planning that would connect immediate enrollment decisions to long-term career goals.",
                            "consultant_response": "Consultants demonstrated excellent collaborative planning by providing comprehensive pathway explanations while maintaining appropriate boundaries. The primary example included clear guidance: 'So you've got the first course being the Graduate Diploma in Psychology... this aligns with APAC accreditation requirements.' This approach effectively balanced detailed program information with appropriate role boundaries.",
                            "recommended_approach": "To maintain this exemplary approach: 1) Acknowledge specific career goals while staying within educational guidance boundaries, 2) Provide clear program progression steps, 3) Connect immediate decisions to long-term objectives, 4) Maintain focus on educational requirements rather than career advice, and 5) Create clear expectations about the educational journey."
                        }
                    },
                    {
                        "title": "Professional Study Integration",
                        "content": {
                            "student_trigger": "Multiple students expressed concerns about balancing full-time work with study requirements. Primary example stated: 'Because right now I'm doing a full-time job' while another noted 'I know it kind of looks like a part-time schedule but I just wanted to know because I don't really have any plans to not be working full-time.' These represented critical moments for demonstrating program flexibility.",
                            "consultant_response": "Consultants effectively demonstrated program accessibility through structured explanations: 'This course is created for students who are working full-time. This is a part-time study. Our lectures are held after 6 p.m... all recorded for you so that you can view it the next day as well.' This approach successfully showed how the program accommodates working professionals while maintaining appropriate guidance boundaries.",
                            "recommended_approach": "To enhance this strong practice: 1) Acknowledge specific work-life balance concerns, 2) Provide concrete examples of program flexibility, 3) Explain multiple study options, 4) Highlight support mechanisms, and 5) Empower student choice while maintaining appropriate scope."
                        }
                    },
                    {
                        "title": "Strategic Support Navigation",
                        "content": {
                            "student_trigger": "Multiple students sought information about available support services, with specific needs including autism support. These situations required careful balance between providing comprehensive support information while maintaining appropriate sales role boundaries.",
                            "consultant_response": "Consultants demonstrated exemplary collaborative planning by outlining multiple support layers while maintaining appropriate boundaries: 'We have responsive academic staff support within 24 hours, student coaching services, and provisions for assignment extensions.' This approach effectively balanced immediate support information needs with appropriate role boundaries.",
                            "recommended_approach": "Continue this effective approach: 1) Acknowledge specific support needs while maintaining appropriate boundaries, 2) Provide clear overview of available support systems, 3) Position detailed support planning as post-enrollment service, 4) Create clear expectations about support access, and 5) Maintain focus on immediate enrollment decision support."
                        }
                    }
                ],
                "opportunities": [
                    {
                        "title": "Enhanced Context Integration",
                        "content": {
                            "student_trigger": "Students indicated significant context changes or specific needs. Primary example: 'Is there any information about... the unit structure, in terms of like how it operates in that sort of six-week condensed, like in terms of like assessments and content to go through?' Another noted: 'No, no, I have another address now.' These moments revealed opportunities to explore impacts on study planning.",
                            "consultant_response": "Consultants focused on surface-level responses without exploring deeper implications. Responses were limited to administrative updates or basic information without investigating how changes might affect study success or support needs. This approach missed opportunities to create more comprehensive and supportive study plans.",
                            "recommended_approach": "Strengthen approach by: 1) Acknowledging life changes or specific needs, 2) Exploring implications for study success, 3) Discussing potential support mechanisms needed, 4) Creating plans that account for student circumstances, and 5) Maintaining appropriate boundaries while being supportive."
                        }
                    },
                    {
                        "title": "Career Integration Planning",
                        "content": {
                            "student_trigger": "Multiple students sought guidance on potential industry work opportunities and career development. Primary example showed specific interest in career progression: 'Is there potential of finding work in the industry during study?' These situations required careful balance of career guidance while maintaining appropriate boundaries.",
                            "consultant_response": "Consultants typically provided basic referrals to career services without exploring how program features could support career development. The response pattern showed minimal engagement with career planning aspects while missing opportunities to demonstrate program value within appropriate role boundaries.",
                            "recommended_approach": "To enhance career integration: 1) Acknowledge career interests explicitly, 2) Connect program features to career development, 3) Explain how program structure supports professional growth, 4) Highlight relevant support services, and 5) Create clear expectations about career development opportunities within appropriate scope."
                        }
                    },
                    {
                        "title": "Financial Planning Support",
                        "content": {
                            "student_trigger": "Students seeking clarity on financial options with questions like: 'Could the $10,000 be paid over time or would it have to be all upfront?' This indicated a crucial need for understanding financial pathways and planning options while maintaining appropriate consulting boundaries.",
                            "consultant_response": "While basic fee information was provided, consultants missed opportunities to engage in comprehensive financial planning discussions or explain available resources to support educational investment decisions. This limited response failed to address a key enrollment barrier while staying within appropriate scope.",
                            "recommended_approach": "An enhanced approach should: 1) Acknowledge financial concerns, 2) Outline available payment options, 3) Explain support mechanisms, 4) Provide overview of financial pathways, and 5) Direct detailed planning to appropriate specialists."
                        }
                    }
                ]
            }
        }
    },
    "metadata": {
        "generated_date": "2024-12-13",
        "report_id": "MONU-B-COLL-W7-2024",
        "data_source": "OES Sales Excellence.AI"
    }
}