{
    "type": "behavioural",
    "requirement": "Collaborative planning",
    "week": 11,
    "university": "Monash",    
    "reporting_period": "01-06_01-10",
    "first_page_title": "<em>Monash Collaborative planning |</em> percentage alignment to collaborative planning filtered for high-need students",
    "second_page_title": "<em>Weekly report initiative 2 |</em> Collaborative planning with high-need students",
    "graph": {
        "bars": [ 
            {
                "title": "12-02_12-06\nweek 6",
                "upper_bound": 269.55,
                "lower_bound": 118.89,
                "green": 159.84
            },
            {
                "title": "12-23_12-27\nweek 9",
                "upper_bound": 201.34,
                "lower_bound": 51.41,
                "green": 152.60
            },
            {
                "title": "12-30_01-03\nweek 10",
                "upper_bound": 185.93,
                "lower_bound": 14.00,
                "green": 149.83
            },
            {
                "title": "01-06_01-10\nweek 11",
                "upper_bound": 190.51,
                "lower_bound": 60.45,
                "green": 135.45
            }
        ],
        "green_label": "Team average",
        "red_label": "Upper & Lower bound",
        "result_label": "86% = Team Average"
    },
    "individual_performance": {
        "verdicts_count": 345,
        "consultant_results": [
            {
                "name": "Elisha Odhiambo",
                "rank": 1,
                "high_need_score": "50.13%",
                "all_score": "37.25%",
                "percentage_high_need": "17/17 (100.0%)"
            },
            {
                "name": "James Lockie",
                "rank": 2,
                "high_need_score": "48.34%",
                "all_score": "27.17%",
                "percentage_high_need": "18/20 (90.0%)"
            },
            {
                "name": "Alyssa Pennacchia",
                "rank": 3,
                "high_need_score": "41.42%",
                "all_score": "30.60%",
                "percentage_high_need": "12/20 (60.0%)"
            },
            {
                "name": "Tayla Viglione",
                "rank": 4,
                "high_need_score": "34.22%",
                "all_score": "31.62%",
                "percentage_high_need": "14/20 (70.0%)"
            },
            {
                "name": "Pawan Thapa",
                "rank": 5,
                "high_need_score": "33.80%",
                "all_score": "28.89%",
                "percentage_high_need": "14/20 (70.0%)"
            },
            {
                "name": "Mrudang Pancholi",
                "rank": 6,
                "high_need_score": "33.65%",
                "all_score": "24.87%",
                "percentage_high_need": "14/20 (70.0%)"
            },
            {
                "name": "Ramon Keane",
                "rank": 7,
                "high_need_score": "32.63%",
                "all_score": "27.74%",
                "percentage_high_need": "14/20 (70.0%)"
            },
            {
                "name": "Michael Whyte",
                "rank": 8,
                "high_need_score": "30.47%",
                "all_score": "25.86%",
                "percentage_high_need": "10/20 (50.0%)"
            },
            {
                "name": "Luke Williams",
                "rank": 9,
                "high_need_score": "28.66%",
                "all_score": "25.18%",
                "percentage_high_need": "14/20 (70.0%)"
            },
            {
                "name": "Olive Jerome",
                "rank": 10,
                "high_need_score": "15.91%",
                "all_score": "13.91%",
                "percentage_high_need": "18/20 (90.0%)"
            }
        ],
        "average_result": {
            "name": "Team average",
            "high_need_score": "35.64%",
            "all_score": "28.33%",
            "percentage_high_need": "14/20 (70.0%)"
        }
    },
    "weekly_insights": {
        "verdicts_count": 257,
        "insights": {
            "concise": {
                "positive": [
                    {
                        "title": "Strategic Career-Education Planning",
                        "content": "Consultants excel at connecting educational pathways with professional goals, particularly with healthcare professionals and career-focused students. Strong validation of experience while presenting advancement pathways increased enrollment confidence."
                    },
                    {
                        "title": "Effective Alternative Pathway Navigation",
                        "content": "Consultants demonstrated excellence in quickly identifying and presenting viable alternative qualification routes while maintaining student confidence and momentum, particularly effective with students lacking traditional prerequisites."
                    },
                    {
                        "title": "Flexible Study Integration",
                        "content": "Strong ability to adapt program structures and delivery to accommodate diverse student circumstances and commitments, creating clear educational pathways aligned with individual needs."
                    }
                ],
                "opportunities": [
                    {
                        "title": "Enhanced Financial Planning",
                        "content": "When students express significant concerns about program costs, consultants typically provide surface-level scholarship mentions without engaging in comprehensive financial planning discussions or exploring all available support options."
                    },
                    {
                        "title": "Work-Study Balance Strategy",
                        "content": "Greater emphasis needed on developing practical strategies for integrating study requirements with existing work commitments. Current responses lack detailed planning support for managing work-study balance."
                    },
                    {
                        "title": "Support Service Integration",
                        "content": "More structured approach needed when introducing available support mechanisms, particularly around language and academic preparation. Current responses provide basic referrals without comprehensive exploration of support options."
                    }
                ]
            },
            "verbose": {
                "positive": [
                    {
                        "title": "Strategic Career-Education Planning",
                        "content": {
                            "student_trigger": "Multiple healthcare professionals and career-focused students initiated discussions about program alignment with their professional goals. Primary example: 'I'm a doctor in a public hospital and so forth, so therefore it's more of, I thought it might be relevant to my line of work.'",
                            "consultant_response": "Consultants demonstrated excellence in collaborative planning by immediately recognizing and validating professional qualifications while presenting clear educational pathways. The primary response effectively acknowledged experience: 'Yeah wonderful... we can even get you started directly with the master's program' while maintaining appropriate advisory scope.",
                            "recommended_approach": "While maintaining professional boundaries, consultants should: 1) Acknowledge specific professional experience immediately, 2) Connect program elements to career contexts, 3) Explore specific areas of professional interest, 4) Create clear educational pathways aligned with career progression, and 5) Reference relevant post-enrollment career support services when appropriate."
                        }
                    },
                    {
                        "title": "Effective Alternative Pathway Navigation",
                        "content": {
                            "student_trigger": "Multiple instances where students required alternative program options due to eligibility constraints. Primary example shows student stating: 'No, unfortunately I haven't completed a Bachelor's degree,' revealing both interest and concern about qualification barriers.",
                            "consultant_response": "Consultants demonstrated excellent collaborative planning by quickly identifying and suggesting relevant alternatives while maintaining student confidence. Responses effectively suggested: 'We do have a grad cert that we can take a look at work experience for' while explaining progression opportunities.",
                            "recommended_approach": "This effective approach should be maintained by: 1) Acknowledging original program interest, 2) Quickly transitioning to relevant alternatives, 3) Highlighting key benefits aligned with student circumstances, 4) Maintaining enthusiasm while exploring new options, and 5) Explaining how alternative programs can still meet original goals."
                        }
                    },
                    {
                        "title": "Flexible Study Integration",
                        "content": {
                            "student_trigger": "Healthcare professionals and career-focused students seeking program alignment with professional goals and flexible study options to accommodate their existing commitments.",
                            "consultant_response": "Strong demonstration of adaptability in program delivery and structure, effectively connecting educational pathways with professional goals while maintaining appropriate advisory boundaries.",
                            "recommended_approach": "Continue to: 1) Validate professional experience immediately, 2) Present flexible study options clearly, 3) Connect program elements to career progression, 4) Create clear educational pathways, and 5) Maintain appropriate pre-enrollment boundaries while demonstrating support."
                        }
                    }
                ],
                "opportunities": [
                    {
                        "title": "Enhanced Financial Planning",
                        "content": {
                            "student_trigger": "Multiple students expressed significant concerns about program costs with statements like 'My main concern is about the tuition fees is quite high' and seeking clarity on payment options.",
                            "consultant_response": "Consultants typically provided surface-level responses about scholarship availability without engaging in detailed financial planning discussions. The common response pattern was exemplified by: 'Yeah, most definitely. So what we have are scholarships available.'",
                            "recommended_approach": "While maintaining appropriate boundaries, consultants should: 1) Acknowledge and validate financial concerns explicitly, 2) Provide clear overview of all available financial support options, 3) Explain payment plan structures and flexibility, 4) Connect students with appropriate financial advisors when needed, and 5) Create preliminary financial planning frameworks."
                        }
                    },
                    {
                        "title": "Work-Study Balance Strategy",
                        "content": {
                            "student_trigger": "Multiple students emphasized the need for work-study balance, expressing concerns like 'I think it would be a stretch, but I could probably do it' and sharing details about flexible work arrangements.",
                            "consultant_response": "Consultants typically provided basic acknowledgments without detailed solutions: 'Ah, I can see. Yeah, so you're looking for that flexibility around your studies while also working.' This surface-level response failed to address practical aspects of managing work-study balance.",
                            "recommended_approach": "A comprehensive approach while maintaining sales role boundaries should: 1) Explore specific work commitments and scheduling needs, 2) Present relevant program flexibility options with concrete examples, 3) Share high-level examples of successful work-study integration, 4) Position detailed study planning as a post-enrollment benefit, and 5) Create preliminary frameworks for managing peak work periods."
                        }
                    },
                    {
                        "title": "Support Service Integration",
                        "content": {
                            "student_trigger": "Multiple instances where students revealed personal circumstances requiring support consideration, particularly around language and academic preparation. Primary example shows student expressing concern: 'I wonder my English not enough for the psychology course.'",
                            "consultant_response": "Consultants typically provided basic referrals without comprehensive exploration of support options or creating clear support plans. These surface-level responses missed opportunities to demonstrate institutional commitment to student success.",
                            "recommended_approach": "An enhanced support service discussion should: 1) Acknowledge specific support needs explicitly, 2) Provide structured overview of relevant support services with concrete examples, 3) Explain access procedures clearly, 4) Connect support services to student success through specific examples, 5) Maintain enrollment focus while demonstrating support commitment."
                        }
                    }
                ]
            }
        }
    },
    "metadata": {
        "generated_date": "2024-12-13",
        "report_id": "MONU-B-COLL-W11-2024",
        "data_source": "OES Sales Excellence.AI"
    }
}